*** src/doc.rs:102:33: replace == with != in render

*** mutation diff:
--- src/doc.rs
+++ replace == with != in render
@@ -94,17 +94,17 @@
                 let mode = if fits(width.saturating_sub(col), inner, &stack) {
                     Mode::Flat
                 } else {
                     Mode::Break
                 };
                 stack.push((level, mode, inner));
             }
             Doc::IfBreak { broken, flat } => {
-                let s = if mode == Mode::Break { broken } else { flat };
+                let s = if mode != /* ~ changed by cargo-mutants ~ */ Mode::Break { broken } else { flat };
                 out.push_str(s);
                 col += display_width(s);
             }
             Doc::ForceBreak(inner) => stack.push((level, Mode::Break, inner)),
         }
     }
     out
 }

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (445709) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444\n\t}\n);\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literal_brace_stays_tight stdout ----

thread 'compound_literal_brace_stays_tight' (445710) panicked at tests/conformance.rs:282:5:
assertion `left == right` failed
  left: "p = &(struct shape){.x = 1,};\n"
 right: "p = &(struct shape){.x = 1};\n"

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (445711) panicked at tests/conformance.rs:403:5:
assertion `left == right` failed
  left: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4,}\n};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

failures:
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    enum_body_is_padded_when_flat
    enum_magic_comma_explodes
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    magic_trailing_comma_forces_explosion_with_trailing_comma
    messy_real_world_input_is_idempotent_and_safe

test result: FAILED. 37 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
