*** src/doc.rs:121:25: replace == with != in fits

*** mutation diff:
--- src/doc.rs
+++ replace == with != in fits
@@ -113,17 +113,17 @@
 /// the work still queued in `rest` up to the first newline?
 fn fits(mut remaining: usize, doc: &Doc, rest: &[(usize, Mode, &Doc)]) -> bool {
     let mut work: Vec<(Mode, &Doc)> = vec![(Mode::Flat, doc)];
     let mut rest_idx = rest.len();
     loop {
         let (mode, d) = if let Some(item) = work.pop() {
             item
         } else {
-            if rest_idx == 0 {
+            if rest_idx != /* ~ changed by cargo-mutants ~ */ 0 {
                 return true;
             }
             rest_idx -= 1;
             let (_, mode, d) = rest[rest_idx];
             (mode, d)
         };
         match d {
             Doc::Text(s) => {

---- doc::tests::flat_when_it_fits stdout ----

thread 'doc::tests::flat_when_it_fits' (447596) panicked at src/doc.rs:124:13:
attempt to subtract with overflow

failures:
    doc::tests::flat_when_it_fits

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
