*** src/doc.rs:12:5: replace display_width -> usize with 0

*** mutation diff:
--- src/doc.rs
+++ replace display_width -> usize with 0
@@ -4,17 +4,17 @@
 
 /// Columns a tab advances the cursor for the fits/overflow decision (§2.1, §8.5). Output still
 /// emits literal tabs; this width is only used for measuring.
 pub const TAB_WIDTH: usize = 4;
 
 /// Display width of `s` in columns. Text never contains tabs or newlines (indentation is emitted
 /// separately), so one column per `char` is exact for the measurement.
 pub fn display_width(s: &str) -> usize {
-    s.chars().count()
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// A layout document. Built bottom-up, then rendered at a width.
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum Doc {
     /// Verbatim text containing no newline.
     Text(String),
     /// A space when the enclosing group is flat; a newline + indentation when broken.

---- doc::tests::breaks_indent_relative_to_base_level stdout ----

thread 'doc::tests::breaks_indent_relative_to_base_level' (439242) panicked at src/doc.rs:207:9:
assertion `left == right` failed
  left: "(a)"
 right: "(\n\t\t\ta\n\t\t)"

---- doc::tests::fully_breaks_when_it_overflows stdout ----

thread 'doc::tests::fully_breaks_when_it_overflows' (439244) panicked at src/doc.rs:199:9:
assertion `left == right` failed
  left: "(a, b)"
 right: "(\n\ta,\n\tb\n)"

---- doc::tests::trailing_reserved_width_forces_a_break stdout ----

thread 'doc::tests::trailing_reserved_width_forces_a_break' (439245) panicked at src/doc.rs:213:9:
assertion `left == right` failed
  left: "(a)"
 right: "(\n\ta\n)"

failures:
    doc::tests::breaks_indent_relative_to_base_level
    doc::tests::fully_breaks_when_it_overflows
    doc::tests::trailing_reserved_width_forces_a_break

test result: FAILED. 1 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
