*** src/doc.rs:12:5: replace display_width -> usize with 1

*** mutation diff:
--- src/doc.rs
+++ replace display_width -> usize with 1
@@ -4,17 +4,17 @@
 
 /// Columns a tab advances the cursor for the fits/overflow decision (§2.1, §8.5). Output still
 /// emits literal tabs; this width is only used for measuring.
 pub const TAB_WIDTH: usize = 4;
 
 /// Display width of `s` in columns. Text never contains tabs or newlines (indentation is emitted
 /// separately), so one column per `char` is exact for the measurement.
 pub fn display_width(s: &str) -> usize {
-    s.chars().count()
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// A layout document. Built bottom-up, then rendered at a width.
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum Doc {
     /// Verbatim text containing no newline.
     Text(String),
     /// A space when the enclosing group is flat; a newline + indentation when broken.

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (787576) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(&(struct config){.alpha = 1111111111, .beta = 2222222222, .gamma = 3333333333, .delta = 4444444444});\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- condition_splits_on_the_outer_logical_operator stdout ----

thread 'condition_splits_on_the_outer_logical_operator' (787580) panicked at tests/conformance.rs:396:5:
assertion `left == right` failed
  left: "if (alpha_value > 100 || bravo_value > 200 || charlie_value > 300 || delta_value > 400 || echo_v > 5) {\n}\n"
 right: "if (\n\talpha_value > 100 ||\n\tbravo_value > 200 ||\n\tcharlie_value > 300 ||\n\tdelta_value > 400 ||\n\techo_v > 5\n) {\n}\n"

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (787579) panicked at tests/conformance.rs:302:5:
assertion `left == right` failed
  left: "dispatch(&(struct request){.id = 1234567, .kind = KIND_READ}, &response_buffer_out, default_timeout_ms);\n"
 right: "dispatch(\n\t&(struct request){.id = 1234567, .kind = KIND_READ},\n\t&response_buffer_out,\n\tdefault_timeout_ms\n);\n"

failures:
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literals_in_function_args
    condition_splits_on_the_outer_logical_operator
    declaration_with_brace_explodes_and_keeps_brace_attached
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    long_call_explodes_one_per_line
    long_for_header_explodes_one_clause_per_line
    long_if_condition_explodes_with_trailing_operators
    long_ternary_chain_explodes_flat_with_trailing_colons

test result: FAILED. 41 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
