*** src/doc.rs:145:34: replace == with != in fits

*** mutation diff:
--- src/doc.rs
+++ replace == with != in fits
@@ -137,17 +137,17 @@
                 for child in items.iter().rev() {
                     work.push((mode, child));
                 }
             }
             Doc::Nest(inner) => work.push((mode, inner)),
             Doc::Group(inner) => work.push((Mode::Flat, inner)),
             Doc::Line => match mode {
                 Mode::Flat => {
-                    if remaining == 0 {
+                    if remaining != /* ~ changed by cargo-mutants ~ */ 0 {
                         return false;
                     }
                     remaining -= 1;
                 }
                 Mode::Break => return true,
             },
             Doc::SoftLine => {
                 if mode == Mode::Break {

---- doc::tests::flat_when_it_fits stdout ----

thread 'doc::tests::flat_when_it_fits' (451027) panicked at src/doc.rs:194:9:
assertion `left == right` failed
  left: "(\n\ta,\n\tb\n)"
 right: "(a, b)"

failures:
    doc::tests::flat_when_it_fits

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
