*** src/doc.rs:153:25: replace == with != in fits

*** mutation diff:
--- src/doc.rs
+++ replace == with != in fits
@@ -145,17 +145,17 @@
                     if remaining == 0 {
                         return false;
                     }
                     remaining -= 1;
                 }
                 Mode::Break => return true,
             },
             Doc::SoftLine => {
-                if mode == Mode::Break {
+                if mode != /* ~ changed by cargo-mutants ~ */ Mode::Break {
                     return true;
                 }
             }
             Doc::IfBreak { broken, flat } => {
                 let s = if mode == Mode::Break { broken } else { flat };
                 let w = display_width(s);
                 if w > remaining {
                     return false;

---- doc::tests::fully_breaks_when_it_overflows stdout ----

thread 'doc::tests::fully_breaks_when_it_overflows' (452957) panicked at src/doc.rs:199:9:
assertion `left == right` failed
  left: "(a, b)"
 right: "(\n\ta,\n\tb\n)"

---- doc::tests::trailing_reserved_width_forces_a_break stdout ----

thread 'doc::tests::trailing_reserved_width_forces_a_break' (452958) panicked at src/doc.rs:213:9:
assertion `left == right` failed
  left: "(a)"
 right: "(\n\ta\n)"

failures:
    doc::tests::fully_breaks_when_it_overflows
    doc::tests::trailing_reserved_width_forces_a_break

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
