*** src/doc.rs:160:22: replace > with >= in fits

*** mutation diff:
--- src/doc.rs
+++ replace > with >= in fits
@@ -152,17 +152,17 @@
             Doc::SoftLine => {
                 if mode == Mode::Break {
                     return true;
                 }
             }
             Doc::IfBreak { broken, flat } => {
                 let s = if mode == Mode::Break { broken } else { flat };
                 let w = display_width(s);
-                if w > remaining {
+                if w >= /* ~ changed by cargo-mutants ~ */ remaining {
                     return false;
                 }
                 remaining -= w;
             }
             Doc::ForceBreak(_) => return false,
         }
     }
 }

*** result: Success
