*** src/doc.rs:63:5: replace render -> String with String::new()

*** mutation diff:
--- src/doc.rs
+++ replace render -> String with String::new()
@@ -55,63 +55,17 @@
     Flat,
     Break,
 }
 
 /// Render `doc`: groups that fit within `width` columns stay flat, the rest break fully.
 /// `start_col` is the cursor column before the document; `base_level` is the indentation, in tab
 /// levels, that broken lines and the closing delimiter return to.
 pub fn render(doc: &Doc, width: usize, start_col: usize, base_level: usize) -> String {
-    let mut out = String::new();
-    let mut col = start_col;
-    let mut stack: Vec<(usize, Mode, &Doc)> = vec![(base_level, Mode::Break, doc)];
-    while let Some((level, mode, d)) = stack.pop() {
-        match d {
-            Doc::Text(s) => {
-                out.push_str(s);
-                col += display_width(s);
-            }
-            Doc::Concat(items) => {
-                for child in items.iter().rev() {
-                    stack.push((level, mode, child));
-                }
-            }
-            Doc::Nest(inner) => stack.push((level + 1, mode, inner)),
-            Doc::Line | Doc::SoftLine => match mode {
-                Mode::Flat => {
-                    if matches!(d, Doc::Line) {
-                        out.push(' ');
-                        col += 1;
-                    }
-                }
-                Mode::Break => {
-                    out.push('\n');
-                    for _ in 0..level {
-                        out.push('\t');
-                    }
-                    col = level * TAB_WIDTH;
-                }
-            },
-            Doc::Group(inner) => {
-                let mode = if fits(width.saturating_sub(col), inner, &stack) {
-                    Mode::Flat
-                } else {
-                    Mode::Break
-                };
-                stack.push((level, mode, inner));
-            }
-            Doc::IfBreak { broken, flat } => {
-                let s = if mode == Mode::Break { broken } else { flat };
-                out.push_str(s);
-                col += display_width(s);
-            }
-            Doc::ForceBreak(inner) => stack.push((level, Mode::Break, inner)),
-        }
-    }
-    out
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Does `doc`, laid out flat, fit in `remaining` columns before the line would break — including
 /// the work still queued in `rest` up to the first newline?
 fn fits(mut remaining: usize, doc: &Doc, rest: &[(usize, Mode, &Doc)]) -> bool {
     let mut work: Vec<(Mode, &Doc)> = vec![(Mode::Flat, doc)];
     let mut rest_idx = rest.len();
     loop {

---- doc::tests::breaks_indent_relative_to_base_level stdout ----

thread 'doc::tests::breaks_indent_relative_to_base_level' (789498) panicked at src/doc.rs:161:9:
assertion `left == right` failed
  left: ""
 right: "(\n\t\t\ta\n\t\t)"

---- doc::tests::flat_when_it_fits stdout ----

thread 'doc::tests::flat_when_it_fits' (789499) panicked at src/doc.rs:148:9:
assertion `left == right` failed
  left: ""
 right: "(a, b)"

---- doc::tests::fully_breaks_when_it_overflows stdout ----

thread 'doc::tests::fully_breaks_when_it_overflows' (789500) panicked at src/doc.rs:153:9:
assertion `left == right` failed
  left: ""
 right: "(\n\ta,\n\tb\n)"

failures:
    doc::tests::breaks_indent_relative_to_base_level
    doc::tests::flat_when_it_fits
    doc::tests::fully_breaks_when_it_overflows
    doc::tests::trailing_reserved_width_forces_a_break

test result: FAILED. 0 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
