*** src/doc.rs:70:21: replace += with *= in render

*** mutation diff:
--- src/doc.rs
+++ replace += with *= in render
@@ -62,17 +62,17 @@
 pub fn render(doc: &Doc, width: usize, start_col: usize, base_level: usize) -> String {
     let mut out = String::new();
     let mut col = start_col;
     let mut stack: Vec<(usize, Mode, &Doc)> = vec![(base_level, Mode::Break, doc)];
     while let Some((level, mode, d)) = stack.pop() {
         match d {
             Doc::Text(s) => {
                 out.push_str(s);
-                col += display_width(s);
+                col *= /* ~ changed by cargo-mutants ~ */ display_width(s);
             }
             Doc::Concat(items) => {
                 for child in items.iter().rev() {
                     stack.push((level, mode, child));
                 }
             }
             Doc::Nest(inner) => stack.push((level + 1, mode, inner)),
             Doc::Line | Doc::SoftLine => match mode {

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (789454) panicked at tests/conformance.rs:291:5:
assertion `left == right` failed
  left: "configure(&(struct opts){\n\t\t.mode = 1,\n\t\t.flags = 0,\n\t}, count);\n"
 right: "configure(&(struct opts){.mode = 1, .flags = 0}, count);\n"

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (789470) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (789468) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    compound_literals_in_function_args
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase

test result: FAILED. 49 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
