*** src/doc.rs:77:51: replace + with - in render

*** mutation diff:
--- src/doc.rs
+++ replace + with - in render
@@ -69,17 +69,17 @@
                 out.push_str(s);
                 col += display_width(s);
             }
             Doc::Concat(items) => {
                 for child in items.iter().rev() {
                     stack.push((level, mode, child));
                 }
             }
-            Doc::Nest(inner) => stack.push((level + 1, mode, inner)),
+            Doc::Nest(inner) => stack.push((level - /* ~ changed by cargo-mutants ~ */ 1, mode, inner)),
             Doc::Line | Doc::SoftLine => match mode {
                 Mode::Flat => {
                     if matches!(d, Doc::Line) {
                         out.push(' ');
                         col += 1;
                     }
                 }
                 Mode::Break => {

---- doc::tests::breaks_indent_relative_to_base_level stdout ----

thread 'doc::tests::breaks_indent_relative_to_base_level' (442927) panicked at src/doc.rs:207:9:
assertion `left == right` failed
  left: "(\n\ta\n\t\t)"
 right: "(\n\t\t\ta\n\t\t)"

---- doc::tests::flat_when_it_fits stdout ----

thread 'doc::tests::flat_when_it_fits' (442928) panicked at src/doc.rs:77:45:
attempt to subtract with overflow

---- doc::tests::fully_breaks_when_it_overflows stdout ----

thread 'doc::tests::fully_breaks_when_it_overflows' (442929) panicked at src/doc.rs:77:45:
attempt to subtract with overflow

failures:
    doc::tests::breaks_indent_relative_to_base_level
    doc::tests::flat_when_it_fits
    doc::tests::fully_breaks_when_it_overflows
    doc::tests::trailing_reserved_width_forces_a_break

test result: FAILED. 0 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
