*** src/doc.rs:90:33: replace * with / in render

*** mutation diff:
--- src/doc.rs
+++ replace * with / in render
@@ -82,17 +82,17 @@
                         col += 1;
                     }
                 }
                 Mode::Break => {
                     out.push('\n');
                     for _ in 0..level {
                         out.push('\t');
                     }
-                    col = level * TAB_WIDTH;
+                    col = level / /* ~ changed by cargo-mutants ~ */ TAB_WIDTH;
                 }
             },
             Doc::Group(inner) => {
                 let mode = if fits(width.saturating_sub(col), inner, &stack) {
                     Mode::Flat
                 } else {
                     Mode::Break
                 };

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (444584) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(\n\t&(struct config){.alpha = 1111111111, .beta = 2222222222, .gamma = 3333333333, .delta = 4444444444}\n);\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

failures:
    compound_literal_arg_explodes_its_initializer_when_long

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
