*** src/lexer.rs:64:5: replace lex_block_comment with ()

*** mutation diff:
--- src/lexer.rs
+++ replace lex_block_comment with ()
@@ -56,18 +56,17 @@
 /// Extend a `//` match to just before the line's end (the newline stays its own token).
 fn lex_line_comment(lex: &mut Lexer<TokenKind>) {
     let rem = lex.remainder();
     lex.bump(rem.find(['\n', '\r']).unwrap_or(rem.len()));
 }
 
 /// Extend a `/*` match to the closing `*/`, or to end-of-input if unterminated.
 fn lex_block_comment(lex: &mut Lexer<TokenKind>) {
-    let rem = lex.remainder();
-    lex.bump(rem.find("*/").map_or(rem.len(), |i| i + 2));
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub struct Token<'src> {
     pub kind: TokenKind,
     pub text: &'src str,
 }

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (457204) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (457206) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 49 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
