*** src/lexer.rs:65:53: replace + with - in lex_block_comment

*** mutation diff:
--- src/lexer.rs
+++ replace + with - in lex_block_comment
@@ -57,17 +57,17 @@
 fn lex_line_comment(lex: &mut Lexer<TokenKind>) {
     let rem = lex.remainder();
     lex.bump(rem.find(['\n', '\r']).unwrap_or(rem.len()));
 }
 
 /// Extend a `/*` match to the closing `*/`, or to end-of-input if unterminated.
 fn lex_block_comment(lex: &mut Lexer<TokenKind>) {
     let rem = lex.remainder();
-    lex.bump(rem.find("*/").map_or(rem.len(), |i| i + 2));
+    lex.bump(rem.find("*/").map_or(rem.len(), |i| i - /* ~ changed by cargo-mutants ~ */ 2));
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub struct Token<'src> {
     pub kind: TokenKind,
     pub text: &'src str,
 }

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (806036) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (806034) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 51 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
