*** src/lexer.rs:65:53: replace + with * in lex_block_comment

*** mutation diff:
--- src/lexer.rs
+++ replace + with * in lex_block_comment
@@ -57,17 +57,17 @@
 fn lex_line_comment(lex: &mut Lexer<TokenKind>) {
     let rem = lex.remainder();
     lex.bump(rem.find(['\n', '\r']).unwrap_or(rem.len()));
 }
 
 /// Extend a `/*` match to the closing `*/`, or to end-of-input if unterminated.
 fn lex_block_comment(lex: &mut Lexer<TokenKind>) {
     let rem = lex.remainder();
-    lex.bump(rem.find("*/").map_or(rem.len(), |i| i + 2));
+    lex.bump(rem.find("*/").map_or(rem.len(), |i| i * /* ~ changed by cargo-mutants ~ */ 2));
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub struct Token<'src> {
     pub kind: TokenKind,
     pub text: &'src str,
 }

---- block_comment_internals_are_untouched stdout ----

thread 'block_comment_internals_are_untouched' (458352) panicked at /home/jp/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/logos-0.16.1/src/lexer.rs:196:9:
Invalid Lexer bump

---- initializer_with_comment_keeps_structure_but_retabs stdout ----

thread 'initializer_with_comment_keeps_structure_but_retabs' (458397) panicked at tests/conformance.rs:203:5:
assertion `left == right` failed
  left: "int v[] = {\n\t1, /* one */\n    2,\n};\n"
 right: "int v[] = {\n\t1, /* one */\n\t2,\n};\n"

---- passthrough_for_call_free_input stdout ----

thread 'passthrough_for_call_free_input' (458410) panicked at /home/jp/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/logos-0.16.1/src/lexer.rs:196:9:
Invalid Lexer bump

failures:
    block_comment_internals_are_untouched
    golden_acceptance_unguarded_showcase
    initializer_with_comment_keeps_structure_but_retabs
    passthrough_for_call_free_input

test result: FAILED. 47 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
