*** src/main.rs:107:49: replace && with || in main

*** mutation diff:
--- src/main.rs
+++ replace && with || in main
@@ -99,16 +99,16 @@
             return ExitCode::FAILURE;
         }
     };
     if args.mode == Mode::Version {
         println!("cfmt {}", env!("CARGO_PKG_VERSION"));
         return ExitCode::SUCCESS;
     }
     match run(&args) {
-        Ok(changed) if args.mode == Mode::Check && changed => ExitCode::FAILURE,
+        Ok(changed) if args.mode == Mode::Check || /* ~ changed by cargo-mutants ~ */ changed => ExitCode::FAILURE,
         Ok(_) => ExitCode::SUCCESS,
         Err(err) => {
             eprintln!("cfmt: {err}");
             ExitCode::FAILURE
         }
     }
 }

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (438221) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A({\"\";})\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:17.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")"
	successes: 0
	local rejects: 0
	global rejects: 0

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (438223) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A(\n\t{\n\t\t\"\";,\n\t}\n)\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:28.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")", width = 1
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
