*** src/main.rs:36:13: delete match arm "-V" | "--version" in parse_args

*** mutation diff:
--- src/main.rs
+++ delete match arm "-V" | "--version" in parse_args
@@ -28,17 +28,17 @@
     let mut mode = Mode::Stdout;
     let mut width = DEFAULT_WIDTH;
     let mut files = Vec::new();
     let mut rest = argv.iter();
     while let Some(arg) = rest.next() {
         match arg.as_str() {
             "-i" | "--in-place" => mode = Mode::InPlace,
             "--check" => mode = Mode::Check,
-            "-V" | "--version" => mode = Mode::Version,
+             /* ~ changed by cargo-mutants ~ */
             "-h" | "--help" => return Err(USAGE.to_owned()),
             "--width" => {
                 let value = rest.next().ok_or("--width requires a value")?;
                 width = value
                     .parse()
                     .map_err(|_| format!("invalid --width: {value}"))?;
             }
             flag if flag.starts_with("--width=") => {

*** result: Success
