*** src/main.rs:50:21: replace match guard flag.starts_with('-') && flag != "-" with false in parse_args

*** mutation diff:
--- src/main.rs
+++ replace match guard flag.starts_with('-') && flag != "-" with false in parse_args
@@ -42,17 +42,17 @@
                     .map_err(|_| format!("invalid --width: {value}"))?;
             }
             flag if flag.starts_with("--width=") => {
                 let value = &flag["--width=".len()..];
                 width = value
                     .parse()
                     .map_err(|_| format!("invalid --width: {value}"))?;
             }
-            flag if flag.starts_with('-') && flag != "-" => {
+            flag if false /* ~ changed by cargo-mutants ~ */ => {
                 return Err(format!("unknown flag: {flag}"));
             }
             _ => files.push(arg.clone()),
         }
     }
     if mode == Mode::InPlace && files.is_empty() {
         return Err("-i requires at least one FILE".to_owned());
     }

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (432429) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A({\"\";})\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:17.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")"
	successes: 0
	local rejects: 0
	global rejects: 0

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (432431) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A(\n\t{\n\t\t\"\";,\n\t}\n)\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:28.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")", width = 1
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
