*** src/main.rs:73:22: replace != with == in run

*** mutation diff:
--- src/main.rs
+++ replace != with == in run
@@ -65,17 +65,17 @@
     Ok(buf)
 }
 
 /// Returns `true` if any input differed from its formatted form.
 fn run(args: &Args) -> std::io::Result<bool> {
     if args.files.is_empty() {
         let src = read_stdin()?;
         let out = format_with_width(&src, args.width);
-        if args.mode != Mode::Check {
+        if args.mode == /* ~ changed by cargo-mutants ~ */ Mode::Check {
             std::io::stdout().write_all(out.as_bytes())?;
         }
         return Ok(out != src);
     }
     let mut any_changed = false;
     for path in &args.files {
         let src = std::fs::read_to_string(path)?;
         let out = format_with_width(&src, args.width);

*** result: Success
