*** src/reflow.rs:1000:13: replace < with <= in build_element_doc

*** mutation diff:
--- src/reflow.rs
+++ replace < with <= in build_element_doc
@@ -992,17 +992,17 @@
 
 /// Build one `{}` element: collapsed text, with any nested `{}` rendered as its own (tight) list so
 /// it collapses or explodes on its own.
 fn build_element_doc(toks: &[Token]) -> Doc {
     let mut parts: Vec<Doc> = Vec::new();
     let mut text = String::new();
     let mut pending_space = false;
     let mut j = 0usize;
-    while j < toks.len() {
+    while j <= /* ~ changed by cargo-mutants ~ */ toks.len() {
         let t = toks[j];
         if is_trivia(&t) {
             if !text.is_empty() || !parts.is_empty() {
                 pending_space = true;
             }
             j += 1;
         } else if t.kind == TokenKind::Punct
             && t.text == "{"

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (751005) panicked at src/reflow.rs:1001:17:
index out of bounds: the len is 1 but the index is 1

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (751007) panicked at src/reflow.rs:1001:17:
index out of bounds: the len is 1 but the index is 1

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (751010) panicked at src/reflow.rs:1001:17:
index out of bounds: the len is 3 but the index is 3

failures:
    blank_line_runs_collapse_to_one_everywhere
    brace_attaches_for_functions_and_control
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    control_headers_are_not_calls
    crlf_is_normalized_to_lf
    declaration_with_brace_explodes_and_keeps_brace_attached
    enum_body_is_padded_when_flat

test result: FAILED. 23 passed; 28 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
