*** src/reflow.rs:1003:33: replace || with && in build_element_doc

*** mutation diff:
--- src/reflow.rs
+++ replace || with && in build_element_doc
@@ -995,17 +995,17 @@
 fn build_element_doc(toks: &[Token]) -> Doc {
     let mut parts: Vec<Doc> = Vec::new();
     let mut text = String::new();
     let mut pending_space = false;
     let mut j = 0usize;
     while j < toks.len() {
         let t = toks[j];
         if is_trivia(&t) {
-            if !text.is_empty() || !parts.is_empty() {
+            if !text.is_empty() && /* ~ changed by cargo-mutants ~ */ !parts.is_empty() {
                 pending_space = true;
             }
             j += 1;
         } else if t.kind == TokenKind::Punct
             && t.text == "{"
             && let Some(close) = match_brace(toks, j)
         {
             if pending_space && !text.is_empty() {

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (751168) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(&(structconfig){.alpha=1111111111, .beta=2222222222, .gamma=3333333333, .delta=4444444444});\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literal_brace_stays_tight stdout ----

thread 'compound_literal_brace_stays_tight' (751169) panicked at tests/conformance.rs:282:5:
assertion `left == right` failed
  left: "p = &(struct shape){.x=1};\n"
 right: "p = &(struct shape){.x = 1};\n"

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (751170) panicked at tests/conformance.rs:403:5:
assertion `left == right` failed
  left: "p = &(struct shape){\n\t.tag=R,\n\t.rect={.w=3, .h=4},\n};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

failures:
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    declaration_with_brace_explodes_and_keeps_brace_attached
    enum_body_is_padded_when_flat
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    nested_paren_comma_is_not_a_split_point

test result: FAILED. 41 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
