*** src/reflow.rs:1003:36: delete ! in build_element_doc

*** mutation diff:
--- src/reflow.rs
+++ delete ! in build_element_doc
@@ -995,17 +995,17 @@
 fn build_element_doc(toks: &[Token]) -> Doc {
     let mut parts: Vec<Doc> = Vec::new();
     let mut text = String::new();
     let mut pending_space = false;
     let mut j = 0usize;
     while j < toks.len() {
         let t = toks[j];
         if is_trivia(&t) {
-            if !text.is_empty() || !parts.is_empty() {
+            if !text.is_empty() ||  /* ~ changed by cargo-mutants ~ */parts.is_empty() {
                 pending_space = true;
             }
             j += 1;
         } else if t.kind == TokenKind::Punct
             && t.text == "{"
             && let Some(close) = match_brace(toks, j)
         {
             if pending_space && !text.is_empty() {

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (752964) panicked at tests/conformance.rs:137:5:
assertion `left == right` failed
  left: "foo( a,  b);\n"
 right: "foo(a, b);\n"

---- collapses_initializer_without_trailing_comma stdout ----

thread 'collapses_initializer_without_trailing_comma' (752965) panicked at tests/conformance.rs:172:5:
assertion `left == right` failed
  left: "int v[] = { 1,  2,  3};\n"
 right: "int v[] = {1, 2, 3};\n"

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (752966) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t .beta = 2222222222,\n\t\t .gamma = 3333333333,\n\t\t .delta = 4444444444,\n\t}\n);\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

failures:
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    declaration_with_brace_explodes_and_keeps_brace_attached
    enum_body_is_padded_when_flat
    enum_magic_comma_explodes
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 31 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
