*** src/reflow.rs:1006:15: replace += with *= in build_element_doc

*** mutation diff:
--- src/reflow.rs
+++ replace += with *= in build_element_doc
@@ -998,17 +998,17 @@
     let mut pending_space = false;
     let mut j = 0usize;
     while j < toks.len() {
         let t = toks[j];
         if is_trivia(&t) {
             if !text.is_empty() || !parts.is_empty() {
                 pending_space = true;
             }
-            j += 1;
+            j *= /* ~ changed by cargo-mutants ~ */ 1;
         } else if t.kind == TokenKind::Punct
             && t.text == "{"
             && let Some(close) = match_brace(toks, j)
         {
             if pending_space && !text.is_empty() {
                 text.push(' ');
             }
             pending_space = false;

*** result: Timeout
