*** src/reflow.rs:1008:23: replace == with != in build_element_doc

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in build_element_doc
@@ -1000,17 +1000,17 @@
     while j < toks.len() {
         let t = toks[j];
         if is_trivia(&t) {
             if !text.is_empty() || !parts.is_empty() {
                 pending_space = true;
             }
             j += 1;
         } else if t.kind == TokenKind::Punct
-            && t.text == "{"
+            && t.text != /* ~ changed by cargo-mutants ~ */ "{"
             && let Some(close) = match_brace(toks, j)
         {
             if pending_space && !text.is_empty() {
                 text.push(' ');
             }
             pending_space = false;
             if !text.is_empty() {
                 parts.push(Doc::Text(std::mem::take(&mut text)));

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (1102456) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(\n\t&(struct config){.alpha = 1111111111, .beta = 2222222222, .gamma = 3333333333, .delta = 4444444444}\n);\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

failures:
    compound_literal_arg_explodes_its_initializer_when_long

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
