*** src/reflow.rs:1011:30: replace && with || in build_element_doc

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in build_element_doc
@@ -1003,17 +1003,17 @@
             if !text.is_empty() || !parts.is_empty() {
                 pending_space = true;
             }
             j += 1;
         } else if t.kind == TokenKind::Punct
             && t.text == "{"
             && let Some(close) = match_brace(toks, j)
         {
-            if pending_space && !text.is_empty() {
+            if pending_space || /* ~ changed by cargo-mutants ~ */ !text.is_empty() {
                 text.push(' ');
             }
             pending_space = false;
             if !text.is_empty() {
                 parts.push(Doc::Text(std::mem::take(&mut text)));
             }
             parts.push(build_brace_doc(&toks[j + 1..close], false));
             j = close + 1;

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (755173) panicked at tests/conformance.rs:291:5:
assertion `left == right` failed
  left: "configure(&(struct opts) {.mode = 1, .flags = 0}, count);\n"
 right: "configure(&(struct opts){.mode = 1, .flags = 0}, count);\n"

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (755170) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(\n\t&(struct config) {\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

failures:
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literals_in_function_args

test result: FAILED. 49 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
