*** src/reflow.rs:1011:33: delete ! in build_element_doc

*** mutation diff:
--- src/reflow.rs
+++ delete ! in build_element_doc
@@ -1003,17 +1003,17 @@
             if !text.is_empty() || !parts.is_empty() {
                 pending_space = true;
             }
             j += 1;
         } else if t.kind == TokenKind::Punct
             && t.text == "{"
             && let Some(close) = match_brace(toks, j)
         {
-            if pending_space && !text.is_empty() {
+            if pending_space &&  /* ~ changed by cargo-mutants ~ */text.is_empty() {
                 text.push(' ');
             }
             pending_space = false;
             if !text.is_empty() {
                 parts.push(Doc::Text(std::mem::take(&mut text)));
             }
             parts.push(build_brace_doc(&toks[j + 1..close], false));
             j = close + 1;

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (755113) panicked at tests/conformance.rs:403:5:
assertion `left == right` failed
  left: "p = &(struct shape){\n\t.tag = R,\n\t.rect ={.w = 3, .h = 4},\n};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (755129) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (755127) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    compound_literal_initializer_explodes
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 48 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
