*** src/reflow.rs:1015:16: delete ! in build_element_doc

*** mutation diff:
--- src/reflow.rs
+++ delete ! in build_element_doc
@@ -1007,17 +1007,17 @@
         } else if t.kind == TokenKind::Punct
             && t.text == "{"
             && let Some(close) = match_brace(toks, j)
         {
             if pending_space && !text.is_empty() {
                 text.push(' ');
             }
             pending_space = false;
-            if !text.is_empty() {
+            if  /* ~ changed by cargo-mutants ~ */text.is_empty() {
                 parts.push(Doc::Text(std::mem::take(&mut text)));
             }
             parts.push(build_brace_doc(&toks[j + 1..close], false));
             j = close + 1;
         } else {
             if pending_space {
                 text.push(' ');
                 pending_space = false;

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (756137) panicked at tests/conformance.rs:291:5:
assertion `left == right` failed
  left: "configure({.mode = 1, .flags = 0}&(struct opts), count);\n"
 right: "configure(&(struct opts){.mode = 1, .flags = 0}, count);\n"

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (756136) panicked at tests/conformance.rs:403:5:
assertion `left == right` failed
  left: "p = &(struct shape){\n\t.tag = R,\n\t{.w = 3, .h = 4}.rect = ,\n};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (756134) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(\n\t{\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}&(struct config)\n);\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

failures:
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    showcase_content_is_preserved

test result: FAILED. 44 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
