*** src/reflow.rs:1018:48: replace + with - in build_element_doc

*** mutation diff:
--- src/reflow.rs
+++ replace + with - in build_element_doc
@@ -1010,17 +1010,17 @@
         {
             if pending_space && !text.is_empty() {
                 text.push(' ');
             }
             pending_space = false;
             if !text.is_empty() {
                 parts.push(Doc::Text(std::mem::take(&mut text)));
             }
-            parts.push(build_brace_doc(&toks[j + 1..close], false));
+            parts.push(build_brace_doc(&toks[j - /* ~ changed by cargo-mutants ~ */ 1..close], false));
             j = close + 1;
         } else {
             if pending_space {
                 text.push(' ');
                 pending_space = false;
             }
             text.push_str(t.text);
             j += 1;

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (1104439) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(\n\t&(struct config){){.alpha = 1111111111, .beta = 2222222222, .gamma = 3333333333, .delta = 4444444444}\n);\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (1104441) panicked at tests/conformance.rs:418:5:
assertion `left == right` failed
  left: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {{.w = 3, .h = 4},\n};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (1104442) panicked at tests/conformance.rs:291:5:
assertion `left == right` failed
  left: "configure(&(struct opts){){.mode = 1, .flags = 0}, count);\n"
 right: "configure(&(struct opts){.mode = 1, .flags = 0}, count);\n"

failures:
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    nested_initializer_collapses_independently
    showcase_content_is_preserved

test result: FAILED. 45 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
