*** src/reflow.rs:1019:23: replace + with * in build_element_doc

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in build_element_doc
@@ -1011,17 +1011,17 @@
             if pending_space && !text.is_empty() {
                 text.push(' ');
             }
             pending_space = false;
             if !text.is_empty() {
                 parts.push(Doc::Text(std::mem::take(&mut text)));
             }
             parts.push(build_brace_doc(&toks[j + 1..close], false));
-            j = close + 1;
+            j = close * /* ~ changed by cargo-mutants ~ */ 1;
         } else {
             if pending_space {
                 text.push(' ');
                 pending_space = false;
             }
             text.push_str(t.text);
             j += 1;
         }

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (758574) panicked at tests/conformance.rs:403:5:
assertion `left == right` failed
  left: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4}},\n};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

---- nested_initializer_collapses_independently stdout ----

thread 'nested_initializer_collapses_independently' (758600) panicked at tests/conformance.rs:179:5:
assertion `left == right` failed
  left: "int m[2][3] = {\n\t{1, 2, 3}},\n\t{4, 5, 6}},\n};\n"
 right: "int m[2][3] = {\n\t{1, 2, 3},\n\t{4, 5, 6},\n};\n"

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (758575) panicked at tests/conformance.rs:291:5:
assertion `left == right` failed
  left: "configure(&(struct opts){.mode = 1, .flags = 0}}, count);\n"
 right: "configure(&(struct opts){.mode = 1, .flags = 0}, count);\n"

failures:
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    nested_initializer_collapses_independently
    showcase_content_is_preserved

test result: FAILED. 43 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
