*** src/reflow.rs:1026:15: replace += with *= in build_element_doc

*** mutation diff:
--- src/reflow.rs
+++ replace += with *= in build_element_doc
@@ -1018,17 +1018,17 @@
             parts.push(build_brace_doc(&toks[j + 1..close], false));
             j = close + 1;
         } else {
             if pending_space {
                 text.push(' ');
                 pending_space = false;
             }
             text.push_str(t.text);
-            j += 1;
+            j *= /* ~ changed by cargo-mutants ~ */ 1;
         }
     }
     if !text.is_empty() {
         parts.push(Doc::Text(text));
     }
     match parts.len() {
         0 => Doc::text(""),
         1 => parts.pop().unwrap(),

*** result: Timeout
