*** src/reflow.rs:1029:8: delete ! in build_element_doc

*** mutation diff:
--- src/reflow.rs
+++ delete ! in build_element_doc
@@ -1021,17 +1021,17 @@
             if pending_space {
                 text.push(' ');
                 pending_space = false;
             }
             text.push_str(t.text);
             j += 1;
         }
     }
-    if !text.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */text.is_empty() {
         parts.push(Doc::Text(text));
     }
     match parts.len() {
         0 => Doc::text(""),
         1 => parts.pop().unwrap(),
         _ => Doc::concat(parts),
     }
 }

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (760379) panicked at tests/conformance.rs:339:5:
assertion `left == right` failed
  left: "void f() {\n\tint a;\n\n\tint b;\n}\n"
 right: "void f(void) {\n\tint a;\n\n\tint b;\n}\n"

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (760381) panicked at tests/conformance.rs:275:5:
assertion `left == right` failed
  left: "void f() {}\n"
 right: "void f(void) {}\n"

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (760384) panicked at tests/conformance.rs:137:5:
assertion `left == right` failed
  left: "foo(, );\n"
 right: "foo(a, b);\n"

failures:
    blank_line_runs_collapse_to_one_everywhere
    brace_attaches_for_functions_and_control
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    control_headers_are_not_calls
    declaration_with_brace_explodes_and_keeps_brace_attached
    enum_body_is_padded_when_flat
    enum_magic_comma_explodes

test result: FAILED. 24 passed; 27 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
