*** src/reflow.rs:1045:31: replace - with / in build_clause_group

*** mutation diff:
--- src/reflow.rs
+++ replace - with / in build_clause_group
@@ -1037,17 +1037,17 @@
 }
 
 /// A parenthesized clause group: flat `(a sep b sep c)` or one element per line, with `sep`
 /// trailing each element but the last (`;` for a `for` header, ` &&`/` ||` for a condition).
 fn build_clause_group(segments: Vec<String>, sep: &str) -> Doc {
     if segments.is_empty() {
         return Doc::text("()");
     }
-    let last = segments.len() - 1;
+    let last = segments.len() / /* ~ changed by cargo-mutants ~ */ 1;
     let mut items = vec![Doc::SoftLine];
     for (idx, seg) in segments.into_iter().enumerate() {
         items.push(Doc::Text(seg));
         if idx < last {
             items.push(Doc::text(sep.to_owned()));
             items.push(Doc::Line);
         }
     }

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (762223) panicked at tests/conformance.rs:276:5:
assertion `left == right` failed
  left: "if (x ) {}\n"
 right: "if (x) {}\n"

---- control_headers_are_not_calls stdout ----

thread 'control_headers_are_not_calls' (762237) panicked at tests/conformance.rs:153:5:
assertion `left == right` failed
  left: "if (a && b && ) { return f(x); }\n"
 right: "if (a && b) { return f(x); }\n"

---- control_keyword_gets_one_space_before_paren stdout ----

thread 'control_keyword_gets_one_space_before_paren' (762238) panicked at tests/conformance.rs:226:5:
assertion `left == right` failed
  left: "if (x ) y;\n"
 right: "if (x) y;\n"

failures:
    brace_attaches_for_functions_and_control
    control_headers_are_not_calls
    control_keyword_gets_one_space_before_paren
    for_header_is_not_treated_as_a_call
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    long_for_header_explodes_one_clause_per_line
    long_if_condition_explodes_with_trailing_operators
    long_ternary_chain_explodes_flat_with_trailing_colons
    messy_real_world_input_is_idempotent_and_safe
    short_control_headers_unchanged

test result: FAILED. 37 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
