*** src/reflow.rs:1049:16: replace < with == in build_clause_group

*** mutation diff:
--- src/reflow.rs
+++ replace < with == in build_clause_group
@@ -1041,17 +1041,17 @@
 fn build_clause_group(segments: Vec<String>, sep: &str) -> Doc {
     if segments.is_empty() {
         return Doc::text("()");
     }
     let last = segments.len() - 1;
     let mut items = vec![Doc::SoftLine];
     for (idx, seg) in segments.into_iter().enumerate() {
         items.push(Doc::Text(seg));
-        if idx < last {
+        if idx == /* ~ changed by cargo-mutants ~ */ last {
             items.push(Doc::text(sep.to_owned()));
             items.push(Doc::Line);
         }
     }
     Doc::group(Doc::concat([
         Doc::text("("),
         Doc::nest(Doc::concat(items)),
         Doc::SoftLine,

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (762842) panicked at tests/conformance.rs:276:5:
assertion `left == right` failed
  left: "if (x ) {}\n"
 right: "if (x) {}\n"

---- control_headers_are_not_calls stdout ----

thread 'control_headers_are_not_calls' (762863) panicked at tests/conformance.rs:153:5:
assertion `left == right` failed
  left: "if (ab && ) { return f(x); }\n"
 right: "if (a && b) { return f(x); }\n"

---- control_keyword_gets_one_space_before_paren stdout ----

thread 'control_keyword_gets_one_space_before_paren' (762865) panicked at tests/conformance.rs:226:5:
assertion `left == right` failed
  left: "if (x ) y;\n"
 right: "if (x) y;\n"

failures:
    brace_attaches_for_functions_and_control
    control_headers_are_not_calls
    control_keyword_gets_one_space_before_paren
    for_header_is_not_treated_as_a_call
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    long_for_header_explodes_one_clause_per_line
    long_if_condition_explodes_with_trailing_operators
    long_ternary_chain_explodes_flat_with_trailing_colons
    messy_real_world_input_is_idempotent_and_safe
    short_control_headers_unchanged
    short_parenthesized_ternary_stays_flat

test result: FAILED. 38 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
