*** src/reflow.rs:1049:16: replace < with > in build_clause_group

*** mutation diff:
--- src/reflow.rs
+++ replace < with > in build_clause_group
@@ -1041,17 +1041,17 @@
 fn build_clause_group(segments: Vec<String>, sep: &str) -> Doc {
     if segments.is_empty() {
         return Doc::text("()");
     }
     let last = segments.len() - 1;
     let mut items = vec![Doc::SoftLine];
     for (idx, seg) in segments.into_iter().enumerate() {
         items.push(Doc::Text(seg));
-        if idx < last {
+        if idx > /* ~ changed by cargo-mutants ~ */ last {
             items.push(Doc::text(sep.to_owned()));
             items.push(Doc::Line);
         }
     }
     Doc::group(Doc::concat([
         Doc::text("("),
         Doc::nest(Doc::concat(items)),
         Doc::SoftLine,

---- control_headers_are_not_calls stdout ----

thread 'control_headers_are_not_calls' (763355) panicked at tests/conformance.rs:153:5:
assertion `left == right` failed
  left: "if (ab) { return f(x); }\n"
 right: "if (a && b) { return f(x); }\n"

---- for_header_is_not_treated_as_a_call stdout ----

thread 'for_header_is_not_treated_as_a_call' (763363) panicked at tests/conformance.rs:396:5:
assertion `left == right` failed
  left: "for (int i = 0, j = N - 1i < ji++, j--) {\n}\n"
 right: "for (int i = 0, j = N - 1; i < j; i++, j--) {\n}\n"

---- long_for_header_explodes_one_clause_per_line stdout ----

thread 'long_for_header_explodes_one_clause_per_line' (763374) panicked at tests/conformance.rs:382:5:
assertion `left == right` failed
  left: "for (\n\tsize_t current_sample_index = 0current_sample_index < total_number_of_samplescurrent_sample_index++\n) {\n}\n"
 right: "for (\n\tsize_t current_sample_index = 0;\n\tcurrent_sample_index < total_number_of_samples;\n\tcurrent_sample_index++\n) {\n}\n"

failures:
    control_headers_are_not_calls
    for_header_is_not_treated_as_a_call
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    long_for_header_explodes_one_clause_per_line
    long_if_condition_explodes_with_trailing_operators
    long_ternary_chain_explodes_flat_with_trailing_colons
    messy_real_world_input_is_idempotent_and_safe
    short_control_headers_unchanged
    short_parenthesized_ternary_stays_flat
    showcase_content_is_preserved

test result: FAILED. 40 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
