*** src/reflow.rs:1064:53: replace == with != in build_for_doc

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in build_for_doc
@@ -1056,17 +1056,17 @@
         Doc::nest(Doc::concat(items)),
         Doc::SoftLine,
         Doc::text(")"),
     ]))
 }
 
 /// `for (init; cond; step)` — one clause per line when broken (§2.4).
 fn build_for_doc(inner: &[Token]) -> Doc {
-    let clauses = split_top_level(inner, |t| t.kind == TokenKind::Punct && t.text == ";")
+    let clauses = split_top_level(inner, |t| t.kind != /* ~ changed by cargo-mutants ~ */ TokenKind::Punct && t.text == ";")
         .iter()
         .map(|c| render_segment(c))
         .collect();
     build_clause_group(clauses, ";")
 }
 
 /// An `if`/`while`/`switch` condition — split on the outermost `&&`/`||` with the operator
 /// trailing (§2.7); a condition with no such operator explodes as a single indented element.

---- long_for_header_explodes_one_clause_per_line stdout ----

thread 'long_for_header_explodes_one_clause_per_line' (764862) panicked at tests/conformance.rs:382:5:
assertion `left == right` failed
  left: "for (\n\tsize_t current_sample_index = 0; current_sample_index < total_number_of_samples; current_sample_index++\n) {\n}\n"
 right: "for (\n\tsize_t current_sample_index = 0;\n\tcurrent_sample_index < total_number_of_samples;\n\tcurrent_sample_index++\n) {\n}\n"

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (764852) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (764849) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    long_for_header_explodes_one_clause_per_line

test result: FAILED. 48 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
