*** src/reflow.rs:1064:83: replace == with != in build_for_doc

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in build_for_doc
@@ -1056,17 +1056,17 @@
         Doc::nest(Doc::concat(items)),
         Doc::SoftLine,
         Doc::text(")"),
     ]))
 }
 
 /// `for (init; cond; step)` — one clause per line when broken (§2.4).
 fn build_for_doc(inner: &[Token]) -> Doc {
-    let clauses = split_top_level(inner, |t| t.kind == TokenKind::Punct && t.text == ";")
+    let clauses = split_top_level(inner, |t| t.kind == TokenKind::Punct && t.text != /* ~ changed by cargo-mutants ~ */ ";")
         .iter()
         .map(|c| render_segment(c))
         .collect();
     build_clause_group(clauses, ";")
 }
 
 /// An `if`/`while`/`switch` condition — split on the outermost `&&`/`||` with the operator
 /// trailing (§2.7); a condition with no such operator explodes as a single indented element.

---- for_header_is_not_treated_as_a_call stdout ----

thread 'for_header_is_not_treated_as_a_call' (765178) panicked at tests/conformance.rs:396:5:
assertion `left == right` failed
  left: "for (int i; 0; j; N; 1; i; j; i++; j--) {\n}\n"
 right: "for (int i = 0, j = N - 1; i < j; i++, j--) {\n}\n"

---- long_for_header_explodes_one_clause_per_line stdout ----

thread 'long_for_header_explodes_one_clause_per_line' (765191) panicked at tests/conformance.rs:382:5:
assertion `left == right` failed
  left: "for (\n\tsize_t current_sample_index;\n\t0; current_sample_index;\n\ttotal_number_of_samples; current_sample_index++\n) {\n}\n"
 right: "for (\n\tsize_t current_sample_index = 0;\n\tcurrent_sample_index < total_number_of_samples;\n\tcurrent_sample_index++\n) {\n}\n"

---- messy_real_world_input_is_idempotent_and_safe stdout ----

thread 'messy_real_world_input_is_idempotent_and_safe' (765195) panicked at tests/conformance.rs:70:5:
assertion `left == right` failed: must be idempotent on messy input

failures:
    for_header_is_not_treated_as_a_call
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    long_for_header_explodes_one_clause_per_line
    messy_real_world_input_is_idempotent_and_safe
    short_control_headers_unchanged
    showcase_content_is_preserved

test result: FAILED. 43 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
