*** src/reflow.rs:1077:51: replace == with != in build_cond_doc

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in build_cond_doc
@@ -1069,17 +1069,17 @@
 }
 
 /// An `if`/`while`/`switch` condition — split on the outermost `&&`/`||` with the operator
 /// trailing (§2.7); a condition with no such operator explodes as a single indented element.
 fn build_cond_doc(inner: &[Token]) -> Doc {
     match top_level_logical_op(inner) {
         Some(op) => {
             let operands =
-                split_top_level(inner, |t| t.kind == TokenKind::Operator && t.text == op)
+                split_top_level(inner, |t| t.kind != /* ~ changed by cargo-mutants ~ */ TokenKind::Operator && t.text == op)
                     .iter()
                     .map(|o| render_segment(o))
                     .collect();
             build_clause_group(operands, &format!(" {op}"))
         }
         None => build_clause_group(vec![render_segment(inner)], ""),
     }
 }

---- long_if_condition_explodes_with_trailing_operators stdout ----

thread 'long_if_condition_explodes_with_trailing_operators' (766755) panicked at tests/conformance.rs:389:5:
assertion `left == right` failed
  left: "if (\n\taveraged_result > MINIMUM_ACCEPTABLE_THRESHOLD && averaged_result < MAXIMUM_ACCEPTABLE_THRESHOLD && averaged_result != 0\n) {\n}\n"
 right: "if (\n\taveraged_result > MINIMUM_ACCEPTABLE_THRESHOLD &&\n\taveraged_result < MAXIMUM_ACCEPTABLE_THRESHOLD &&\n\taveraged_result != 0\n) {\n}\n"

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (766749) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (766747) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    long_if_condition_explodes_with_trailing_operators

test result: FAILED. 48 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
