*** src/reflow.rs:1077:74: replace && with || in build_cond_doc

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in build_cond_doc
@@ -1069,17 +1069,17 @@
 }
 
 /// An `if`/`while`/`switch` condition — split on the outermost `&&`/`||` with the operator
 /// trailing (§2.7); a condition with no such operator explodes as a single indented element.
 fn build_cond_doc(inner: &[Token]) -> Doc {
     match top_level_logical_op(inner) {
         Some(op) => {
             let operands =
-                split_top_level(inner, |t| t.kind == TokenKind::Operator && t.text == op)
+                split_top_level(inner, |t| t.kind == TokenKind::Operator || /* ~ changed by cargo-mutants ~ */ t.text == op)
                     .iter()
                     .map(|o| render_segment(o))
                     .collect();
             build_clause_group(operands, &format!(" {op}"))
         }
         None => build_clause_group(vec![render_segment(inner)], ""),
     }
 }

---- long_if_condition_explodes_with_trailing_operators stdout ----

thread 'long_if_condition_explodes_with_trailing_operators' (766613) panicked at tests/conformance.rs:389:5:
assertion `left == right` failed
  left: "if (\n\taveraged_result > MINIMUM_ACCEPTABLE_THRESHOLD &&\n\taveraged_result < MAXIMUM_ACCEPTABLE_THRESHOLD &&\n\taveraged_result &&\n\t0\n) {\n}\n"
 right: "if (\n\taveraged_result > MINIMUM_ACCEPTABLE_THRESHOLD &&\n\taveraged_result < MAXIMUM_ACCEPTABLE_THRESHOLD &&\n\taveraged_result != 0\n) {\n}\n"

---- messy_real_world_input_is_idempotent_and_safe stdout ----

thread 'messy_real_world_input_is_idempotent_and_safe' (766616) panicked at tests/conformance.rs:71:5:
assertion `left == right` failed: must not change any token on messy input

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (766607) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    long_if_condition_explodes_with_trailing_operators
    messy_real_world_input_is_idempotent_and_safe
    showcase_content_is_preserved

test result: FAILED. 46 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
