*** src/reflow.rs:1093:5: replace trailing_reserved -> usize with 0

*** mutation diff:
--- src/reflow.rs
+++ replace trailing_reserved -> usize with 0
@@ -1085,29 +1085,17 @@
 }
 
 /// Columns consumed by structural tokens trailing the construct on its line (e.g. `;` or ` {`), so
 /// the group leaves room for them. Counting stops after the first bracket-opener, because anything
 /// past it can itself break onto later lines — making the measure stable across passes (a chained
 /// `f(x)->g(...)` reserves only `->g(`, not `g`'s arguments), which keeps formatting idempotent.
 /// Comments are ignored so a trailing comment never forces a break.
 fn trailing_reserved(toks: &[Token], from: usize) -> usize {
-    let mut w = 0;
-    for t in toks.iter().skip(from) {
-        match t.kind {
-            TokenKind::Newline => break,
-            TokenKind::LineComment | TokenKind::BlockComment => {}
-            TokenKind::Punct if matches!(t.text, "(" | "[" | "{") => {
-                w += col_width(t.text);
-                break;
-            }
-            _ => w += col_width(t.text),
-        }
-    }
-    w
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Column width of raw token text, counting a tab as [`TAB_WIDTH`] (unlike [`display_width`], which
 /// assumes tab-free text). Used where the measured slice may contain a mid-line whitespace tab, so
 /// the reserve matches the cursor's own tab accounting and formatting stays idempotent.
 fn col_width(s: &str) -> usize {
     s.chars()
         .map(|c| if c == '\t' { TAB_WIDTH } else { 1 })

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (767764) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (767762) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 49 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
