*** src/reflow.rs:1096:13: delete match arm TokenKind::Newline in trailing_reserved

*** mutation diff:
--- src/reflow.rs
+++ delete match arm TokenKind::Newline in trailing_reserved
@@ -1088,17 +1088,17 @@
 /// the group leaves room for them. Counting stops after the first bracket-opener, because anything
 /// past it can itself break onto later lines — making the measure stable across passes (a chained
 /// `f(x)->g(...)` reserves only `->g(`, not `g`'s arguments), which keeps formatting idempotent.
 /// Comments are ignored so a trailing comment never forces a break.
 fn trailing_reserved(toks: &[Token], from: usize) -> usize {
     let mut w = 0;
     for t in toks.iter().skip(from) {
         match t.kind {
-            TokenKind::Newline => break,
+             /* ~ changed by cargo-mutants ~ */
             TokenKind::LineComment | TokenKind::BlockComment => {}
             TokenKind::Punct if matches!(t.text, "(" | "[" | "{") => {
                 w += col_width(t.text);
                 break;
             }
             _ => w += col_width(t.text),
         }
     }

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (768525) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (768527) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 49 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
