*** src/reflow.rs:1097:13: delete match arm TokenKind::LineComment | TokenKind::BlockComment in trailing_reserved

*** mutation diff:
--- src/reflow.rs
+++ delete match arm TokenKind::LineComment | TokenKind::BlockComment in trailing_reserved
@@ -1089,17 +1089,17 @@
 /// past it can itself break onto later lines — making the measure stable across passes (a chained
 /// `f(x)->g(...)` reserves only `->g(`, not `g`'s arguments), which keeps formatting idempotent.
 /// Comments are ignored so a trailing comment never forces a break.
 fn trailing_reserved(toks: &[Token], from: usize) -> usize {
     let mut w = 0;
     for t in toks.iter().skip(from) {
         match t.kind {
             TokenKind::Newline => break,
-            TokenKind::LineComment | TokenKind::BlockComment => {}
+             /* ~ changed by cargo-mutants ~ */
             TokenKind::Punct if matches!(t.text, "(" | "[" | "{") => {
                 w += col_width(t.text);
                 break;
             }
             _ => w += col_width(t.text),
         }
     }
     w

*** result: Success
