*** src/reflow.rs:1098:33: replace match guard matches!(t.text, "(" | "[" | "{") with true in trailing_reserved

*** mutation diff:
--- src/reflow.rs
+++ replace match guard matches!(t.text, "(" | "[" | "{") with true in trailing_reserved
@@ -1090,17 +1090,17 @@
 /// `f(x)->g(...)` reserves only `->g(`, not `g`'s arguments), which keeps formatting idempotent.
 /// Comments are ignored so a trailing comment never forces a break.
 fn trailing_reserved(toks: &[Token], from: usize) -> usize {
     let mut w = 0;
     for t in toks.iter().skip(from) {
         match t.kind {
             TokenKind::Newline => break,
             TokenKind::LineComment | TokenKind::BlockComment => {}
-            TokenKind::Punct if matches!(t.text, "(" | "[" | "{") => {
+            TokenKind::Punct if true /* ~ changed by cargo-mutants ~ */ => {
                 w += col_width(t.text);
                 break;
             }
             _ => w += col_width(t.text),
         }
     }
     w
 }

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (769771) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A({\"\";})\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:17.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")"
	successes: 0
	local rejects: 0
	global rejects: 0

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (769773) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A(\n\t{\n\t\t\"\";,\n\t}\n)\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:28.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")", width = 1
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
