*** src/reflow.rs:1098:33: replace match guard matches!(t.text, "(" | "[" | "{") with false in trailing_reserved

*** mutation diff:
--- src/reflow.rs
+++ replace match guard matches!(t.text, "(" | "[" | "{") with false in trailing_reserved
@@ -1090,17 +1090,17 @@
 /// `f(x)->g(...)` reserves only `->g(`, not `g`'s arguments), which keeps formatting idempotent.
 /// Comments are ignored so a trailing comment never forces a break.
 fn trailing_reserved(toks: &[Token], from: usize) -> usize {
     let mut w = 0;
     for t in toks.iter().skip(from) {
         match t.kind {
             TokenKind::Newline => break,
             TokenKind::LineComment | TokenKind::BlockComment => {}
-            TokenKind::Punct if matches!(t.text, "(" | "[" | "{") => {
+            TokenKind::Punct if false /* ~ changed by cargo-mutants ~ */ => {
                 w += col_width(t.text);
                 break;
             }
             _ => w += col_width(t.text),
         }
     }
     w
 }

*** result: Success
