*** src/reflow.rs:1099:19: replace += with *= in trailing_reserved

*** mutation diff:
--- src/reflow.rs
+++ replace += with *= in trailing_reserved
@@ -1091,17 +1091,17 @@
 /// Comments are ignored so a trailing comment never forces a break.
 fn trailing_reserved(toks: &[Token], from: usize) -> usize {
     let mut w = 0;
     for t in toks.iter().skip(from) {
         match t.kind {
             TokenKind::Newline => break,
             TokenKind::LineComment | TokenKind::BlockComment => {}
             TokenKind::Punct if matches!(t.text, "(" | "[" | "{") => {
-                w += col_width(t.text);
+                w *= /* ~ changed by cargo-mutants ~ */ col_width(t.text);
                 break;
             }
             _ => w += col_width(t.text),
         }
     }
     w
 }

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (771408) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (771406) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 49 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
