*** src/reflow.rs:1102:20: replace += with -= in trailing_reserved

*** mutation diff:
--- src/reflow.rs
+++ replace += with -= in trailing_reserved
@@ -1094,17 +1094,17 @@
     for t in toks.iter().skip(from) {
         match t.kind {
             TokenKind::Newline => break,
             TokenKind::LineComment | TokenKind::BlockComment => {}
             TokenKind::Punct if matches!(t.text, "(" | "[" | "{") => {
                 w += col_width(t.text);
                 break;
             }
-            _ => w += col_width(t.text),
+            _ => w -= /* ~ changed by cargo-mutants ~ */ col_width(t.text),
         }
     }
     w
 }
 
 /// Column width of raw token text, counting a tab as [`TAB_WIDTH`] (unlike [`display_width`], which
 /// assumes tab-free text). Used where the measured slice may contain a mid-line whitespace tab, so
 /// the reserve matches the cursor's own tab accounting and formatting stays idempotent.

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (771476) panicked at src/reflow.rs:1102:18:
attempt to subtract with overflow

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (771478) panicked at src/reflow.rs:1102:18:
attempt to subtract with overflow

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (771481) panicked at src/reflow.rs:1102:18:
attempt to subtract with overflow

failures:
    blank_line_runs_collapse_to_one_everywhere
    brace_attaches_for_functions_and_control
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    control_headers_are_not_calls
    control_keyword_gets_one_space_before_paren
    crlf_is_normalized_to_lf
    declaration_with_brace_explodes_and_keeps_brace_attached

test result: FAILED. 18 passed; 33 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
