*** src/reflow.rs:1102:20: replace += with *= in trailing_reserved

*** mutation diff:
--- src/reflow.rs
+++ replace += with *= in trailing_reserved
@@ -1094,17 +1094,17 @@
     for t in toks.iter().skip(from) {
         match t.kind {
             TokenKind::Newline => break,
             TokenKind::LineComment | TokenKind::BlockComment => {}
             TokenKind::Punct if matches!(t.text, "(" | "[" | "{") => {
                 w += col_width(t.text);
                 break;
             }
-            _ => w += col_width(t.text),
+            _ => w *= /* ~ changed by cargo-mutants ~ */ col_width(t.text),
         }
     }
     w
 }
 
 /// Column width of raw token text, counting a tab as [`TAB_WIDTH`] (unlike [`display_width`], which
 /// assumes tab-free text). Used where the measured slice may contain a mid-line whitespace tab, so
 /// the reserve matches the cursor's own tab accounting and formatting stays idempotent.

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (772153) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (772155) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 49 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
