*** src/reflow.rs:1112:5: replace col_width -> usize with 0

*** mutation diff:
--- src/reflow.rs
+++ replace col_width -> usize with 0
@@ -1104,19 +1104,17 @@
     }
     w
 }
 
 /// Column width of raw token text, counting a tab as [`TAB_WIDTH`] (unlike [`display_width`], which
 /// assumes tab-free text). Used where the measured slice may contain a mid-line whitespace tab, so
 /// the reserve matches the cursor's own tab accounting and formatting stays idempotent.
 fn col_width(s: &str) -> usize {
-    s.chars()
-        .map(|c| if c == '\t' { TAB_WIDTH } else { 1 })
-        .sum()
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Emit a preprocessor directive verbatim, following `\` line continuations; returns the index
 /// just past it.
 fn emit_directive(toks: &[Token], start: usize, out: &mut String, col: &mut usize) -> usize {
     let end = directive_end(toks, start);
     for tok in &toks[start..end] {
         emit_str(out, col, tok.text);

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (773437) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (773435) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 49 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
