*** src/reflow.rs:1112:5: replace col_width -> usize with 1

*** mutation diff:
--- src/reflow.rs
+++ replace col_width -> usize with 1
@@ -1104,19 +1104,17 @@
     }
     w
 }
 
 /// Column width of raw token text, counting a tab as [`TAB_WIDTH`] (unlike [`display_width`], which
 /// assumes tab-free text). Used where the measured slice may contain a mid-line whitespace tab, so
 /// the reserve matches the cursor's own tab accounting and formatting stays idempotent.
 fn col_width(s: &str) -> usize {
-    s.chars()
-        .map(|c| if c == '\t' { TAB_WIDTH } else { 1 })
-        .sum()
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Emit a preprocessor directive verbatim, following `\` line continuations; returns the index
 /// just past it.
 fn emit_directive(toks: &[Token], start: usize, out: &mut String, col: &mut usize) -> usize {
     let end = directive_end(toks, start);
     for tok in &toks[start..end] {
         emit_str(out, col, tok.text);

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (773504) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A({\"\";})\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:17.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")"
	successes: 0
	local rejects: 0
	global rejects: 0

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (773508) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A(\n\t{\n\t\t\"\";,\n\t}\n)\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:28.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")", width = 1
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
