*** src/reflow.rs:1113:23: replace == with != in col_width

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in col_width
@@ -1105,17 +1105,17 @@
     w
 }
 
 /// Column width of raw token text, counting a tab as [`TAB_WIDTH`] (unlike [`display_width`], which
 /// assumes tab-free text). Used where the measured slice may contain a mid-line whitespace tab, so
 /// the reserve matches the cursor's own tab accounting and formatting stays idempotent.
 fn col_width(s: &str) -> usize {
     s.chars()
-        .map(|c| if c == '\t' { TAB_WIDTH } else { 1 })
+        .map(|c| if c != /* ~ changed by cargo-mutants ~ */ '\t' { TAB_WIDTH } else { 1 })
         .sum()
 }
 
 /// Emit a preprocessor directive verbatim, following `\` line continuations; returns the index
 /// just past it.
 fn emit_directive(toks: &[Token], start: usize, out: &mut String, col: &mut usize) -> usize {
     let end = directive_end(toks, start);
     for tok in &toks[start..end] {

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (773496) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (773498) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 49 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
