*** src/reflow.rs:1120:5: replace emit_directive -> usize with 0

*** mutation diff:
--- src/reflow.rs
+++ replace emit_directive -> usize with 0
@@ -1112,14 +1112,10 @@
     s.chars()
         .map(|c| if c == '\t' { TAB_WIDTH } else { 1 })
         .sum()
 }
 
 /// Emit a preprocessor directive verbatim, following `\` line continuations; returns the index
 /// just past it.
 fn emit_directive(toks: &[Token], start: usize, out: &mut String, col: &mut usize) -> usize {
-    let end = directive_end(toks, start);
-    for tok in &toks[start..end] {
-        emit_str(out, col, tok.text);
-    }
-    end
+    0 /* ~ changed by cargo-mutants ~ */
 }

*** result: Timeout
