*** src/reflow.rs:112:5: replace same_line -> bool with false

*** mutation diff:
--- src/reflow.rs
+++ replace same_line -> bool with false
@@ -104,17 +104,17 @@
             | "restrict"
     )
 }
 
 /// A significant token paired with the whitespace that preceded it.
 type Piece<'src> = (String, Token<'src>);
 
 fn same_line(gap: &str) -> bool {
-    !gap.contains('\n')
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Index of the `(` matching the `)` at `close`, scanning the piece list backward.
 fn piece_open_paren(pieces: &[Piece], close: usize) -> Option<usize> {
     let mut depth = 0i32;
     for j in (0..=close).rev() {
         match pieces[j].1.text {
             ")" => depth += 1,

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (466740) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: "struct s {\n\tint x:2;\n};\n"
 right: "struct s {\n\tint x: 2;\n};\n"

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (466743) panicked at tests/conformance.rs:275:5:
assertion `left == right` failed
  left: "void f(void){}\n"
 right: "void f(void) {}\n"

---- casts_get_a_trailing_space stdout ----

thread 'casts_get_a_trailing_space' (466745) panicked at tests/conformance.rs:261:5:
assertion `left == right` failed
  left: "x = (int)y;\n"
 right: "x = (int) y;\n"

failures:
    bit_field_colon_spacing
    brace_attaches_for_functions_and_control
    casts_get_a_trailing_space
    pointers_are_middle_spaced_after_type_keywords
    struct_tag_pointer_is_middle_spaced

test result: FAILED. 46 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
