*** src/reflow.rs:120:13: delete match arm ")" in piece_open_paren

*** mutation diff:
--- src/reflow.rs
+++ delete match arm ")" in piece_open_paren
@@ -112,17 +112,17 @@
     !gap.contains('\n')
 }
 
 /// Index of the `(` matching the `)` at `close`, scanning the piece list backward.
 fn piece_open_paren(pieces: &[Piece], close: usize) -> Option<usize> {
     let mut depth = 0i32;
     for j in (0..=close).rev() {
         match pieces[j].1.text {
-            ")" => depth += 1,
+             /* ~ changed by cargo-mutants ~ */
             "(" => {
                 depth -= 1;
                 if depth == 0 {
                     return Some(j);
                 }
             }
             _ => {}
         }

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (817368) panicked at tests/conformance.rs:275:5:
assertion `left == right` failed
  left: "void f(void){}\n"
 right: "void f(void) {}\n"

failures:
    brace_attaches_for_functions_and_control

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
