*** src/reflow.rs:123:26: replace == with != in piece_open_paren

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in piece_open_paren
@@ -115,17 +115,17 @@
 /// Index of the `(` matching the `)` at `close`, scanning the piece list backward.
 fn piece_open_paren(pieces: &[Piece], close: usize) -> Option<usize> {
     let mut depth = 0i32;
     for j in (0..=close).rev() {
         match pieces[j].1.text {
             ")" => depth += 1,
             "(" => {
                 depth -= 1;
-                if depth == 0 {
+                if depth != /* ~ changed by cargo-mutants ~ */ 0 {
                     return Some(j);
                 }
             }
             _ => {}
         }
     }
     None
 }

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (472474) panicked at tests/conformance.rs:275:5:
assertion `left == right` failed
  left: "void f(void){}\n"
 right: "void f(void) {}\n"

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (472479) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(\n\t&(struct config) {\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (472482) panicked at tests/conformance.rs:291:5:
assertion `left == right` failed
  left: "configure(&(struct opts) {.mode = 1, .flags = 0}, count);\n"
 right: "configure(&(struct opts){.mode = 1, .flags = 0}, count);\n"

failures:
    brace_attaches_for_functions_and_control
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literals_in_function_args

test result: FAILED. 48 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
