*** src/reflow.rs:135:5: replace piece_close_paren -> Option<usize> with Some(0)

*** mutation diff:
--- src/reflow.rs
+++ replace piece_close_paren -> Option<usize> with Some(0)
@@ -127,30 +127,17 @@
             _ => {}
         }
     }
     None
 }
 
 /// Index of the `)` matching the `(` at `open`, scanning forward.
 fn piece_close_paren(pieces: &[Piece], open: usize) -> Option<usize> {
-    let mut depth = 0i32;
-    for (j, p) in pieces.iter().enumerate().skip(open) {
-        match p.1.text {
-            "(" => depth += 1,
-            ")" => {
-                depth -= 1;
-                if depth == 0 {
-                    return Some(j);
-                }
-            }
-            _ => {}
-        }
-    }
-    None
+    Some(0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Apply the §2.5 token-spacing rules. Whitespace is semantically inert, so this never changes
 /// meaning; only the listed pairs are touched and everything else keeps its exact spacing.
 fn space_tokens(s: &str) -> String {
     let mut pieces: Vec<Piece> = Vec::new();
     let mut gap = String::new();
     for t in tokenize(s) {

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (472901) panicked at src/reflow.rs:221:28:
slice index starts at 3 but ends at 0

---- call_with_line_comment_passes_through stdout ----

thread 'call_with_line_comment_passes_through' (472908) panicked at src/reflow.rs:221:28:
slice index starts at 2 but ends at 0

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (472907) panicked at src/reflow.rs:221:28:
slice index starts at 3 but ends at 0

failures:
    blank_line_runs_collapse_to_one_everywhere
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    control_headers_are_not_calls
    control_keyword_gets_one_space_before_paren
    crlf_is_normalized_to_lf

test result: FAILED. 14 passed; 37 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
