*** src/reflow.rs:138:26: replace += with -= in piece_close_paren

*** mutation diff:
--- src/reflow.rs
+++ replace += with -= in piece_close_paren
@@ -130,17 +130,17 @@
     None
 }
 
 /// Index of the `)` matching the `(` at `open`, scanning forward.
 fn piece_close_paren(pieces: &[Piece], open: usize) -> Option<usize> {
     let mut depth = 0i32;
     for (j, p) in pieces.iter().enumerate().skip(open) {
         match p.1.text {
-            "(" => depth += 1,
+            "(" => depth -= /* ~ changed by cargo-mutants ~ */ 1,
             ")" => {
                 depth -= 1;
                 if depth == 0 {
                     return Some(j);
                 }
             }
             _ => {}
         }

---- casts_get_a_trailing_space stdout ----

thread 'casts_get_a_trailing_space' (475566) panicked at tests/conformance.rs:261:5:
assertion `left == right` failed
  left: "x = (int)y;\n"
 right: "x = (int) y;\n"

failures:
    casts_get_a_trailing_space

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
