*** src/reflow.rs:139:13: delete match arm ")" in piece_close_paren

*** mutation diff:
--- src/reflow.rs
+++ delete match arm ")" in piece_close_paren
@@ -131,22 +131,17 @@
 }
 
 /// Index of the `)` matching the `(` at `open`, scanning forward.
 fn piece_close_paren(pieces: &[Piece], open: usize) -> Option<usize> {
     let mut depth = 0i32;
     for (j, p) in pieces.iter().enumerate().skip(open) {
         match p.1.text {
             "(" => depth += 1,
-            ")" => {
-                depth -= 1;
-                if depth == 0 {
-                    return Some(j);
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => {}
         }
     }
     None
 }
 
 /// Apply the §2.5 token-spacing rules. Whitespace is semantically inert, so this never changes
 /// meaning; only the listed pairs are touched and everything else keeps its exact spacing.

---- casts_get_a_trailing_space stdout ----

thread 'casts_get_a_trailing_space' (823890) panicked at tests/conformance.rs:261:5:
assertion `left == right` failed
  left: "x = (int)y;\n"
 right: "x = (int) y;\n"

failures:
    casts_get_a_trailing_space

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
