*** src/reflow.rs:154:5: replace space_tokens -> String with "xyzzy".into()

*** mutation diff:
--- src/reflow.rs
+++ replace space_tokens -> String with "xyzzy".into()
@@ -146,39 +146,17 @@
         }
     }
     None
 }
 
 /// Apply the §2.5 token-spacing rules. Whitespace is semantically inert, so this never changes
 /// meaning; only the listed pairs are touched and everything else keeps its exact spacing.
 fn space_tokens(s: &str) -> String {
-    let mut pieces: Vec<Piece> = Vec::new();
-    let mut gap = String::new();
-    for t in tokenize(s) {
-        if is_trivia(&t) {
-            gap.push_str(t.text);
-        } else {
-            pieces.push((std::mem::take(&mut gap), t));
-        }
-    }
-    let trailing = gap;
-
-    space_pointers(&mut pieces);
-    space_casts(&mut pieces);
-    space_braces(&mut pieces);
-    space_bit_fields(&mut pieces);
-
-    let mut out = String::with_capacity(s.len());
-    for (g, t) in &pieces {
-        out.push_str(g);
-        out.push_str(t.text);
-    }
-    out.push_str(&trailing);
-    out
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Middle-align pointer `*` (§2.5: `T * p`, `T ** p`). A `*` cluster is a pointer only when
 /// preceded by a type keyword/qualifier or a `struct`/`union`/`enum` tag; multiply, deref,
 /// function pointers `(*f)`, and bare-typedef pointers are left as is (§6).
 fn space_pointers(pieces: &mut [Piece]) {
     let is_star = |t: &Token| t.kind == TokenKind::Punct && t.text == "*";
     let mut j = 0;

---- ambiguous_star_is_left_alone stdout ----

thread 'ambiguous_star_is_left_alone' (826983) panicked at tests/conformance.rs:242:5:
assertion `left == right` failed
  left: "xyzzy\n"
 right: "z = a*b;\n"

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (826984) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: "xyzzy\n"
 right: "struct s {\n\tint x: 2;\n};\n"

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (826985) panicked at tests/conformance.rs:337:5:
assertion `left == right` failed
  left: "xyzzy\n"
 right: "int a;\n\nint b;\n"

failures:
    ambiguous_star_is_left_alone
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    block_comment_internals_are_untouched
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes

test result: FAILED. 2 passed; 51 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
