*** src/reflow.rs:183:38: replace == with != in space_pointers

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in space_pointers
@@ -175,17 +175,17 @@
     out.push_str(&trailing);
     out
 }
 
 /// Middle-align pointer `*` (§2.5: `T * p`, `T ** p`). A `*` cluster is a pointer only when
 /// preceded by a type keyword/qualifier or a `struct`/`union`/`enum` tag; multiply, deref,
 /// function pointers `(*f)`, and bare-typedef pointers are left as is (§6).
 fn space_pointers(pieces: &mut [Piece]) {
-    let is_star = |t: &Token| t.kind == TokenKind::Punct && t.text == "*";
+    let is_star = |t: &Token| t.kind != /* ~ changed by cargo-mutants ~ */ TokenKind::Punct && t.text == "*";
     let mut j = 0;
     while j < pieces.len() {
         let prev_is_type = j > 0
             && (is_type_context(pieces[j - 1].1.text)
                 || (pieces[j - 1].1.kind == TokenKind::Ident
                     && j >= 2
                     && matches!(pieces[j - 2].1.text, "struct" | "union" | "enum")));
         if is_star(&pieces[j].1) && prev_is_type && same_line(&pieces[j].0) {

---- pointers_are_middle_spaced_after_type_keywords stdout ----

thread 'pointers_are_middle_spaced_after_type_keywords' (829071) panicked at tests/conformance.rs:233:5:
assertion `left == right` failed
  left: "int*p;\n"
 right: "int * p;\n"

---- struct_tag_pointer_is_middle_spaced stdout ----

thread 'struct_tag_pointer_is_middle_spaced' (829080) panicked at tests/conformance.rs:255:5:
assertion `left == right` failed
  left: "struct shape*s;\n"
 right: "struct shape * s;\n"

failures:
    pointers_are_middle_spaced_after_type_keywords
    struct_tag_pointer_is_middle_spaced

test result: FAILED. 51 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
