*** src/reflow.rs:183:5: replace space_pointers with ()

*** mutation diff:
--- src/reflow.rs
+++ replace space_pointers with ()
@@ -175,47 +175,17 @@
     out.push_str(&trailing);
     out
 }
 
 /// Middle-align pointer `*` (§2.5: `T * p`, `T ** p`). A `*` cluster is a pointer only when
 /// preceded by a type keyword/qualifier or a `struct`/`union`/`enum` tag; multiply, deref,
 /// function pointers `(*f)`, and bare-typedef pointers are left as is (§6).
 fn space_pointers(pieces: &mut [Piece]) {
-    let is_star = |t: &Token| t.kind == TokenKind::Punct && t.text == "*";
-    let mut j = 0;
-    while j < pieces.len() {
-        let prev_is_type = j > 0
-            && (is_type_context(pieces[j - 1].1.text)
-                || (pieces[j - 1].1.kind == TokenKind::Ident
-                    && j >= 2
-                    && matches!(pieces[j - 2].1.text, "struct" | "union" | "enum")));
-        if is_star(&pieces[j].1) && prev_is_type && same_line(&pieces[j].0) {
-            let mut k = j;
-            while k + 1 < pieces.len() && is_star(&pieces[k + 1].1) && same_line(&pieces[k + 1].0) {
-                k += 1;
-            }
-            pieces[j].0 = " ".to_owned();
-            for piece in &mut pieces[j + 1..=k] {
-                piece.0.clear();
-            }
-            if let Some(after) = pieces.get_mut(k + 1)
-                && same_line(&after.0)
-            {
-                after.0 = if after.1.kind == TokenKind::Ident {
-                    " ".to_owned()
-                } else {
-                    String::new()
-                };
-            }
-            j = k + 1;
-            continue;
-        }
-        j += 1;
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// A C-style cast `(type) x` gets a space after the `)` (§2.5). Conservative: the parenthesized
 /// group must be type-only and contain a type keyword (so a grouped expression is never mistaken
 /// for one), be in a non-value position, and be followed by an operand.
 fn space_casts(pieces: &mut [Piece]) {
     let value_start = |t: &Token| {
         matches!(

---- pointers_are_middle_spaced_after_type_keywords stdout ----

thread 'pointers_are_middle_spaced_after_type_keywords' (827540) panicked at tests/conformance.rs:233:5:
assertion `left == right` failed
  left: "int*p;\n"
 right: "int * p;\n"

---- struct_tag_pointer_is_middle_spaced stdout ----

thread 'struct_tag_pointer_is_middle_spaced' (827549) panicked at tests/conformance.rs:255:5:
assertion `left == right` failed
  left: "struct shape*s;\n"
 right: "struct shape * s;\n"

failures:
    pointers_are_middle_spaced_after_type_keywords
    struct_tag_pointer_is_middle_spaced

test result: FAILED. 51 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
