*** src/reflow.rs:183:58: replace && with || in space_pointers

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in space_pointers
@@ -175,17 +175,17 @@
     out.push_str(&trailing);
     out
 }
 
 /// Middle-align pointer `*` (§2.5: `T * p`, `T ** p`). A `*` cluster is a pointer only when
 /// preceded by a type keyword/qualifier or a `struct`/`union`/`enum` tag; multiply, deref,
 /// function pointers `(*f)`, and bare-typedef pointers are left as is (§6).
 fn space_pointers(pieces: &mut [Piece]) {
-    let is_star = |t: &Token| t.kind == TokenKind::Punct && t.text == "*";
+    let is_star = |t: &Token| t.kind == TokenKind::Punct || /* ~ changed by cargo-mutants ~ */ t.text == "*";
     let mut j = 0;
     while j < pieces.len() {
         let prev_is_type = j > 0
             && (is_type_context(pieces[j - 1].1.text)
                 || (pieces[j - 1].1.kind == TokenKind::Ident
                     && j >= 2
                     && matches!(pieces[j - 2].1.text, "struct" | "union" | "enum")));
         if is_star(&pieces[j].1) && prev_is_type && same_line(&pieces[j].0) {

---- casts_get_a_trailing_space stdout ----

thread 'casts_get_a_trailing_space' (479036) panicked at tests/conformance.rs:261:5:
assertion `left == right` failed
  left: "x = (int ) y;\n"
 right: "x = (int) y;\n"

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (479046) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(\n\t&(struct config ){\n\t\t. alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literal_brace_stays_tight stdout ----

thread 'compound_literal_brace_stays_tight' (479047) panicked at tests/conformance.rs:282:5:
assertion `left == right` failed
  left: "p = &(struct shape ){. x = 1};\n"
 right: "p = &(struct shape){.x = 1};\n"

failures:
    casts_get_a_trailing_space
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    function_pointer_star_is_not_spaced
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    nested_paren_comma_is_not_a_split_point

test result: FAILED. 41 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
