*** src/reflow.rs:185:13: replace < with <= in space_pointers

*** mutation diff:
--- src/reflow.rs
+++ replace < with <= in space_pointers
@@ -177,17 +177,17 @@
 }
 
 /// Middle-align pointer `*` (§2.5: `T * p`, `T ** p`). A `*` cluster is a pointer only when
 /// preceded by a type keyword/qualifier or a `struct`/`union`/`enum` tag; multiply, deref,
 /// function pointers `(*f)`, and bare-typedef pointers are left as is (§6).
 fn space_pointers(pieces: &mut [Piece]) {
     let is_star = |t: &Token| t.kind == TokenKind::Punct && t.text == "*";
     let mut j = 0;
-    while j < pieces.len() {
+    while j <= /* ~ changed by cargo-mutants ~ */ pieces.len() {
         let prev_is_type = j > 0
             && (is_type_context(pieces[j - 1].1.text)
                 || (pieces[j - 1].1.kind == TokenKind::Ident
                     && j >= 2
                     && matches!(pieces[j - 2].1.text, "struct" | "union" | "enum")));
         if is_star(&pieces[j].1) && prev_is_type && same_line(&pieces[j].0) {
             let mut k = j;
             while k + 1 < pieces.len() && is_star(&pieces[k + 1].1) && same_line(&pieces[k + 1].0) {

---- ambiguous_star_is_left_alone stdout ----

thread 'ambiguous_star_is_left_alone' (830925) panicked at src/reflow.rs:191:21:
index out of bounds: the len is 6 but the index is 6

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (830927) panicked at src/reflow.rs:191:21:
index out of bounds: the len is 10 but the index is 10

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (830929) panicked at src/reflow.rs:191:21:
index out of bounds: the len is 6 but the index is 6

failures:
    ambiguous_star_is_left_alone
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    block_comment_internals_are_untouched
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes

test result: FAILED. 1 passed; 52 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
