*** src/reflow.rs:187:42: replace - with / in space_pointers

*** mutation diff:
--- src/reflow.rs
+++ replace - with / in space_pointers
@@ -179,17 +179,17 @@
 /// Middle-align pointer `*` (§2.5: `T * p`, `T ** p`). A `*` cluster is a pointer only when
 /// preceded by a type keyword/qualifier or a `struct`/`union`/`enum` tag; multiply, deref,
 /// function pointers `(*f)`, and bare-typedef pointers are left as is (§6).
 fn space_pointers(pieces: &mut [Piece]) {
     let is_star = |t: &Token| t.kind == TokenKind::Punct && t.text == "*";
     let mut j = 0;
     while j < pieces.len() {
         let prev_is_type = j > 0
-            && (is_type_context(pieces[j - 1].1.text)
+            && (is_type_context(pieces[j / /* ~ changed by cargo-mutants ~ */ 1].1.text)
                 || (pieces[j - 1].1.kind == TokenKind::Ident
                     && j >= 2
                     && matches!(pieces[j - 2].1.text, "struct" | "union" | "enum")));
         if is_star(&pieces[j].1) && prev_is_type && same_line(&pieces[j].0) {
             let mut k = j;
             while k + 1 < pieces.len() && is_star(&pieces[k + 1].1) && same_line(&pieces[k + 1].0) {
                 k += 1;
             }

---- pointers_are_middle_spaced_after_type_keywords stdout ----

thread 'pointers_are_middle_spaced_after_type_keywords' (833917) panicked at tests/conformance.rs:233:5:
assertion `left == right` failed
  left: "int*p;\n"
 right: "int * p;\n"

failures:
    pointers_are_middle_spaced_after_type_keywords

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
