*** src/reflow.rs:188:30: replace - with / in space_pointers

*** mutation diff:
--- src/reflow.rs
+++ replace - with / in space_pointers
@@ -180,17 +180,17 @@
 /// preceded by a type keyword/qualifier or a `struct`/`union`/`enum` tag; multiply, deref,
 /// function pointers `(*f)`, and bare-typedef pointers are left as is (§6).
 fn space_pointers(pieces: &mut [Piece]) {
     let is_star = |t: &Token| t.kind == TokenKind::Punct && t.text == "*";
     let mut j = 0;
     while j < pieces.len() {
         let prev_is_type = j > 0
             && (is_type_context(pieces[j - 1].1.text)
-                || (pieces[j - 1].1.kind == TokenKind::Ident
+                || (pieces[j / /* ~ changed by cargo-mutants ~ */ 1].1.kind == TokenKind::Ident
                     && j >= 2
                     && matches!(pieces[j - 2].1.text, "struct" | "union" | "enum")));
         if is_star(&pieces[j].1) && prev_is_type && same_line(&pieces[j].0) {
             let mut k = j;
             while k + 1 < pieces.len() && is_star(&pieces[k + 1].1) && same_line(&pieces[k + 1].0) {
                 k += 1;
             }
             pieces[j].0 = " ".to_owned();

---- struct_tag_pointer_is_middle_spaced stdout ----

thread 'struct_tag_pointer_is_middle_spaced' (836960) panicked at tests/conformance.rs:255:5:
assertion `left == right` failed
  left: "struct shape*s;\n"
 right: "struct shape * s;\n"

failures:
    struct_tag_pointer_is_middle_spaced

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
