*** src/reflow.rs:190:21: replace && with || in space_pointers

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in space_pointers
@@ -182,17 +182,17 @@
 fn space_pointers(pieces: &mut [Piece]) {
     let is_star = |t: &Token| t.kind == TokenKind::Punct && t.text == "*";
     let mut j = 0;
     while j < pieces.len() {
         let prev_is_type = j > 0
             && (is_type_context(pieces[j - 1].1.text)
                 || (pieces[j - 1].1.kind == TokenKind::Ident
                     && j >= 2
-                    && matches!(pieces[j - 2].1.text, "struct" | "union" | "enum")));
+                    || /* ~ changed by cargo-mutants ~ */ matches!(pieces[j - 2].1.text, "struct" | "union" | "enum")));
         if is_star(&pieces[j].1) && prev_is_type && same_line(&pieces[j].0) {
             let mut k = j;
             while k + 1 < pieces.len() && is_star(&pieces[k + 1].1) && same_line(&pieces[k + 1].0) {
                 k += 1;
             }
             pieces[j].0 = " ".to_owned();
             for piece in &mut pieces[j + 1..=k] {
                 piece.0.clear();

---- ambiguous_star_is_left_alone stdout ----

thread 'ambiguous_star_is_left_alone' (834927) panicked at src/reflow.rs:190:75:
attempt to subtract with overflow

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (834928) panicked at src/reflow.rs:190:75:
attempt to subtract with overflow

---- block_comment_internals_are_untouched stdout ----

thread 'block_comment_internals_are_untouched' (834931) panicked at src/reflow.rs:190:75:
attempt to subtract with overflow

failures:
    ambiguous_star_is_left_alone
    bit_field_colon_spacing
    block_comment_internals_are_untouched
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    condition_splits_on_the_outer_logical_operator

test result: FAILED. 11 passed; 42 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
