*** src/reflow.rs:191:34: replace && with || in space_pointers

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in space_pointers
@@ -183,17 +183,17 @@
     let is_star = |t: &Token| t.kind == TokenKind::Punct && t.text == "*";
     let mut j = 0;
     while j < pieces.len() {
         let prev_is_type = j > 0
             && (is_type_context(pieces[j - 1].1.text)
                 || (pieces[j - 1].1.kind == TokenKind::Ident
                     && j >= 2
                     && matches!(pieces[j - 2].1.text, "struct" | "union" | "enum")));
-        if is_star(&pieces[j].1) && prev_is_type && same_line(&pieces[j].0) {
+        if is_star(&pieces[j].1) || /* ~ changed by cargo-mutants ~ */ prev_is_type && same_line(&pieces[j].0) {
             let mut k = j;
             while k + 1 < pieces.len() && is_star(&pieces[k + 1].1) && same_line(&pieces[k + 1].0) {
                 k += 1;
             }
             pieces[j].0 = " ".to_owned();
             for piece in &mut pieces[j + 1..=k] {
                 piece.0.clear();
             }

---- ambiguous_star_is_left_alone stdout ----

thread 'ambiguous_star_is_left_alone' (488779) panicked at tests/conformance.rs:242:5:
assertion `left == right` failed
  left: "z = a * b;\n"
 right: "z = a*b;\n"

---- casts_get_a_trailing_space stdout ----

thread 'casts_get_a_trailing_space' (488802) panicked at tests/conformance.rs:261:5:
assertion `left == right` failed
  left: "x = (int ) y;\n"
 right: "x = (int) y;\n"

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (488811) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(\n\t&(struct config ){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

failures:
    ambiguous_star_is_left_alone
    casts_get_a_trailing_space
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    do_while_macro_passes_through
    for_header_is_not_treated_as_a_call
    function_pointer_star_is_not_spaced
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 33 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
