*** src/reflow.rs:194:19: replace += with *= in space_pointers

*** mutation diff:
--- src/reflow.rs
+++ replace += with *= in space_pointers
@@ -186,17 +186,17 @@
         let prev_is_type = j > 0
             && (is_type_context(pieces[j - 1].1.text)
                 || (pieces[j - 1].1.kind == TokenKind::Ident
                     && j >= 2
                     && matches!(pieces[j - 2].1.text, "struct" | "union" | "enum")));
         if is_star(&pieces[j].1) && prev_is_type && same_line(&pieces[j].0) {
             let mut k = j;
             while k + 1 < pieces.len() && is_star(&pieces[k + 1].1) && same_line(&pieces[k + 1].0) {
-                k += 1;
+                k *= /* ~ changed by cargo-mutants ~ */ 1;
             }
             pieces[j].0 = " ".to_owned();
             for piece in &mut pieces[j + 1..=k] {
                 piece.0.clear();
             }
             if let Some(after) = pieces.get_mut(k + 1)
                 && same_line(&after.0)
             {

*** result: Timeout
