*** src/reflow.rs:203:43: replace == with != in space_pointers

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in space_pointers
@@ -195,17 +195,17 @@
             }
             pieces[j].0 = " ".to_owned();
             for piece in &mut pieces[j + 1..=k] {
                 piece.0.clear();
             }
             if let Some(after) = pieces.get_mut(k + 1)
                 && same_line(&after.0)
             {
-                after.0 = if after.1.kind == TokenKind::Ident {
+                after.0 = if after.1.kind != /* ~ changed by cargo-mutants ~ */ TokenKind::Ident {
                     " ".to_owned()
                 } else {
                     String::new()
                 };
             }
             j = k + 1;
             continue;
         }

---- casts_get_a_trailing_space stdout ----

thread 'casts_get_a_trailing_space' (500725) panicked at tests/conformance.rs:262:5:
assertion `left == right` failed
  left: "p = (void * ) q;\n"
 right: "p = (void *) q;\n"

---- nested_paren_comma_is_not_a_split_point stdout ----

thread 'nested_paren_comma_is_not_a_split_point' (500762) panicked at tests/conformance.rs:143:5:
assertion `left == right` failed: inner comma must stay inside the nested parens
  left: "register_cb(int (*cb)(void *ctx, int status), int n);\n"
 right: "register_cb(int (*cb)(void * ctx, int status), int n);\n"

---- struct_tag_pointer_is_middle_spaced stdout ----

thread 'struct_tag_pointer_is_middle_spaced' (500777) panicked at tests/conformance.rs:255:5:
assertion `left == right` failed
  left: "struct shape *s;\n"
 right: "struct shape * s;\n"

failures:
    casts_get_a_trailing_space
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    nested_paren_comma_is_not_a_split_point
    passthrough_for_call_free_input
    pointers_are_middle_spaced_after_type_keywords
    struct_tag_pointer_is_middle_spaced

test result: FAILED. 44 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
