*** src/reflow.rs:209:19: replace + with * in space_pointers

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in space_pointers
@@ -201,17 +201,17 @@
                 && same_line(&after.0)
             {
                 after.0 = if after.1.kind == TokenKind::Ident {
                     " ".to_owned()
                 } else {
                     String::new()
                 };
             }
-            j = k + 1;
+            j = k * /* ~ changed by cargo-mutants ~ */ 1;
             continue;
         }
         j += 1;
     }
 }
 
 /// A C-style cast `(type) x` gets a space after the `)` (§2.5). Conservative: the parenthesized
 /// group must be type-only and contain a type keyword (so a grouped expression is never mistaken

*** result: Timeout
