*** src/reflow.rs:220:5: replace space_casts with ()

*** mutation diff:
--- src/reflow.rs
+++ replace space_casts with ()
@@ -212,49 +212,17 @@
         j += 1;
     }
 }
 
 /// A C-style cast `(type) x` gets a space after the `)` (§2.5). Conservative: the parenthesized
 /// group must be type-only and contain a type keyword (so a grouped expression is never mistaken
 /// for one), be in a non-value position, and be followed by an operand.
 fn space_casts(pieces: &mut [Piece]) {
-    let value_start = |t: &Token| {
-        matches!(
-            t.kind,
-            TokenKind::Ident | TokenKind::Number | TokenKind::String | TokenKind::Char
-        ) || (t.kind == TokenKind::Punct
-            && matches!(t.text, "(" | "*" | "&" | "!" | "~" | "-" | "+"))
-    };
-    for open in 0..pieces.len() {
-        if pieces[open].1.text != "(" {
-            continue;
-        }
-        let Some(close) = piece_close_paren(pieces, open) else {
-            continue;
-        };
-        let inner = &pieces[open + 1..close];
-        let type_only = inner.iter().all(|p| {
-            p.1.kind == TokenKind::Ident
-                || matches!(p.1.text, "*" | "[" | "]")
-                || p.1.kind == TokenKind::Number
-        });
-        let has_type = inner
-            .iter()
-            .any(|p| is_type_context(p.1.text) || matches!(p.1.text, "struct" | "union" | "enum"));
-        let prev_is_value = open > 0
-            && (pieces[open - 1].1.kind == TokenKind::Ident
-                || matches!(pieces[open - 1].1.text, ")" | "]"));
-        let followed_by_operand = pieces
-            .get(close + 1)
-            .is_some_and(|after| same_line(&after.0) && value_start(&after.1));
-        if type_only && has_type && !prev_is_value && followed_by_operand {
-            pieces[close + 1].0 = " ".to_owned();
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// K&R brace attach: `) {` keeps one space (§2.5) for function and control bodies, but the tight
 /// `({` statement-expression and `(type){...}` compound literal are left alone. The matching `(`
 /// follows an identifier for the former and an operator/`&`/`=` for the latter, which decides it.
 fn space_braces(pieces: &mut [Piece]) {
     for j in 1..pieces.len() {
         if pieces[j].1.text == "{" && pieces[j - 1].1.text == ")" && same_line(&pieces[j].0) {

---- casts_get_a_trailing_space stdout ----

thread 'casts_get_a_trailing_space' (849848) panicked at tests/conformance.rs:261:5:
assertion `left == right` failed
  left: "x = (int)y;\n"
 right: "x = (int) y;\n"

failures:
    casts_get_a_trailing_space

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
