*** src/reflow.rs:224:22: replace == with != in space_casts

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in space_casts
@@ -216,17 +216,17 @@
 /// A C-style cast `(type) x` gets a space after the `)` (§2.5). Conservative: the parenthesized
 /// group must be type-only and contain a type keyword (so a grouped expression is never mistaken
 /// for one), be in a non-value position, and be followed by an operand.
 fn space_casts(pieces: &mut [Piece]) {
     let value_start = |t: &Token| {
         matches!(
             t.kind,
             TokenKind::Ident | TokenKind::Number | TokenKind::String | TokenKind::Char
-        ) || (t.kind == TokenKind::Punct
+        ) || (t.kind != /* ~ changed by cargo-mutants ~ */ TokenKind::Punct
             && matches!(t.text, "(" | "*" | "&" | "!" | "~" | "-" | "+"))
     };
     for open in 0..pieces.len() {
         if pieces[open].1.text != "(" {
             continue;
         }
         let Some(close) = piece_close_paren(pieces, open) else {
             continue;

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (504613) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A(\n\t{\n\t\t\"\";,\n\t}\n)\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:28.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")", width = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (504611) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A({\"\";})\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:17.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")"
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
