*** src/reflow.rs:225:13: replace && with || in space_casts

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in space_casts
@@ -217,17 +217,17 @@
 /// group must be type-only and contain a type keyword (so a grouped expression is never mistaken
 /// for one), be in a non-value position, and be followed by an operand.
 fn space_casts(pieces: &mut [Piece]) {
     let value_start = |t: &Token| {
         matches!(
             t.kind,
             TokenKind::Ident | TokenKind::Number | TokenKind::String | TokenKind::Char
         ) || (t.kind == TokenKind::Punct
-            && matches!(t.text, "(" | "*" | "&" | "!" | "~" | "-" | "+"))
+            || /* ~ changed by cargo-mutants ~ */ matches!(t.text, "(" | "*" | "&" | "!" | "~" | "-" | "+"))
     };
     for open in 0..pieces.len() {
         if pieces[open].1.text != "(" {
             continue;
         }
         let Some(close) = piece_close_paren(pieces, open) else {
             continue;
         };

---- compound_literal_brace_stays_tight stdout ----

thread 'compound_literal_brace_stays_tight' (851322) panicked at tests/conformance.rs:282:5:
assertion `left == right` failed
  left: "p = &(struct shape) {.x = 1};\n"
 right: "p = &(struct shape){.x = 1};\n"

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (851321) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(\n\t&(struct config) {\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (851324) panicked at tests/conformance.rs:418:5:
assertion `left == right` failed
  left: "p = &(struct shape) {\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

failures:
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 47 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
