*** src/reflow.rs:243:34: replace > with == in space_casts

*** mutation diff:
--- src/reflow.rs
+++ replace > with == in space_casts
@@ -235,17 +235,17 @@
         let type_only = inner.iter().all(|p| {
             p.1.kind == TokenKind::Ident
                 || matches!(p.1.text, "*" | "[" | "]")
                 || p.1.kind == TokenKind::Number
         });
         let has_type = inner
             .iter()
             .any(|p| is_type_context(p.1.text) || matches!(p.1.text, "struct" | "union" | "enum"));
-        let prev_is_value = open > 0
+        let prev_is_value = open == /* ~ changed by cargo-mutants ~ */ 0
             && (pieces[open - 1].1.kind == TokenKind::Ident
                 || matches!(pieces[open - 1].1.text, ")" | "]"));
         let followed_by_operand = pieces
             .get(close + 1)
             .is_some_and(|after| same_line(&after.0) && value_start(&after.1));
         if type_only && has_type && !prev_is_value && followed_by_operand {
             pieces[close + 1].0 = " ".to_owned();
         }

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (857053) panicked at src/reflow.rs:244:24:
attempt to subtract with overflow

thread 'idempotent_across_widths' (857053) panicked at src/reflow.rs:244:24:
attempt to subtract with overflow

thread 'idempotent_across_widths' (857053) panicked at src/reflow.rs:244:24:
attempt to subtract with overflow

thread 'idempotent_across_widths' (857053) panicked at src/reflow.rs:244:24:
attempt to subtract with overflow

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (857051) panicked at src/reflow.rs:244:24:
attempt to subtract with overflow

thread 'format_is_idempotent' (857051) panicked at src/reflow.rs:244:24:
attempt to subtract with overflow

thread 'format_is_idempotent' (857051) panicked at src/reflow.rs:244:24:
attempt to subtract with overflow

thread 'format_is_idempotent' (857051) panicked at src/reflow.rs:244:24:
attempt to subtract with overflow

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
