*** src/reflow.rs:243:34: replace > with >= in space_casts

*** mutation diff:
--- src/reflow.rs
+++ replace > with >= in space_casts
@@ -235,17 +235,17 @@
         let type_only = inner.iter().all(|p| {
             p.1.kind == TokenKind::Ident
                 || matches!(p.1.text, "*" | "[" | "]")
                 || p.1.kind == TokenKind::Number
         });
         let has_type = inner
             .iter()
             .any(|p| is_type_context(p.1.text) || matches!(p.1.text, "struct" | "union" | "enum"));
-        let prev_is_value = open > 0
+        let prev_is_value = open >= /* ~ changed by cargo-mutants ~ */ 0
             && (pieces[open - 1].1.kind == TokenKind::Ident
                 || matches!(pieces[open - 1].1.text, ")" | "]"));
         let followed_by_operand = pieces
             .get(close + 1)
             .is_some_and(|after| same_line(&after.0) && value_start(&after.1));
         if type_only && has_type && !prev_is_value && followed_by_operand {
             pieces[close + 1].0 = " ".to_owned();
         }

*** result: Success
