*** src/reflow.rs:248:54: replace && with || in space_casts

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in space_casts
@@ -240,17 +240,17 @@
         let has_type = inner
             .iter()
             .any(|p| is_type_context(p.1.text) || matches!(p.1.text, "struct" | "union" | "enum"));
         let prev_is_value = open > 0
             && (pieces[open - 1].1.kind == TokenKind::Ident
                 || matches!(pieces[open - 1].1.text, ")" | "]"));
         let followed_by_operand = pieces
             .get(close + 1)
-            .is_some_and(|after| same_line(&after.0) && value_start(&after.1));
+            .is_some_and(|after| same_line(&after.0) || /* ~ changed by cargo-mutants ~ */ value_start(&after.1));
         if type_only && has_type && !prev_is_value && followed_by_operand {
             pieces[close + 1].0 = " ".to_owned();
         }
     }
 }
 
 /// K&R brace attach: `) {` keeps one space (§2.5) for function and control bodies, but the tight
 /// `({` statement-expression and `(type){...}` compound literal are left alone. The matching `(`

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (862040) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(\n\t&(struct config) {\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literal_brace_stays_tight stdout ----

thread 'compound_literal_brace_stays_tight' (862041) panicked at tests/conformance.rs:282:5:
assertion `left == right` failed
  left: "p = &(struct shape) {.x = 1};\n"
 right: "p = &(struct shape){.x = 1};\n"

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (862042) panicked at tests/conformance.rs:418:5:
assertion `left == right` failed
  left: "p = &(struct shape) {\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

failures:
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 47 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
