*** src/reflow.rs:249:37: delete ! in space_casts

*** mutation diff:
--- src/reflow.rs
+++ delete ! in space_casts
@@ -241,17 +241,17 @@
             .iter()
             .any(|p| is_type_context(p.1.text) || matches!(p.1.text, "struct" | "union" | "enum"));
         let prev_is_value = open > 0
             && (pieces[open - 1].1.kind == TokenKind::Ident
                 || matches!(pieces[open - 1].1.text, ")" | "]"));
         let followed_by_operand = pieces
             .get(close + 1)
             .is_some_and(|after| same_line(&after.0) && value_start(&after.1));
-        if type_only && has_type && !prev_is_value && followed_by_operand {
+        if type_only && has_type &&  /* ~ changed by cargo-mutants ~ */prev_is_value && followed_by_operand {
             pieces[close + 1].0 = " ".to_owned();
         }
     }
 }
 
 /// K&R brace attach: `) {` keeps one space (§2.5) for function and control bodies, but the tight
 /// `({` statement-expression and `(type){...}` compound literal are left alone. The matching `(`
 /// follows an identifier for the former and an operator/`&`/`=` for the latter, which decides it.

---- casts_get_a_trailing_space stdout ----

thread 'casts_get_a_trailing_space' (516284) panicked at tests/conformance.rs:261:5:
assertion `left == right` failed
  left: "x = (int)y;\n"
 right: "x = (int) y;\n"

failures:
    casts_get_a_trailing_space

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
