*** src/reflow.rs:250:26: replace + with * in space_casts

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in space_casts
@@ -242,17 +242,17 @@
             .any(|p| is_type_context(p.1.text) || matches!(p.1.text, "struct" | "union" | "enum"));
         let prev_is_value = open > 0
             && (pieces[open - 1].1.kind == TokenKind::Ident
                 || matches!(pieces[open - 1].1.text, ")" | "]"));
         let followed_by_operand = pieces
             .get(close + 1)
             .is_some_and(|after| same_line(&after.0) && value_start(&after.1));
         if type_only && has_type && !prev_is_value && followed_by_operand {
-            pieces[close + 1].0 = " ".to_owned();
+            pieces[close * /* ~ changed by cargo-mutants ~ */ 1].0 = " ".to_owned();
         }
     }
 }
 
 /// K&R brace attach: `) {` keeps one space (§2.5) for function and control bodies, but the tight
 /// `({` statement-expression and `(type){...}` compound literal are left alone. The matching `(`
 /// follows an identifier for the former and an operator/`&`/`=` for the latter, which decides it.
 fn space_braces(pieces: &mut [Piece]) {

---- casts_get_a_trailing_space stdout ----

thread 'casts_get_a_trailing_space' (864827) panicked at tests/conformance.rs:261:5:
assertion `left == right` failed
  left: "x = (int )y;\n"
 right: "x = (int) y;\n"

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (864849) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (864847) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    casts_get_a_trailing_space
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 50 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
