*** src/reflow.rs:259:5: replace space_braces with ()

*** mutation diff:
--- src/reflow.rs
+++ replace space_braces with ()
@@ -251,26 +251,17 @@
         }
     }
 }
 
 /// K&R brace attach: `) {` keeps one space (§2.5) for function and control bodies, but the tight
 /// `({` statement-expression and `(type){...}` compound literal are left alone. The matching `(`
 /// follows an identifier for the former and an operator/`&`/`=` for the latter, which decides it.
 fn space_braces(pieces: &mut [Piece]) {
-    for j in 1..pieces.len() {
-        if pieces[j].1.text == "{" && pieces[j - 1].1.text == ")" && same_line(&pieces[j].0) {
-            let function_or_control = piece_open_paren(pieces, j - 1)
-                .and_then(|open| open.checked_sub(1))
-                .is_some_and(|before| pieces[before].1.kind == TokenKind::Ident);
-            if function_or_control {
-                pieces[j].0 = " ".to_owned();
-            }
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Bit-field colon spacing (§2.5: `x: 1` — no space before, one after). A `:` qualifies only when
 /// it follows an identifier, precedes an integer literal, and no `?` opened a ternary earlier in
 /// the statement (which would make it a ternary colon, not a bit-field).
 fn space_bit_fields(pieces: &mut [Piece]) {
     for j in 1..pieces.len().saturating_sub(1) {
         let is_bit_field = pieces[j].1.text == ":"

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (865710) panicked at tests/conformance.rs:275:5:
assertion `left == right` failed
  left: "void f(void){}\n"
 right: "void f(void) {}\n"

failures:
    brace_attaches_for_functions_and_control

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
