*** src/reflow.rs:261:66: replace - with + in space_braces

*** mutation diff:
--- src/reflow.rs
+++ replace - with + in space_braces
@@ -253,17 +253,17 @@
 }
 
 /// K&R brace attach: `) {` keeps one space (§2.5) for function and control bodies, but the tight
 /// `({` statement-expression and `(type){...}` compound literal are left alone. The matching `(`
 /// follows an identifier for the former and an operator/`&`/`=` for the latter, which decides it.
 fn space_braces(pieces: &mut [Piece]) {
     for j in 1..pieces.len() {
         if pieces[j].1.text == "{" && pieces[j - 1].1.text == ")" && same_line(&pieces[j].0) {
-            let function_or_control = piece_open_paren(pieces, j - 1)
+            let function_or_control = piece_open_paren(pieces, j + /* ~ changed by cargo-mutants ~ */ 1)
                 .and_then(|open| open.checked_sub(1))
                 .is_some_and(|before| pieces[before].1.kind == TokenKind::Ident);
             if function_or_control {
                 pieces[j].0 = " ".to_owned();
             }
         }
     }
 }

---- declaration_with_brace_explodes_and_keeps_brace_attached stdout ----

thread 'declaration_with_brace_explodes_and_keeps_brace_attached' (522806) panicked at src/reflow.rs:119:15:
index out of bounds: the len is 14 but the index is 14

failures:
    declaration_with_brace_explodes_and_keeps_brace_attached

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
