*** src/reflow.rs:27:5: replace format -> String with String::new()

*** mutation diff:
--- src/reflow.rs
+++ replace format -> String with String::new()
@@ -19,17 +19,17 @@
 pub const DEFAULT_WIDTH: usize = 100;
 
 /// Format C source with the default column limit ([`DEFAULT_WIDTH`]). Idempotent.
 ///
 /// ```
 /// assert_eq!(cfmt::format("int*p = f(a,b);\n"), "int * p = f(a, b);\n");
 /// ```
 pub fn format(src: &str) -> String {
-    format_with_width(src, DEFAULT_WIDTH)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Format with an explicit column limit. Tab width for the overflow measurement is fixed at
 /// [`TAB_WIDTH`] (§8.5 default).
 ///
 /// ```
 /// let narrow = cfmt::format_with_width("call(aaa, bbb, ccc);\n", 10);
 /// assert_eq!(narrow, "call(\n\taaa,\n\tbbb,\n\tccc\n);\n");

---- ambiguous_star_is_left_alone stdout ----

thread 'ambiguous_star_is_left_alone' (459558) panicked at tests/conformance.rs:242:5:
assertion `left == right` failed
  left: ""
 right: "z = a*b;\n"

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (459559) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: ""
 right: "struct s {\n\tint x: 2;\n};\n"

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (459561) panicked at tests/conformance.rs:337:5:
assertion `left == right` failed
  left: ""
 right: "int a;\n\nint b;\n"

failures:
    ambiguous_star_is_left_alone
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    block_comment_internals_are_untouched
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes

test result: FAILED. 2 passed; 49 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
