*** src/reflow.rs:282:16: delete ! in space_bit_fields

*** mutation diff:
--- src/reflow.rs
+++ delete ! in space_bit_fields
@@ -274,17 +274,17 @@
 fn space_bit_fields(pieces: &mut [Piece]) {
     for j in 1..pieces.len().saturating_sub(1) {
         let is_bit_field = pieces[j].1.text == ":"
             && pieces[j].1.kind == TokenKind::Punct
             && pieces[j - 1].1.kind == TokenKind::Ident
             && pieces[j + 1].1.kind == TokenKind::Number
             && same_line(&pieces[j].0)
             && same_line(&pieces[j + 1].0)
-            && !ternary_open_before(pieces, j);
+            &&  /* ~ changed by cargo-mutants ~ */ternary_open_before(pieces, j);
         if is_bit_field {
             pieces[j].0.clear();
             pieces[j + 1].0 = " ".to_owned();
         }
     }
 }
 
 /// Whether an unmatched `?` precedes index `j` within the current statement (back to `;`/`{`/`}`).

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (879935) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: "struct s {\n\tint x:2;\n};\n"
 right: "struct s {\n\tint x: 2;\n};\n"

---- unparenthesized_ternary_is_left_alone stdout ----

thread 'unparenthesized_ternary_is_left_alone' (880022) panicked at tests/conformance.rs:477:5:
assertion `left == right` failed
  left: "acc = a > b ? a : a < b ? b: 0;\n"
 right: "acc = a > b ? a : a < b ? b : 0;\n"

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (879981) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    bit_field_colon_spacing
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    unparenthesized_ternary_is_left_alone

test result: FAILED. 49 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
