*** src/reflow.rs:285:22: replace + with - in space_bit_fields

*** mutation diff:
--- src/reflow.rs
+++ replace + with - in space_bit_fields
@@ -277,17 +277,17 @@
             && pieces[j].1.kind == TokenKind::Punct
             && pieces[j - 1].1.kind == TokenKind::Ident
             && pieces[j + 1].1.kind == TokenKind::Number
             && same_line(&pieces[j].0)
             && same_line(&pieces[j + 1].0)
             && !ternary_open_before(pieces, j);
         if is_bit_field {
             pieces[j].0.clear();
-            pieces[j + 1].0 = " ".to_owned();
+            pieces[j - /* ~ changed by cargo-mutants ~ */ 1].0 = " ".to_owned();
         }
     }
 }
 
 /// Whether an unmatched `?` precedes index `j` within the current statement (back to `;`/`{`/`}`).
 fn ternary_open_before(pieces: &[Piece], j: usize) -> bool {
     for p in pieces[..j].iter().rev() {
         match p.1.text {

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (880047) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: "struct s {\n\tint x:2;\n};\n"
 right: "struct s {\n\tint x: 2;\n};\n"

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (880085) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (880083) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    bit_field_colon_spacing
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 50 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
