*** src/reflow.rs:292:5: replace ternary_open_before -> bool with false

*** mutation diff:
--- src/reflow.rs
+++ replace ternary_open_before -> bool with false
@@ -284,24 +284,17 @@
             pieces[j].0.clear();
             pieces[j + 1].0 = " ".to_owned();
         }
     }
 }
 
 /// Whether an unmatched `?` precedes index `j` within the current statement (back to `;`/`{`/`}`).
 fn ternary_open_before(pieces: &[Piece], j: usize) -> bool {
-    for p in pieces[..j].iter().rev() {
-        match p.1.text {
-            "?" => return true,
-            ";" | "{" | "}" => return false,
-            _ => {}
-        }
-    }
-    false
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Normalize every line ending to LF and guarantee exactly one trailing newline (§2.1). An
 /// all-whitespace input yields the empty string.
 fn normalize_endings(s: &str) -> String {
     let lf = s.replace("\r\n", "\n").replace('\r', "\n");
     let trimmed = lf.trim_end();
     if trimmed.is_empty() {

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (535179) panicked at tests/conformance.rs:319:5:
assertion `left == right` failed
  left: "z = a ? b: 3;\n"
 right: "z = a ? b : 3;\n"

---- unparenthesized_ternary_is_left_alone stdout ----

thread 'unparenthesized_ternary_is_left_alone' (535255) panicked at tests/conformance.rs:462:5:
assertion `left == right` failed
  left: "acc = a > b ? a : a < b ? b: 0;\n"
 right: "acc = a > b ? a : a < b ? b : 0;\n"

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (535217) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

failures:
    bit_field_colon_spacing
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    unparenthesized_ternary_is_left_alone

test result: FAILED. 47 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
