*** src/reflow.rs:294:13: delete match arm "?" in ternary_open_before

*** mutation diff:
--- src/reflow.rs
+++ delete match arm "?" in ternary_open_before
@@ -286,17 +286,17 @@
         }
     }
 }
 
 /// Whether an unmatched `?` precedes index `j` within the current statement (back to `;`/`{`/`}`).
 fn ternary_open_before(pieces: &[Piece], j: usize) -> bool {
     for p in pieces[..j].iter().rev() {
         match p.1.text {
-            "?" => return true,
+             /* ~ changed by cargo-mutants ~ */
             ";" | "{" | "}" => return false,
             _ => {}
         }
     }
     false
 }
 
 /// Normalize every line ending to LF and guarantee exactly one trailing newline (§2.1). An

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (535483) panicked at tests/conformance.rs:319:5:
assertion `left == right` failed
  left: "z = a ? b: 3;\n"
 right: "z = a ? b : 3;\n"

---- unparenthesized_ternary_is_left_alone stdout ----

thread 'unparenthesized_ternary_is_left_alone' (535533) panicked at tests/conformance.rs:462:5:
assertion `left == right` failed
  left: "acc = a > b ? a : a < b ? b: 0;\n"
 right: "acc = a > b ? a : a < b ? b : 0;\n"

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (535509) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

failures:
    bit_field_colon_spacing
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    unparenthesized_ternary_is_left_alone

test result: FAILED. 47 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
