*** src/reflow.rs:340:32: replace == with != in retab

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in retab
@@ -332,17 +332,17 @@
                 out.push('\t');
             }
             for _ in 0..cols % TAB_WIDTH {
                 out.push(' ');
             }
         } else {
             out.push_str(t.text);
         }
-        at_line_start = t.kind == TokenKind::Newline;
+        at_line_start = t.kind != /* ~ changed by cargo-mutants ~ */ TokenKind::Newline;
     }
     out
 }
 
 /// Run the structuring pass over `toks`, with the cursor starting at `start_col` (non-zero when
 /// formatting a fragment such as a macro body that follows a prefix).
 fn structure(toks: &[Token], start_col: usize, width: usize) -> String {
     let mut out = String::new();

---- indentation_is_normalized_to_tabs stdout ----

thread 'indentation_is_normalized_to_tabs' (543976) panicked at tests/conformance.rs:210:5:
assertion `left == right` failed
  left: "void f(void) {\n    int x = 1;\n        int y = 2;\n}\n"
 right: "void f(void) {\n\tint x = 1;\n\t\tint y = 2;\n}\n"

---- initializer_with_comment_keeps_structure_but_retabs stdout ----

thread 'initializer_with_comment_keeps_structure_but_retabs' (543978) panicked at tests/conformance.rs:203:5:
assertion `left == right` failed
  left: "int v[] = {\n    1, /* one */\n    2,\n};\n"
 right: "int v[] = {\n\t1, /* one */\n\t2,\n};\n"

---- messy_real_world_input_is_idempotent_and_safe stdout ----

thread 'messy_real_world_input_is_idempotent_and_safe' (543990) panicked at tests/conformance.rs:78:13:
messy line 21 is space-indented code: "    uint32_t flags;"

failures:
    golden_acceptance_unguarded_showcase
    indentation_is_normalized_to_tabs
    initializer_with_comment_keeps_structure_but_retabs
    messy_real_world_input_is_idempotent_and_safe

test result: FAILED. 47 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
