*** src/reflow.rs:353:13: replace < with > in structure

*** mutation diff:
--- src/reflow.rs
+++ replace < with > in structure
@@ -345,17 +345,17 @@
 /// Run the structuring pass over `toks`, with the cursor starting at `start_col` (non-zero when
 /// formatting a fragment such as a macro body that follows a prefix).
 fn structure(toks: &[Token], start_col: usize, width: usize) -> String {
     let mut out = String::new();
     let mut col = start_col;
     let mut i = 0usize;
     let mut paren_depth = 0i32;
     let mut in_init = false;
-    while i < toks.len() {
+    while i > /* ~ changed by cargo-mutants ~ */ toks.len() {
         let t = toks[i];
 
         if t.kind == TokenKind::Punct && t.text == "#" && current_line_is_blank(&out) {
             let is_define = next_nontrivia(toks, i + 1)
                 .is_some_and(|j| toks[j].kind == TokenKind::Ident && toks[j].text == "define");
             i = if is_define {
                 emit_define(toks, i, &mut out, &mut col, width)
             } else {

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (545837) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: ""
 right: "struct s {\n\tint x: 2;\n};\n"

---- ambiguous_star_is_left_alone stdout ----

thread 'ambiguous_star_is_left_alone' (545836) panicked at tests/conformance.rs:242:5:
assertion `left == right` failed
  left: ""
 right: "z = a*b;\n"

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (545839) panicked at tests/conformance.rs:337:5:
assertion `left == right` failed
  left: ""
 right: "int a;\n\nint b;\n"

failures:
    ambiguous_star_is_left_alone
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    block_comment_internals_are_untouched
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes

test result: FAILED. 2 passed; 49 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
