*** src/reflow.rs:356:49: replace == with != in structure

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in structure
@@ -348,17 +348,17 @@
     let mut out = String::new();
     let mut col = start_col;
     let mut i = 0usize;
     let mut paren_depth = 0i32;
     let mut in_init = false;
     while i < toks.len() {
         let t = toks[i];
 
-        if t.kind == TokenKind::Punct && t.text == "#" && current_line_is_blank(&out) {
+        if t.kind == TokenKind::Punct && t.text != /* ~ changed by cargo-mutants ~ */ "#" && current_line_is_blank(&out) {
             let is_define = next_nontrivia(toks, i + 1)
                 .is_some_and(|j| toks[j].kind == TokenKind::Ident && toks[j].text == "define");
             i = if is_define {
                 emit_define(toks, i, &mut out, &mut col, width)
             } else {
                 emit_directive(toks, i, &mut out, &mut col)
             };
             continue;

---- function_like_macro_body_opens_on_define_line stdout ----

thread 'function_like_macro_body_opens_on_define_line' (549818) panicked at tests/conformance.rs:410:5:
assertion `left == right` failed
  left: "#define DISPATCH_EVENT(handler, event) dispatch_incoming_event(\n\t(handler),\n\t(event),\n\tread_monotonic_timestamp_ms(),\n\tcurrent_execution_context_id()\n)\n"
 right: "#define DISPATCH_EVENT(handler, event) dispatch_incoming_event( \\\n\t(handler), \\\n\t(event), \\\n\tread_monotonic_timestamp_ms(), \\\n\tcurrent_execution_context_id() \\\n)\n"

---- generic_macro_explodes_one_association_per_line stdout ----

thread 'generic_macro_explodes_one_association_per_line' (549820) panicked at tests/conformance.rs:425:5:
assertion `left == right` failed
  left: "#define type_name(x) _Generic(\n\t(x),\n\tint: \"int\",\n\tlong: \"long\",\n\tfloat: \"float\",\n\tdouble: \"double\",\n\tdefault: \"other\"\n)\n"
 right: "#define type_name(x) _Generic( \\\n\t(x), \\\n\tint: \"int\", \\\n\tlong: \"long\", \\\n\tfloat: \"float\", \\\n\tdouble: \"double\", \\\n\tdefault: \"other\" \\\n)\n"

---- statement_expression_macro_blocks_with_continuations stdout ----

thread 'statement_expression_macro_blocks_with_continuations' (549845) panicked at tests/conformance.rs:418:5:
assertion `left == right` failed
  left: "#define MAX(a, b) ({\n\ttypeof(a) _a = (a);\n\ttypeof(b) _b = (b);\n\t_a > _b ? _a : _b;\n})\n"
 right: "#define MAX(a, b) ({ \\\n\ttypeof(a) _a = (a); \\\n\ttypeof(b) _b = (b); \\\n\t_a > _b ? _a : _b; \\\n})\n"

failures:
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    showcase_content_is_preserved
    statement_expression_macro_blocks_with_continuations

test result: FAILED. 45 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
