*** src/reflow.rs:372:39: replace + with * in structure

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in structure
@@ -364,17 +364,17 @@
             continue;
         }
 
         if t.kind == TokenKind::Ident
             && matches!(t.text, "if" | "while" | "switch" | "for")
             && let Some(open) = next_paren(toks, i)
             && let Some(close) = match_bracket(toks, open)
             && !contains_comment(&toks[open + 1..close])
-            && is_balanced(&toks[open + 1..close])
+            && is_balanced(&toks[open * /* ~ changed by cargo-mutants ~ */ 1..close])
         {
             // §2.5: control keywords take exactly one space before `(` (`if (`, not `if(`).
             emit_str(&mut out, &mut col, t.text);
             emit_str(&mut out, &mut col, " ");
             let inner = &toks[open + 1..close];
             let doc = if t.text == "for" {
                 build_for_doc(inner)
             } else {

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (901134) panicked at tests/conformance.rs:276:5:
assertion `left == right` failed
  left: "if(x) {}\n"
 right: "if (x) {}\n"

---- condition_splits_on_the_outer_logical_operator stdout ----

thread 'condition_splits_on_the_outer_logical_operator' (901152) panicked at tests/conformance.rs:396:5:
assertion `left == right` failed
  left: "if (alpha_value > 100 || bravo_value > 200 || charlie_value > 300 || delta_value > 400 || echo_v > 5) {\n}\n"
 right: "if (\n\talpha_value > 100 ||\n\tbravo_value > 200 ||\n\tcharlie_value > 300 ||\n\tdelta_value > 400 ||\n\techo_v > 5\n) {\n}\n"

---- control_keyword_gets_one_space_before_paren stdout ----

thread 'control_keyword_gets_one_space_before_paren' (901155) panicked at tests/conformance.rs:226:5:
assertion `left == right` failed
  left: "if(x) y;\n"
 right: "if (x) y;\n"

failures:
    brace_attaches_for_functions_and_control
    condition_splits_on_the_outer_logical_operator
    control_keyword_gets_one_space_before_paren
    golden_acceptance_unguarded_showcase
    long_for_header_explodes_one_clause_per_line
    long_if_condition_explodes_with_trailing_operators

test result: FAILED. 47 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
