*** src/reflow.rs:377:36: replace + with * in structure

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in structure
@@ -369,17 +369,17 @@
             && let Some(open) = next_paren(toks, i)
             && let Some(close) = match_bracket(toks, open)
             && !contains_comment(&toks[open + 1..close])
             && is_balanced(&toks[open + 1..close])
         {
             // §2.5: control keywords take exactly one space before `(` (`if (`, not `if(`).
             emit_str(&mut out, &mut col, t.text);
             emit_str(&mut out, &mut col, " ");
-            let inner = &toks[open + 1..close];
+            let inner = &toks[open * /* ~ changed by cargo-mutants ~ */ 1..close];
             let doc = if t.text == "for" {
                 build_for_doc(inner)
             } else {
                 build_cond_doc(inner)
             };
             let base_level = current_line_indent_cols(&out) / TAB_WIDTH;
             let reserved = trailing_reserved(toks, close + 1);
             let rendered = render(&doc, width.saturating_sub(reserved), col, base_level);

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (555631) panicked at tests/conformance.rs:276:5:
assertion `left == right` failed
  left: "if ((x) {}\n"
 right: "if (x) {}\n"

---- control_headers_are_not_calls stdout ----

thread 'control_headers_are_not_calls' (555649) panicked at tests/conformance.rs:153:5:
assertion `left == right` failed
  left: "if ((a && b) { return f(x); }\n"
 right: "if (a && b) { return f(x); }\n"

---- control_keyword_gets_one_space_before_paren stdout ----

thread 'control_keyword_gets_one_space_before_paren' (555651) panicked at tests/conformance.rs:226:5:
assertion `left == right` failed
  left: "if ((x) y;\n"
 right: "if (x) y;\n"

failures:
    brace_attaches_for_functions_and_control
    control_headers_are_not_calls
    control_keyword_gets_one_space_before_paren
    for_header_is_not_treated_as_a_call
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    long_for_header_explodes_one_clause_per_line
    long_if_condition_explodes_with_trailing_operators
    messy_real_world_input_is_idempotent_and_safe
    short_control_headers_unchanged
    showcase_content_is_preserved

test result: FAILED. 40 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
