*** src/reflow.rs:408:46: replace + with - in structure

*** mutation diff:
--- src/reflow.rs
+++ replace + with - in structure
@@ -400,17 +400,17 @@
         }
 
         if is_call_head(toks, i)
             && let Some(close) = match_bracket(toks, i + 1)
             && !contains_comment(&toks[i + 2..close])
             && is_balanced(&toks[i + 2..close])
         {
             emit_str(&mut out, &mut col, t.text);
-            let doc = build_call_doc(&toks[i + 2..close]);
+            let doc = build_call_doc(&toks[i - /* ~ changed by cargo-mutants ~ */ 2..close]);
             let base_level = current_line_indent_cols(&out) / TAB_WIDTH;
             let reserved = trailing_reserved(toks, close + 1);
             let rendered = render(&doc, width.saturating_sub(reserved), col, base_level);
             emit_str(&mut out, &mut col, &rendered);
             i = close + 1;
             continue;
         }

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (911381) panicked at tests/conformance.rs:339:5:
assertion `left == right` failed
  left: "void f(void f(void) {\n\tint a;\n\n\tint b;\n}\n"
 right: "void f(void) {\n\tint a;\n\n\tint b;\n}\n"

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (911383) panicked at tests/conformance.rs:275:5:
assertion `left == right` failed
  left: "void f(void f(void) {}\n"
 right: "void f(void) {}\n"

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (911386) panicked at src/reflow.rs:408:44:
attempt to subtract with overflow

failures:
    blank_line_runs_collapse_to_one_everywhere
    brace_attaches_for_functions_and_control
    collapses_a_call_that_now_fits
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literals_in_function_args
    control_headers_are_not_calls
    declaration_with_brace_explodes_and_keeps_brace_attached
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase

test result: FAILED. 34 passed; 19 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
