*** src/reflow.rs:408:46: replace + with * in structure

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in structure
@@ -400,17 +400,17 @@
         }
 
         if is_call_head(toks, i)
             && let Some(close) = match_bracket(toks, i + 1)
             && !contains_comment(&toks[i + 2..close])
             && is_balanced(&toks[i + 2..close])
         {
             emit_str(&mut out, &mut col, t.text);
-            let doc = build_call_doc(&toks[i + 2..close]);
+            let doc = build_call_doc(&toks[i * /* ~ changed by cargo-mutants ~ */ 2..close]);
             let base_level = current_line_indent_cols(&out) / TAB_WIDTH;
             let reserved = trailing_reserved(toks, close + 1);
             let rendered = render(&doc, width.saturating_sub(reserved), col, base_level);
             emit_str(&mut out, &mut col, &rendered);
             i = close + 1;
             continue;
         }

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (565869) panicked at tests/conformance.rs:137:5:
assertion `left == right` failed
  left: "foo(foo( a, b);\n"
 right: "foo(a, b);\n"

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (565872) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(init(&(struct config){.alpha = 1111111111, .beta = 2222222222, .gamma = 3333333333, .delta = 4444444444});\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (565875) panicked at tests/conformance.rs:291:5:
assertion `left == right` failed
  left: "configure(configure(&(struct opts){.mode = 1, .flags = 0}, count);\n"
 right: "configure(&(struct opts){.mode = 1, .flags = 0}, count);\n"

failures:
    collapses_a_call_that_now_fits
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literals_in_function_args
    control_headers_are_not_calls
    declaration_with_brace_explodes_and_keeps_brace_attached
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    long_call_explodes_one_per_line
    messy_real_world_input_is_idempotent_and_safe

test result: FAILED. 35 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
