*** src/reflow.rs:419:23: replace == with != in structure

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in structure
@@ -411,17 +411,17 @@
             let rendered = render(&doc, width.saturating_sub(reserved), col, base_level);
             emit_str(&mut out, &mut col, &rendered);
             i = close + 1;
             continue;
         }
 
         // GNU statement-expression `({ ... })` — block-indent its statements.
         if t.kind == TokenKind::Punct
-            && t.text == "("
+            && t.text != /* ~ changed by cargo-mutants ~ */ "("
             && toks
                 .get(i + 1)
                 .is_some_and(|n| n.kind == TokenKind::Punct && n.text == "{")
         {
             let base_level = current_line_indent_cols(&out) / TAB_WIDTH;
             if let Some((block, next)) = format_stmt_expr(toks, i, base_level) {
                 emit_str(&mut out, &mut col, &block);
                 i = next;

---- statement_expression_in_code_block_indents stdout ----

thread 'statement_expression_in_code_block_indents' (917269) panicked at tests/conformance.rs:466:5:
assertion `left == right` failed
  left: "int d = ({ int t = larger; t * 2; });\n"
 right: "int d = ({\n\tint t = larger;\n\tt * 2;\n});\n"

failures:
    statement_expression_in_code_block_indents

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
