*** src/reflow.rs:421:24: replace + with * in structure

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in structure
@@ -413,17 +413,17 @@
             i = close + 1;
             continue;
         }
 
         // GNU statement-expression `({ ... })` — block-indent its statements.
         if t.kind == TokenKind::Punct
             && t.text == "("
             && toks
-                .get(i + 1)
+                .get(i * /* ~ changed by cargo-mutants ~ */ 1)
                 .is_some_and(|n| n.kind == TokenKind::Punct && n.text == "{")
         {
             let base_level = current_line_indent_cols(&out) / TAB_WIDTH;
             if let Some((block, next)) = format_stmt_expr(toks, i, base_level) {
                 emit_str(&mut out, &mut col, &block);
                 i = next;
                 continue;
             }

---- statement_expression_in_code_block_indents stdout ----

thread 'statement_expression_in_code_block_indents' (571227) panicked at tests/conformance.rs:451:5:
assertion `left == right` failed
  left: "int d = ({ int t = larger; t * 2; });\n"
 right: "int d = ({\n\tint t = larger;\n\tt * 2;\n});\n"

failures:
    statement_expression_in_code_block_indents

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
