*** src/reflow.rs:422:61: replace && with || in structure

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in structure
@@ -414,17 +414,17 @@
             continue;
         }
 
         // GNU statement-expression `({ ... })` — block-indent its statements.
         if t.kind == TokenKind::Punct
             && t.text == "("
             && toks
                 .get(i + 1)
-                .is_some_and(|n| n.kind == TokenKind::Punct && n.text == "{")
+                .is_some_and(|n| n.kind == TokenKind::Punct || /* ~ changed by cargo-mutants ~ */ n.text == "{")
         {
             let base_level = current_line_indent_cols(&out) / TAB_WIDTH;
             if let Some((block, next)) = format_stmt_expr(toks, i, base_level) {
                 emit_str(&mut out, &mut col, &block);
                 i = next;
                 continue;
             }
         }

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (571300) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A(\n\t{\n\t\t\"\";,\n\t}\n)\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:28.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")", width = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (571298) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A({\"\";})\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:17.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")"
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
