*** src/reflow.rs:424:61: replace / with * in structure

*** mutation diff:
--- src/reflow.rs
+++ replace / with * in structure
@@ -416,17 +416,17 @@
 
         // GNU statement-expression `({ ... })` — block-indent its statements.
         if t.kind == TokenKind::Punct
             && t.text == "("
             && toks
                 .get(i + 1)
                 .is_some_and(|n| n.kind == TokenKind::Punct && n.text == "{")
         {
-            let base_level = current_line_indent_cols(&out) / TAB_WIDTH;
+            let base_level = current_line_indent_cols(&out) * /* ~ changed by cargo-mutants ~ */ TAB_WIDTH;
             if let Some((block, next)) = format_stmt_expr(toks, i, base_level) {
                 emit_str(&mut out, &mut col, &block);
                 i = next;
                 continue;
             }
         }
 
         // A parenthesized ternary `( ... ? ... : ... )` — flat chain, each `cond ? val :` on its

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (573326) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (573324) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 49 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
