*** src/reflow.rs:437:47: replace + with * in structure

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in structure
@@ -429,17 +429,17 @@
             }
         }
 
         // A parenthesized ternary `( ... ? ... : ... )` — flat chain, each `cond ? val :` on its
         // own line with the colon trailing (§2.4). Parens are author-written (§8.2), not inserted.
         if t.kind == TokenKind::Punct
             && t.text == "("
             && let Some(close) = match_bracket(toks, i)
-            && has_top_level_question(&toks[i + 1..close])
+            && has_top_level_question(&toks[i * /* ~ changed by cargo-mutants ~ */ 1..close])
             && !contains_comment(&toks[i + 1..close])
             && is_balanced(&toks[i + 1..close])
         {
             let doc = build_ternary_doc(&toks[i + 1..close]);
             let base_level = current_line_indent_cols(&out) / TAB_WIDTH;
             let reserved = trailing_reserved(toks, close + 1);
             let rendered = render(&doc, width.saturating_sub(reserved), col, base_level);
             emit_str(&mut out, &mut col, &rendered);

---- long_ternary_chain_explodes_flat_with_trailing_colons stdout ----

thread 'long_ternary_chain_explodes_flat_with_trailing_colons' (575461) panicked at tests/conformance.rs:472:5:
assertion `left == right` failed
  left: "return (status_code == 0 ? \"ok\" : status_code == 1 ? \"busy\" : status_code == 2 ? \"error\" : status_code < 0 ? \"fault\" : \"unknown\");\n"
 right: "return (\n\tstatus_code == 0 ? \"ok\" :\n\tstatus_code == 1 ? \"busy\" :\n\tstatus_code == 2 ? \"error\" :\n\tstatus_code < 0 ? \"fault\" :\n\t\"unknown\"\n);\n"

failures:
    long_ternary_chain_explodes_flat_with_trailing_colons

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
