*** src/reflow.rs:438:42: replace + with * in structure

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in structure
@@ -430,17 +430,17 @@
         }
 
         // A parenthesized ternary `( ... ? ... : ... )` — flat chain, each `cond ? val :` on its
         // own line with the colon trailing (§2.4). Parens are author-written (§8.2), not inserted.
         if t.kind == TokenKind::Punct
             && t.text == "("
             && let Some(close) = match_bracket(toks, i)
             && has_top_level_question(&toks[i + 1..close])
-            && !contains_comment(&toks[i + 1..close])
+            && !contains_comment(&toks[i * /* ~ changed by cargo-mutants ~ */ 1..close])
             && is_balanced(&toks[i + 1..close])
         {
             let doc = build_ternary_doc(&toks[i + 1..close]);
             let base_level = current_line_indent_cols(&out) / TAB_WIDTH;
             let reserved = trailing_reserved(toks, close + 1);
             let rendered = render(&doc, width.saturating_sub(reserved), col, base_level);
             emit_str(&mut out, &mut col, &rendered);
             i = close + 1;

*** result: Success
