*** src/reflow.rs:441:49: replace + with * in structure

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in structure
@@ -433,17 +433,17 @@
         // own line with the colon trailing (§2.4). Parens are author-written (§8.2), not inserted.
         if t.kind == TokenKind::Punct
             && t.text == "("
             && let Some(close) = match_bracket(toks, i)
             && has_top_level_question(&toks[i + 1..close])
             && !contains_comment(&toks[i + 1..close])
             && is_balanced(&toks[i + 1..close])
         {
-            let doc = build_ternary_doc(&toks[i + 1..close]);
+            let doc = build_ternary_doc(&toks[i * /* ~ changed by cargo-mutants ~ */ 1..close]);
             let base_level = current_line_indent_cols(&out) / TAB_WIDTH;
             let reserved = trailing_reserved(toks, close + 1);
             let rendered = render(&doc, width.saturating_sub(reserved), col, base_level);
             emit_str(&mut out, &mut col, &rendered);
             i = close + 1;
             continue;
         }

---- long_ternary_chain_explodes_flat_with_trailing_colons stdout ----

thread 'long_ternary_chain_explodes_flat_with_trailing_colons' (579110) panicked at tests/conformance.rs:472:5:
assertion `left == right` failed
  left: "return (\n\t(status_code == 0 ? \"ok\" : status_code == 1 ? \"busy\" : status_code == 2 ? \"error\" : status_code < 0 ? \"fault\" : \"unknown\"\n);\n"
 right: "return (\n\tstatus_code == 0 ? \"ok\" :\n\tstatus_code == 1 ? \"busy\" :\n\tstatus_code == 2 ? \"error\" :\n\tstatus_code < 0 ? \"fault\" :\n\t\"unknown\"\n);\n"

---- short_parenthesized_ternary_stays_flat stdout ----

thread 'short_parenthesized_ternary_stays_flat' (579126) panicked at tests/conformance.rs:456:5:
assertion `left == right` failed
  left: "x = ((b != 0 ? b : 1);\n"
 right: "x = (b != 0 ? b : 1);\n"

---- messy_real_world_input_is_idempotent_and_safe stdout ----

thread 'messy_real_world_input_is_idempotent_and_safe' (579113) panicked at tests/conformance.rs:70:5:
assertion `left == right` failed: must be idempotent on messy input

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    long_ternary_chain_explodes_flat_with_trailing_colons
    messy_real_world_input_is_idempotent_and_safe
    short_parenthesized_ternary_stays_flat
    showcase_content_is_preserved

test result: FAILED. 44 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
