*** src/reflow.rs:454:13: replace && with || in structure

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in structure
@@ -446,17 +446,17 @@
             i = close + 1;
             continue;
         }
 
         // An initializer brace: in an `= ... ;` region, a `{` that is not a statement-expression.
         if in_init
             && t.kind == TokenKind::Punct
             && t.text == "{"
-            && last_nonspace_char(&out) != Some('(')
+            || /* ~ changed by cargo-mutants ~ */ last_nonspace_char(&out) != Some('(')
             && match_brace(toks, i).is_some()
         {
             i = emit_brace(toks, i, false, &mut out, &mut col, width);
             continue;
         }
 
         if t.kind == TokenKind::Punct {
             match t.text {

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (583454) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: "struct s {int x: 2;};\n"
 right: "struct s {\n\tint x: 2;\n};\n"

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (583455) panicked at tests/conformance.rs:339:5:
assertion `left == right` failed
  left: "void f(void) {int a; int b;}\n"
 right: "void f(void) {\n\tint a;\n\n\tint b;\n}\n"

---- control_headers_are_not_calls stdout ----

thread 'control_headers_are_not_calls' (583477) panicked at tests/conformance.rs:153:5:
assertion `left == right` failed
  left: "if (a && b) {return f(x);}\n"
 right: "if (a && b) { return f(x); }\n"

failures:
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    control_headers_are_not_calls
    control_keyword_gets_one_space_before_paren
    for_header_is_not_treated_as_a_call
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    indentation_is_normalized_to_tabs
    long_for_header_explodes_one_clause_per_line
    long_if_condition_explodes_with_trailing_operators
    short_control_headers_unchanged

test result: FAILED. 40 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
