*** src/reflow.rs:464:57: replace - with + in structure

*** mutation diff:
--- src/reflow.rs
+++ replace - with + in structure
@@ -456,17 +456,17 @@
         {
             i = emit_brace(toks, i, false, &mut out, &mut col, width);
             continue;
         }
 
         if t.kind == TokenKind::Punct {
             match t.text {
                 "(" | "[" => paren_depth += 1,
-                ")" | "]" => paren_depth = (paren_depth - 1).max(0),
+                ")" | "]" => paren_depth = (paren_depth + /* ~ changed by cargo-mutants ~ */ 1).max(0),
                 "=" if paren_depth == 0 => in_init = true,
                 ";" if paren_depth == 0 => in_init = false,
                 _ => {}
             }
         }
         emit_str(&mut out, &mut col, t.text);
         i += 1;
     }

---- collapses_initializer_without_trailing_comma stdout ----

thread 'collapses_initializer_without_trailing_comma' (939578) panicked at tests/conformance.rs:172:5:
assertion `left == right` failed
  left: "int v[] = {\n\t1,\n\t2,\n\t3\n};\n"
 right: "int v[] = {1, 2, 3};\n"

---- magic_trailing_comma_forces_explosion_with_trailing_comma stdout ----

thread 'magic_trailing_comma_forces_explosion_with_trailing_comma' (939606) panicked at tests/conformance.rs:166:5:
assertion `left == right` failed
  left: "int v[] = {1, 2, 3,};\n"
 right: "int v[] = {\n\t1,\n\t2,\n\t3,\n};\n"

---- nested_initializer_collapses_independently stdout ----

thread 'nested_initializer_collapses_independently' (939608) panicked at tests/conformance.rs:179:5:
assertion `left == right` failed
  left: "int m[2][3] = {{1, 2, 3}, {4, 5, 6},};\n"
 right: "int m[2][3] = {\n\t{1, 2, 3},\n\t{4, 5, 6},\n};\n"

failures:
    collapses_initializer_without_trailing_comma
    magic_trailing_comma_forces_explosion_with_trailing_comma
    nested_initializer_collapses_independently

test result: FAILED. 50 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
