*** src/reflow.rs:509:48: replace + with * in split_define

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in split_define
@@ -501,17 +501,17 @@
 
 /// Split a `#define` into its `#define NAME(params) ` prefix text and its body tokens (with
 /// continuation backslashes removed and surrounding trivia trimmed). `None` if it has no body.
 fn split_define<'src>(
     toks: &[Token<'src>],
     start: usize,
     end: usize,
 ) -> Option<(String, Vec<Token<'src>>)> {
-    let define = next_nontrivia_in(toks, start + 1, end)?;
+    let define = next_nontrivia_in(toks, start * /* ~ changed by cargo-mutants ~ */ 1, end)?;
     let name = next_nontrivia_in(toks, define + 1, end)?;
     let prefix_end = match toks.get(name + 1) {
         Some(n) if n.kind == TokenKind::Punct && n.text == "(" => {
             match_bracket(toks, name + 1)? + 1
         }
         _ => name + 1,
     };
     let prefix: String = toks[start..prefix_end]

---- function_like_macro_body_opens_on_define_line stdout ----

thread 'function_like_macro_body_opens_on_define_line' (598688) panicked at tests/conformance.rs:410:5:
assertion `left == right` failed
  left: "#define DISPATCH_EVENT(handler, event) dispatch_incoming_event((handler), (event), read_monotonic_timestamp_ms(), current_execution_context_id())\n"
 right: "#define DISPATCH_EVENT(handler, event) dispatch_incoming_event( \\\n\t(handler), \\\n\t(event), \\\n\tread_monotonic_timestamp_ms(), \\\n\tcurrent_execution_context_id() \\\n)\n"

---- generic_macro_explodes_one_association_per_line stdout ----

thread 'generic_macro_explodes_one_association_per_line' (598690) panicked at tests/conformance.rs:425:5:
assertion `left == right` failed
  left: "#define type_name(x) _Generic((x), int: \"int\", long: \"long\", float: \"float\", double: \"double\", default: \"other\")\n"
 right: "#define type_name(x) _Generic( \\\n\t(x), \\\n\tint: \"int\", \\\n\tlong: \"long\", \\\n\tfloat: \"float\", \\\n\tdouble: \"double\", \\\n\tdefault: \"other\" \\\n)\n"

---- statement_expression_macro_blocks_with_continuations stdout ----

thread 'statement_expression_macro_blocks_with_continuations' (598734) panicked at tests/conformance.rs:418:5:
assertion `left == right` failed
  left: "#define MAX(a, b) ({ typeof(a) _a = (a); typeof(b) _b = (b); _a > _b ? _a : _b; })\n"
 right: "#define MAX(a, b) ({ \\\n\ttypeof(a) _a = (a); \\\n\ttypeof(b) _b = (b); \\\n\t_a > _b ? _a : _b; \\\n})\n"

failures:
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    statement_expression_macro_blocks_with_continuations

test result: FAILED. 48 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
