*** src/reflow.rs:515:19: replace + with * in split_define

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in split_define
@@ -507,17 +507,17 @@
     end: usize,
 ) -> Option<(String, Vec<Token<'src>>)> {
     let define = next_nontrivia_in(toks, start + 1, end)?;
     let name = next_nontrivia_in(toks, define + 1, end)?;
     let prefix_end = match toks.get(name + 1) {
         Some(n) if n.kind == TokenKind::Punct && n.text == "(" => {
             match_bracket(toks, name + 1)? + 1
         }
-        _ => name + 1,
+        _ => name * /* ~ changed by cargo-mutants ~ */ 1,
     };
     let prefix: String = toks[start..prefix_end]
         .iter()
         .map(|t| t.text)
         .collect::<String>()
         + " ";
     let mut body: Vec<Token> = toks[prefix_end..end]
         .iter()

*** result: Success
