*** src/reflow.rs:53:5: replace collapse_blank_lines -> String with "xyzzy".into()

*** mutation diff:
--- src/reflow.rs
+++ replace collapse_blank_lines -> String with "xyzzy".into()
@@ -45,45 +45,17 @@
         width,
     ))))
 }
 
 /// Collapse runs of two or more blank lines to a single blank line everywhere (file scope and
 /// function bodies). Never inserts a blank line, so grouped declarations and adjacent closers are
 /// preserved. Comment interiors are untouched — their newlines live inside one comment token.
 fn collapse_blank_lines(s: &str) -> String {
-    let mut out = String::with_capacity(s.len());
-    let mut line = String::new();
-    let mut has_content = false;
-    let mut blank_run = 0usize;
-    for t in tokenize(s) {
-        match t.kind {
-            TokenKind::Newline => {
-                if has_content {
-                    out.push_str(&line);
-                    out.push('\n');
-                    blank_run = 0;
-                } else {
-                    blank_run += 1;
-                    if blank_run <= 1 {
-                        out.push('\n');
-                    }
-                }
-                line.clear();
-                has_content = false;
-            }
-            TokenKind::Whitespace => line.push_str(t.text),
-            _ => {
-                line.push_str(t.text);
-                has_content = true;
-            }
-        }
-    }
-    out.push_str(&line);
-    out
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// A C type keyword or qualifier — a token after which a `*` is confidently a pointer declarator,
 /// not a multiply. User typedefs (idents) are excluded, so ambiguous `a*b`/`foo*p` pass through
 /// (§2.5 pointers, §6 "prefer passthrough when ambiguous").
 fn is_type_context(text: &str) -> bool {
     matches!(
         text,

---- ambiguous_star_is_left_alone stdout ----

thread 'ambiguous_star_is_left_alone' (461465) panicked at tests/conformance.rs:242:5:
assertion `left == right` failed
  left: "xyzzy\n"
 right: "z = a*b;\n"

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (461467) panicked at tests/conformance.rs:337:5:
assertion `left == right` failed
  left: "xyzzy\n"
 right: "int a;\n\nint b;\n"

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (461466) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: "xyzzy\n"
 right: "struct s {\n\tint x: 2;\n};\n"

failures:
    ambiguous_star_is_left_alone
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    block_comment_internals_are_untouched
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes

test result: FAILED. 2 passed; 49 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
