*** src/reflow.rs:541:5: replace format_define_body -> Option<String> with None

*** mutation diff:
--- src/reflow.rs
+++ replace format_define_body -> Option<String> with None
@@ -533,31 +533,17 @@
     if body.is_empty() {
         return None;
     }
     Some((prefix, body))
 }
 
 /// Format a macro body if it is a single call/`_Generic` or a statement-expression; else `None`.
 fn format_define_body(body: &[Token], prefix_col: usize, width: usize) -> Option<String> {
-    if contains_comment(body) {
-        return None;
-    }
-    if is_call_head(body, 0) && match_bracket(body, 1) == Some(body.len() - 1) {
-        return Some(structure(body, prefix_col, width));
-    }
-    if body.len() >= 2
-        && body[0].kind == TokenKind::Punct
-        && body[0].text == "("
-        && body[1].kind == TokenKind::Punct
-        && body[1].text == "{"
-    {
-        return format_stmt_expr(body, 0, 0).map(|(s, _)| s);
-    }
-    None
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Format a `({ ... })` statement-expression: `({` opens the line, each statement on its own line
 /// at `base_level + 1`, `})` at `base_level`. Returns the block and the index past the `)`, or
 /// `None` if the braces are unbalanced or a statement nests a block or carries a comment.
 fn format_stmt_expr(toks: &[Token], open: usize, base_level: usize) -> Option<(String, usize)> {
     let paren_close = match_bracket(toks, open)?;
     let brace_close = match_brace(toks, open + 1)?;

---- function_like_macro_body_opens_on_define_line stdout ----

thread 'function_like_macro_body_opens_on_define_line' (609045) panicked at tests/conformance.rs:410:5:
assertion `left == right` failed
  left: "#define DISPATCH_EVENT(handler, event) dispatch_incoming_event((handler), (event), read_monotonic_timestamp_ms(), current_execution_context_id())\n"
 right: "#define DISPATCH_EVENT(handler, event) dispatch_incoming_event( \\\n\t(handler), \\\n\t(event), \\\n\tread_monotonic_timestamp_ms(), \\\n\tcurrent_execution_context_id() \\\n)\n"

---- generic_macro_explodes_one_association_per_line stdout ----

thread 'generic_macro_explodes_one_association_per_line' (609047) panicked at tests/conformance.rs:425:5:
assertion `left == right` failed
  left: "#define type_name(x) _Generic((x), int: \"int\", long: \"long\", float: \"float\", double: \"double\", default: \"other\")\n"
 right: "#define type_name(x) _Generic( \\\n\t(x), \\\n\tint: \"int\", \\\n\tlong: \"long\", \\\n\tfloat: \"float\", \\\n\tdouble: \"double\", \\\n\tdefault: \"other\" \\\n)\n"

---- statement_expression_macro_blocks_with_continuations stdout ----

thread 'statement_expression_macro_blocks_with_continuations' (609071) panicked at tests/conformance.rs:418:5:
assertion `left == right` failed
  left: "#define MAX(a, b) ({ typeof(a) _a = (a); typeof(b) _b = (b); _a > _b ? _a : _b; })\n"
 right: "#define MAX(a, b) ({ \\\n\ttypeof(a) _a = (a); \\\n\ttypeof(b) _b = (b); \\\n\t_a > _b ? _a : _b; \\\n})\n"

failures:
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    statement_expression_macro_blocks_with_continuations

test result: FAILED. 48 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
