*** src/reflow.rs:541:5: replace format_define_body -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- src/reflow.rs
+++ replace format_define_body -> Option<String> with Some("xyzzy".into())
@@ -533,31 +533,17 @@
     if body.is_empty() {
         return None;
     }
     Some((prefix, body))
 }
 
 /// Format a macro body if it is a single call/`_Generic` or a statement-expression; else `None`.
 fn format_define_body(body: &[Token], prefix_col: usize, width: usize) -> Option<String> {
-    if contains_comment(body) {
-        return None;
-    }
-    if is_call_head(body, 0) && match_bracket(body, 1) == Some(body.len() - 1) {
-        return Some(structure(body, prefix_col, width));
-    }
-    if body.len() >= 2
-        && body[0].kind == TokenKind::Punct
-        && body[0].text == "("
-        && body[1].kind == TokenKind::Punct
-        && body[1].text == "{"
-    {
-        return format_stmt_expr(body, 0, 0).map(|(s, _)| s);
-    }
-    None
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Format a `({ ... })` statement-expression: `({` opens the line, each statement on its own line
 /// at `base_level + 1`, `})` at `base_level`. Returns the block and the index past the `)`, or
 /// `None` if the braces are unbalanced or a statement nests a block or carries a comment.
 fn format_stmt_expr(toks: &[Token], open: usize, base_level: usize) -> Option<(String, usize)> {
     let paren_close = match_bracket(toks, open)?;
     let brace_close = match_brace(toks, open + 1)?;

---- do_while_macro_passes_through stdout ----

thread 'do_while_macro_passes_through' (956897) panicked at tests/conformance.rs:455:5:
assertion `left == right` failed: do/while macro bodies are not yet structured
  left: "#define SWAP(a, b) xyzzy\n"
 right: "#define SWAP(a, b) \\\n\tdo { \\\n\t\tint t = a; \\\n\t} while (0)\n"

---- function_like_macro_body_opens_on_define_line stdout ----

thread 'function_like_macro_body_opens_on_define_line' (956902) panicked at tests/conformance.rs:425:5:
assertion `left == right` failed
  left: "#define DISPATCH_EVENT(handler, event) xyzzy\n"
 right: "#define DISPATCH_EVENT(handler, event) dispatch_incoming_event( \\\n\t(handler), \\\n\t(event), \\\n\tread_monotonic_timestamp_ms(), \\\n\tcurrent_execution_context_id() \\\n)\n"

---- generic_macro_explodes_one_association_per_line stdout ----

thread 'generic_macro_explodes_one_association_per_line' (956904) panicked at tests/conformance.rs:440:5:
assertion `left == right` failed
  left: "#define type_name(x) xyzzy\n"
 right: "#define type_name(x) _Generic( \\\n\t(x), \\\n\tint: \"int\", \\\n\tlong: \"long\", \\\n\tfloat: \"float\", \\\n\tdouble: \"double\", \\\n\tdefault: \"other\" \\\n)\n"

failures:
    do_while_macro_passes_through
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    messy_real_world_input_is_idempotent_and_safe
    passthrough_for_call_free_input
    short_object_macro_unchanged
    showcase_content_is_preserved
    statement_expression_macro_blocks_with_continuations

test result: FAILED. 43 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
