*** src/reflow.rs:547:19: replace >= with < in format_define_body

*** mutation diff:
--- src/reflow.rs
+++ replace >= with < in format_define_body
@@ -539,17 +539,17 @@
 /// Format a macro body if it is a single call/`_Generic` or a statement-expression; else `None`.
 fn format_define_body(body: &[Token], prefix_col: usize, width: usize) -> Option<String> {
     if contains_comment(body) {
         return None;
     }
     if is_call_head(body, 0) && match_bracket(body, 1) == Some(body.len() - 1) {
         return Some(structure(body, prefix_col, width));
     }
-    if body.len() >= 2
+    if body.len() < /* ~ changed by cargo-mutants ~ */ 2
         && body[0].kind == TokenKind::Punct
         && body[0].text == "("
         && body[1].kind == TokenKind::Punct
         && body[1].text == "{"
     {
         return format_stmt_expr(body, 0, 0).map(|(s, _)| s);
     }
     None

---- statement_expression_macro_blocks_with_continuations stdout ----

thread 'statement_expression_macro_blocks_with_continuations' (614598) panicked at tests/conformance.rs:418:5:
assertion `left == right` failed
  left: "#define MAX(a, b) ({ typeof(a) _a = (a); typeof(b) _b = (b); _a > _b ? _a : _b; })\n"
 right: "#define MAX(a, b) ({ \\\n\ttypeof(a) _a = (a); \\\n\ttypeof(b) _b = (b); \\\n\t_a > _b ? _a : _b; \\\n})\n"

failures:
    statement_expression_macro_blocks_with_continuations

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
