*** src/reflow.rs:548:9: replace && with || in format_define_body

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in format_define_body
@@ -540,17 +540,17 @@
 fn format_define_body(body: &[Token], prefix_col: usize, width: usize) -> Option<String> {
     if contains_comment(body) {
         return None;
     }
     if is_call_head(body, 0) && match_bracket(body, 1) == Some(body.len() - 1) {
         return Some(structure(body, prefix_col, width));
     }
     if body.len() >= 2
-        && body[0].kind == TokenKind::Punct
+        || /* ~ changed by cargo-mutants ~ */ body[0].kind == TokenKind::Punct
         && body[0].text == "("
         && body[1].kind == TokenKind::Punct
         && body[1].text == "{"
     {
         return format_stmt_expr(body, 0, 0).map(|(s, _)| s);
     }
     None
 }

*** result: Success
