*** src/reflow.rs:549:9: replace && with || in format_define_body

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in format_define_body
@@ -541,17 +541,17 @@
     if contains_comment(body) {
         return None;
     }
     if is_call_head(body, 0) && match_bracket(body, 1) == Some(body.len() - 1) {
         return Some(structure(body, prefix_col, width));
     }
     if body.len() >= 2
         && body[0].kind == TokenKind::Punct
-        && body[0].text == "("
+        || /* ~ changed by cargo-mutants ~ */ body[0].text == "("
         && body[1].kind == TokenKind::Punct
         && body[1].text == "{"
     {
         return format_stmt_expr(body, 0, 0).map(|(s, _)| s);
     }
     None
 }

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
proptest: Saving this and future failures in /tmp/cargo-mutants-c-format-f441Qi.tmp/tests/properties.proptest-regressions
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file.
cc b666b25384688ce1d24b3ccf62f066e9f2affaf28ffc6685b62f89ee203563be

thread 'format_is_idempotent' (613171) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"''\n0_ a#aa(\n\t*&0_a&a0 *\n)\"a.0aA0 a&A&aa\n A_a0  0a&Aa0.\t_ 0.A Aa.0a0a.aA \t&_a0 0&\"\t0Aa.\".00]A0\n]A&\n"`,
 right: `"''\n0_ a#aa(*&0_a&a0 *)\"a.0aA0 a&A&aa\n A_a0  0a&Aa0.\t_ 0.A Aa.0a0a.aA \t&_a0 0&\"\t0Aa.\".00]A0\n]A&\n"` at test

failures:
    format_is_idempotent

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
