*** src/reflow.rs:550:9: replace && with || in format_define_body

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in format_define_body
@@ -542,17 +542,17 @@
         return None;
     }
     if is_call_head(body, 0) && match_bracket(body, 1) == Some(body.len() - 1) {
         return Some(structure(body, prefix_col, width));
     }
     if body.len() >= 2
         && body[0].kind == TokenKind::Punct
         && body[0].text == "("
-        && body[1].kind == TokenKind::Punct
+        || /* ~ changed by cargo-mutants ~ */ body[1].kind == TokenKind::Punct
         && body[1].text == "{"
     {
         return format_stmt_expr(body, 0, 0).map(|(s, _)| s);
     }
     None
 }
 
 /// Format a `({ ... })` statement-expression: `({` opens the line, each statement on its own line

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (960076) panicked at src/reflow.rs:550:47:
index out of bounds: the len is 1 but the index is 1

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (960078) panicked at src/reflow.rs:550:47:
index out of bounds: the len is 1 but the index is 1

---- idempotent_on_showcase stdout ----

thread 'idempotent_on_showcase' (960079) panicked at src/reflow.rs:550:47:
index out of bounds: the len is 1 but the index is 1

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    short_object_macro_unchanged
    showcase_content_is_preserved

test result: FAILED. 48 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
