*** src/reflow.rs:562:5: replace format_stmt_expr -> Option<(String, usize)> with None

*** mutation diff:
--- src/reflow.rs
+++ replace format_stmt_expr -> Option<(String, usize)> with None
@@ -554,48 +554,17 @@
     }
     None
 }
 
 /// Format a `({ ... })` statement-expression: `({` opens the line, each statement on its own line
 /// at `base_level + 1`, `})` at `base_level`. Returns the block and the index past the `)`, or
 /// `None` if the braces are unbalanced or a statement nests a block or carries a comment.
 fn format_stmt_expr(toks: &[Token], open: usize, base_level: usize) -> Option<(String, usize)> {
-    let paren_close = match_bracket(toks, open)?;
-    let brace_close = match_brace(toks, open + 1)?;
-    let inner = &toks[open + 2..brace_close];
-    let unformattable = inner.iter().any(|t| {
-        (t.kind == TokenKind::Punct && t.text == "{")
-            || matches!(t.kind, TokenKind::LineComment | TokenKind::BlockComment)
-    });
-    if unformattable || !is_balanced(inner) {
-        return None;
-    }
-    let statements: Vec<String> =
-        split_top_level(inner, |t| t.kind == TokenKind::Punct && t.text == ";")
-            .iter()
-            .map(|s| render_segment(s))
-            .filter(|s| !s.is_empty())
-            .collect();
-    if statements.is_empty() {
-        return None;
-    }
-    let inner_indent = "\t".repeat(base_level + 1);
-    let close_indent = "\t".repeat(base_level);
-    let mut s = String::from("({");
-    for statement in &statements {
-        s.push('\n');
-        s.push_str(&inner_indent);
-        s.push_str(statement);
-        s.push(';');
-    }
-    s.push('\n');
-    s.push_str(&close_indent);
-    s.push_str("})");
-    Some((s, paren_close + 1))
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Format the `{...}` opening at `open` (an initializer when `padded` is false, an enum body when
 /// true) and return the index just past its `}`. Falls back to verbatim if the braces are
 /// unbalanced or the list contains a comment or directive (deferred to M7).
 fn emit_brace(
     toks: &[Token],
     open: usize,

---- statement_expression_in_code_block_indents stdout ----

thread 'statement_expression_in_code_block_indents' (616866) panicked at tests/conformance.rs:451:5:
assertion `left == right` failed
  left: "int d = ({ int t = larger; t * 2; });\n"
 right: "int d = ({\n\tint t = larger;\n\tt * 2;\n});\n"

---- statement_expression_macro_blocks_with_continuations stdout ----

thread 'statement_expression_macro_blocks_with_continuations' (616868) panicked at tests/conformance.rs:418:5:
assertion `left == right` failed
  left: "#define MAX(a, b) ({ typeof(a) _a = (a); typeof(b) _b = (b); _a > _b ? _a : _b; })\n"
 right: "#define MAX(a, b) ({ \\\n\ttypeof(a) _a = (a); \\\n\ttypeof(b) _b = (b); \\\n\t_a > _b ? _a : _b; \\\n})\n"

failures:
    statement_expression_in_code_block_indents
    statement_expression_macro_blocks_with_continuations

test result: FAILED. 49 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
