*** src/reflow.rs:564:28: replace + with - in format_stmt_expr

*** mutation diff:
--- src/reflow.rs
+++ replace + with - in format_stmt_expr
@@ -556,17 +556,17 @@
 }
 
 /// Format a `({ ... })` statement-expression: `({` opens the line, each statement on its own line
 /// at `base_level + 1`, `})` at `base_level`. Returns the block and the index past the `)`, or
 /// `None` if the braces are unbalanced or a statement nests a block or carries a comment.
 fn format_stmt_expr(toks: &[Token], open: usize, base_level: usize) -> Option<(String, usize)> {
     let paren_close = match_bracket(toks, open)?;
     let brace_close = match_brace(toks, open + 1)?;
-    let inner = &toks[open + 2..brace_close];
+    let inner = &toks[open - /* ~ changed by cargo-mutants ~ */ 2..brace_close];
     let unformattable = inner.iter().any(|t| {
         (t.kind == TokenKind::Punct && t.text == "{")
             || matches!(t.kind, TokenKind::LineComment | TokenKind::BlockComment)
     });
     if unformattable || !is_balanced(inner) {
         return None;
     }
     let statements: Vec<String> =

---- statement_expression_in_code_block_indents stdout ----

thread 'statement_expression_in_code_block_indents' (968208) panicked at tests/conformance.rs:466:5:
assertion `left == right` failed
  left: "int d = ({ int t = larger; t * 2; });\n"
 right: "int d = ({\n\tint t = larger;\n\tt * 2;\n});\n"

---- statement_expression_macro_blocks_with_continuations stdout ----

thread 'statement_expression_macro_blocks_with_continuations' (968209) panicked at src/reflow.rs:564:23:
attempt to subtract with overflow

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (968179) panicked at src/reflow.rs:564:23:
attempt to subtract with overflow

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    showcase_content_is_preserved
    statement_expression_in_code_block_indents
    statement_expression_macro_blocks_with_continuations

test result: FAILED. 47 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
