*** src/reflow.rs:569:25: delete ! in format_stmt_expr

*** mutation diff:
--- src/reflow.rs
+++ delete ! in format_stmt_expr
@@ -561,17 +561,17 @@
 fn format_stmt_expr(toks: &[Token], open: usize, base_level: usize) -> Option<(String, usize)> {
     let paren_close = match_bracket(toks, open)?;
     let brace_close = match_brace(toks, open + 1)?;
     let inner = &toks[open + 2..brace_close];
     let unformattable = inner.iter().any(|t| {
         (t.kind == TokenKind::Punct && t.text == "{")
             || matches!(t.kind, TokenKind::LineComment | TokenKind::BlockComment)
     });
-    if unformattable || !is_balanced(inner) {
+    if unformattable ||  /* ~ changed by cargo-mutants ~ */is_balanced(inner) {
         return None;
     }
     let statements: Vec<String> =
         split_top_level(inner, |t| t.kind == TokenKind::Punct && t.text == ";")
             .iter()
             .map(|s| render_segment(s))
             .filter(|s| !s.is_empty())
             .collect();

---- statement_expression_in_code_block_indents stdout ----

thread 'statement_expression_in_code_block_indents' (972224) panicked at tests/conformance.rs:466:5:
assertion `left == right` failed
  left: "int d = ({ int t = larger; t * 2; });\n"
 right: "int d = ({\n\tint t = larger;\n\tt * 2;\n});\n"

---- statement_expression_macro_blocks_with_continuations stdout ----

thread 'statement_expression_macro_blocks_with_continuations' (972225) panicked at tests/conformance.rs:433:5:
assertion `left == right` failed
  left: "#define MAX(a, b) ({ typeof(a) _a = (a); typeof(b) _b = (b); _a > _b ? _a : _b; })\n"
 right: "#define MAX(a, b) ({ \\\n\ttypeof(a) _a = (a); \\\n\ttypeof(b) _b = (b); \\\n\t_a > _b ? _a : _b; \\\n})\n"

failures:
    statement_expression_in_code_block_indents
    statement_expression_macro_blocks_with_continuations

test result: FAILED. 51 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
