*** src/reflow.rs:576:25: delete ! in format_stmt_expr

*** mutation diff:
--- src/reflow.rs
+++ delete ! in format_stmt_expr
@@ -568,17 +568,17 @@
     });
     if unformattable || !is_balanced(inner) {
         return None;
     }
     let statements: Vec<String> =
         split_top_level(inner, |t| t.kind == TokenKind::Punct && t.text == ";")
             .iter()
             .map(|s| render_segment(s))
-            .filter(|s| !s.is_empty())
+            .filter(|s|  /* ~ changed by cargo-mutants ~ */s.is_empty())
             .collect();
     if statements.is_empty() {
         return None;
     }
     let inner_indent = "\t".repeat(base_level + 1);
     let close_indent = "\t".repeat(base_level);
     let mut s = String::from("({");
     for statement in &statements {

---- messy_real_world_input_is_idempotent_and_safe stdout ----

thread 'messy_real_world_input_is_idempotent_and_safe' (974294) panicked at tests/conformance.rs:70:5:
assertion `left == right` failed: must be idempotent on messy input

---- statement_expression_in_code_block_indents stdout ----

thread 'statement_expression_in_code_block_indents' (974305) panicked at tests/conformance.rs:466:5:
assertion `left == right` failed
  left: "int d = ({\n\t;\n});\n"
 right: "int d = ({\n\tint t = larger;\n\tt * 2;\n});\n"

---- statement_expression_macro_blocks_with_continuations stdout ----

thread 'statement_expression_macro_blocks_with_continuations' (974306) panicked at tests/conformance.rs:433:5:
assertion `left == right` failed
  left: "#define MAX(a, b) ({ \\\n\t; \\\n})\n"
 right: "#define MAX(a, b) ({ \\\n\ttypeof(a) _a = (a); \\\n\ttypeof(b) _b = (b); \\\n\t_a > _b ? _a : _b; \\\n})\n"

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    messy_real_world_input_is_idempotent_and_safe
    showcase_content_is_preserved
    statement_expression_in_code_block_indents
    statement_expression_macro_blocks_with_continuations

test result: FAILED. 46 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
