*** src/reflow.rs:581:47: replace + with - in format_stmt_expr

*** mutation diff:
--- src/reflow.rs
+++ replace + with - in format_stmt_expr
@@ -573,17 +573,17 @@
         split_top_level(inner, |t| t.kind == TokenKind::Punct && t.text == ";")
             .iter()
             .map(|s| render_segment(s))
             .filter(|s| !s.is_empty())
             .collect();
     if statements.is_empty() {
         return None;
     }
-    let inner_indent = "\t".repeat(base_level + 1);
+    let inner_indent = "\t".repeat(base_level - /* ~ changed by cargo-mutants ~ */ 1);
     let close_indent = "\t".repeat(base_level);
     let mut s = String::from("({");
     for statement in &statements {
         s.push('\n');
         s.push_str(&inner_indent);
         s.push_str(statement);
         s.push(';');
     }

---- statement_expression_in_code_block_indents stdout ----

thread 'statement_expression_in_code_block_indents' (627065) panicked at src/reflow.rs:581:36:
attempt to subtract with overflow

---- statement_expression_macro_blocks_with_continuations stdout ----

thread 'statement_expression_macro_blocks_with_continuations' (627066) panicked at src/reflow.rs:581:36:
attempt to subtract with overflow

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (627044) panicked at src/reflow.rs:581:36:
attempt to subtract with overflow

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    showcase_content_is_preserved
    statement_expression_in_code_block_indents
    statement_expression_macro_blocks_with_continuations

test result: FAILED. 45 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
