*** src/reflow.rs:581:47: replace + with * in format_stmt_expr

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in format_stmt_expr
@@ -573,17 +573,17 @@
         split_top_level(inner, |t| t.kind == TokenKind::Punct && t.text == ";")
             .iter()
             .map(|s| render_segment(s))
             .filter(|s| !s.is_empty())
             .collect();
     if statements.is_empty() {
         return None;
     }
-    let inner_indent = "\t".repeat(base_level + 1);
+    let inner_indent = "\t".repeat(base_level * /* ~ changed by cargo-mutants ~ */ 1);
     let close_indent = "\t".repeat(base_level);
     let mut s = String::from("({");
     for statement in &statements {
         s.push('\n');
         s.push_str(&inner_indent);
         s.push_str(statement);
         s.push(';');
     }

---- statement_expression_in_code_block_indents stdout ----

thread 'statement_expression_in_code_block_indents' (974673) panicked at tests/conformance.rs:466:5:
assertion `left == right` failed
  left: "int d = ({\nint t = larger;\nt * 2;\n});\n"
 right: "int d = ({\n\tint t = larger;\n\tt * 2;\n});\n"

---- statement_expression_macro_blocks_with_continuations stdout ----

thread 'statement_expression_macro_blocks_with_continuations' (974674) panicked at tests/conformance.rs:433:5:
assertion `left == right` failed
  left: "#define MAX(a, b) ({ \\\ntypeof(a) _a = (a); \\\ntypeof(b) _b = (b); \\\n_a > _b ? _a : _b; \\\n})\n"
 right: "#define MAX(a, b) ({ \\\n\ttypeof(a) _a = (a); \\\n\ttypeof(b) _b = (b); \\\n\t_a > _b ? _a : _b; \\\n})\n"

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (974651) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    statement_expression_in_code_block_indents
    statement_expression_macro_blocks_with_continuations

test result: FAILED. 49 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
