*** src/reflow.rs:59:13: delete match arm TokenKind::Newline in collapse_blank_lines

*** mutation diff:
--- src/reflow.rs
+++ delete match arm TokenKind::Newline in collapse_blank_lines
@@ -51,30 +51,17 @@
 /// preserved. Comment interiors are untouched — their newlines live inside one comment token.
 fn collapse_blank_lines(s: &str) -> String {
     let mut out = String::with_capacity(s.len());
     let mut line = String::new();
     let mut has_content = false;
     let mut blank_run = 0usize;
     for t in tokenize(s) {
         match t.kind {
-            TokenKind::Newline => {
-                if has_content {
-                    out.push_str(&line);
-                    out.push('\n');
-                    blank_run = 0;
-                } else {
-                    blank_run += 1;
-                    if blank_run <= 1 {
-                        out.push('\n');
-                    }
-                }
-                line.clear();
-                has_content = false;
-            }
+             /* ~ changed by cargo-mutants ~ */
             TokenKind::Whitespace => line.push_str(t.text),
             _ => {
                 line.push_str(t.text);
                 has_content = true;
             }
         }
     }
     out.push_str(&line);

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (463148) panicked at tests/conformance.rs:337:5:
assertion `left == right` failed
  left: "int a;\n\n\nint b;\n"
 right: "int a;\n\nint b;\n"

failures:
    blank_line_runs_collapse_to_one_everywhere

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
