*** src/reflow.rs:607:5: replace emit_brace -> usize with 1

*** mutation diff:
--- src/reflow.rs
+++ replace emit_brace -> usize with 1
@@ -599,37 +599,17 @@
 fn emit_brace(
     toks: &[Token],
     open: usize,
     padded: bool,
     out: &mut String,
     col: &mut usize,
     width: usize,
 ) -> usize {
-    let Some(close) = match_brace(toks, open) else {
-        emit_str(out, col, toks[open].text);
-        return open + 1;
-    };
-    let inner = &toks[open + 1..close];
-    let has_comment_or_directive = inner.iter().any(|t| {
-        matches!(t.kind, TokenKind::LineComment | TokenKind::BlockComment)
-            || (t.kind == TokenKind::Punct && t.text == "#")
-    });
-    if has_comment_or_directive || !is_balanced(inner) {
-        for tok in &toks[open..=close] {
-            emit_str(out, col, tok.text);
-        }
-        return close + 1;
-    }
-    let base_level = current_line_indent_cols(out) / TAB_WIDTH;
-    let reserved = trailing_reserved(toks, close + 1);
-    let doc = build_brace_doc(inner, padded);
-    let rendered = render(&doc, width.saturating_sub(reserved), *col, base_level);
-    emit_str(out, col, &rendered);
-    close + 1
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Append `s` to `out`, tracking the display column (tabs count as [`TAB_WIDTH`]).
 fn emit_str(out: &mut String, col: &mut usize, s: &str) {
     for ch in s.chars() {
         match ch {
             '\n' => {
                 out.push('\n');

*** result: Timeout
