*** src/reflow.rs:614:24: replace == with != in emit_brace

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in emit_brace
@@ -606,17 +606,17 @@
 ) -> usize {
     let Some(close) = match_brace(toks, open) else {
         emit_str(out, col, toks[open].text);
         return open + 1;
     };
     let inner = &toks[open + 1..close];
     let has_comment_or_directive = inner.iter().any(|t| {
         matches!(t.kind, TokenKind::LineComment | TokenKind::BlockComment)
-            || (t.kind == TokenKind::Punct && t.text == "#")
+            || (t.kind != /* ~ changed by cargo-mutants ~ */ TokenKind::Punct && t.text == "#")
     });
     if has_comment_or_directive || !is_balanced(inner) {
         for tok in &toks[open..=close] {
             emit_str(out, col, tok.text);
         }
         return close + 1;
     }
     let base_level = current_line_indent_cols(out) / TAB_WIDTH;

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (633006) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (633004) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 49 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
