*** src/reflow.rs:614:54: replace == with != in emit_brace

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in emit_brace
@@ -606,17 +606,17 @@
 ) -> usize {
     let Some(close) = match_brace(toks, open) else {
         emit_str(out, col, toks[open].text);
         return open + 1;
     };
     let inner = &toks[open + 1..close];
     let has_comment_or_directive = inner.iter().any(|t| {
         matches!(t.kind, TokenKind::LineComment | TokenKind::BlockComment)
-            || (t.kind == TokenKind::Punct && t.text == "#")
+            || (t.kind == TokenKind::Punct && t.text != /* ~ changed by cargo-mutants ~ */ "#")
     });
     if has_comment_or_directive || !is_balanced(inner) {
         for tok in &toks[open..=close] {
             emit_str(out, col, tok.text);
         }
         return close + 1;
     }
     let base_level = current_line_indent_cols(out) / TAB_WIDTH;

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (980712) panicked at tests/conformance.rs:418:5:
assertion `left == right` failed
  left: "p = &(struct shape){.tag = R, .rect = {.w = 3, .h = 4},};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

---- enum_magic_comma_explodes stdout ----

thread 'enum_magic_comma_explodes' (980721) panicked at tests/conformance.rs:195:5:
assertion `left == right` failed
  left: "enum color { RED, GREEN, BLUE, };\n"
 right: "enum color {\n\tRED,\n\tGREEN,\n\tBLUE,\n};\n"

---- magic_trailing_comma_forces_explosion_with_trailing_comma stdout ----

thread 'magic_trailing_comma_forces_explosion_with_trailing_comma' (980737) panicked at tests/conformance.rs:166:5:
assertion `left == right` failed
  left: "int v[] = {1, 2, 3,};\n"
 right: "int v[] = {\n\t1,\n\t2,\n\t3,\n};\n"

failures:
    collapses_initializer_without_trailing_comma
    compound_literal_initializer_explodes
    enum_magic_comma_explodes
    magic_trailing_comma_forces_explosion_with_trailing_comma
    nested_initializer_collapses_independently

test result: FAILED. 48 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
