*** src/reflow.rs:616:33: replace || with && in emit_brace

*** mutation diff:
--- src/reflow.rs
+++ replace || with && in emit_brace
@@ -608,17 +608,17 @@
         emit_str(out, col, toks[open].text);
         return open + 1;
     };
     let inner = &toks[open + 1..close];
     let has_comment_or_directive = inner.iter().any(|t| {
         matches!(t.kind, TokenKind::LineComment | TokenKind::BlockComment)
             || (t.kind == TokenKind::Punct && t.text == "#")
     });
-    if has_comment_or_directive || !is_balanced(inner) {
+    if has_comment_or_directive && /* ~ changed by cargo-mutants ~ */ !is_balanced(inner) {
         for tok in &toks[open..=close] {
             emit_str(out, col, tok.text);
         }
         return close + 1;
     }
     let base_level = current_line_indent_cols(out) / TAB_WIDTH;
     let reserved = trailing_reserved(toks, close + 1);
     let doc = build_brace_doc(inner, padded);

---- initializer_with_comment_keeps_structure_but_retabs stdout ----

thread 'initializer_with_comment_keeps_structure_but_retabs' (981663) panicked at tests/conformance.rs:203:5:
assertion `left == right` failed
  left: "int v[] = {\n\t1,\n\t/* one */ 2,\n};\n"
 right: "int v[] = {\n\t1, /* one */\n\t2,\n};\n"

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (981658) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (981660) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    initializer_with_comment_keeps_structure_but_retabs

test result: FAILED. 50 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
