*** src/reflow.rs:616:36: delete ! in emit_brace

*** mutation diff:
--- src/reflow.rs
+++ delete ! in emit_brace
@@ -608,17 +608,17 @@
         emit_str(out, col, toks[open].text);
         return open + 1;
     };
     let inner = &toks[open + 1..close];
     let has_comment_or_directive = inner.iter().any(|t| {
         matches!(t.kind, TokenKind::LineComment | TokenKind::BlockComment)
             || (t.kind == TokenKind::Punct && t.text == "#")
     });
-    if has_comment_or_directive || !is_balanced(inner) {
+    if has_comment_or_directive ||  /* ~ changed by cargo-mutants ~ */is_balanced(inner) {
         for tok in &toks[open..=close] {
             emit_str(out, col, tok.text);
         }
         return close + 1;
     }
     let base_level = current_line_indent_cols(out) / TAB_WIDTH;
     let reserved = trailing_reserved(toks, close + 1);
     let doc = build_brace_doc(inner, padded);

---- enum_magic_comma_explodes stdout ----

thread 'enum_magic_comma_explodes' (981748) panicked at tests/conformance.rs:195:5:
assertion `left == right` failed
  left: "enum color { RED, GREEN, BLUE, };\n"
 right: "enum color {\n\tRED,\n\tGREEN,\n\tBLUE,\n};\n"

---- nested_initializer_collapses_independently stdout ----

thread 'nested_initializer_collapses_independently' (981766) panicked at tests/conformance.rs:179:5:
assertion `left == right` failed
  left: "int m[2][3] = {{1, 2, 3}, {4, 5, 6},};\n"
 right: "int m[2][3] = {\n\t{1, 2, 3},\n\t{4, 5, 6},\n};\n"

---- magic_trailing_comma_forces_explosion_with_trailing_comma stdout ----

thread 'magic_trailing_comma_forces_explosion_with_trailing_comma' (981764) panicked at tests/conformance.rs:166:5:
assertion `left == right` failed
  left: "int v[] = {1, 2, 3,};\n"
 right: "int v[] = {\n\t1,\n\t2,\n\t3,\n};\n"

failures:
    collapses_initializer_without_trailing_comma
    compound_literal_initializer_explodes
    enum_magic_comma_explodes
    magic_trailing_comma_forces_explosion_with_trailing_comma
    nested_initializer_collapses_independently

test result: FAILED. 48 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
