*** src/reflow.rs:622:52: replace / with % in emit_brace

*** mutation diff:
--- src/reflow.rs
+++ replace / with % in emit_brace
@@ -614,17 +614,17 @@
             || (t.kind == TokenKind::Punct && t.text == "#")
     });
     if has_comment_or_directive || !is_balanced(inner) {
         for tok in &toks[open..=close] {
             emit_str(out, col, tok.text);
         }
         return close + 1;
     }
-    let base_level = current_line_indent_cols(out) / TAB_WIDTH;
+    let base_level = current_line_indent_cols(out) % /* ~ changed by cargo-mutants ~ */ TAB_WIDTH;
     let reserved = trailing_reserved(toks, close + 1);
     let doc = build_brace_doc(inner, padded);
     let rendered = render(&doc, width.saturating_sub(reserved), *col, base_level);
     emit_str(out, col, &rendered);
     close + 1
 }
 
 /// Append `s` to `out`, tracking the display column (tabs count as [`TAB_WIDTH`]).

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (636202) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (636204) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 49 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
