*** src/reflow.rs:623:50: replace + with * in emit_brace

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in emit_brace
@@ -615,17 +615,17 @@
     });
     if has_comment_or_directive || !is_balanced(inner) {
         for tok in &toks[open..=close] {
             emit_str(out, col, tok.text);
         }
         return close + 1;
     }
     let base_level = current_line_indent_cols(out) / TAB_WIDTH;
-    let reserved = trailing_reserved(toks, close + 1);
+    let reserved = trailing_reserved(toks, close * /* ~ changed by cargo-mutants ~ */ 1);
     let doc = build_brace_doc(inner, padded);
     let rendered = render(&doc, width.saturating_sub(reserved), *col, base_level);
     emit_str(out, col, &rendered);
     close + 1
 }
 
 /// Append `s` to `out`, tracking the display column (tabs count as [`TAB_WIDTH`]).
 fn emit_str(out: &mut String, col: &mut usize, s: &str) {

*** result: Success
