*** src/reflow.rs:627:11: replace + with - in emit_brace

*** mutation diff:
--- src/reflow.rs
+++ replace + with - in emit_brace
@@ -619,17 +619,17 @@
         }
         return close + 1;
     }
     let base_level = current_line_indent_cols(out) / TAB_WIDTH;
     let reserved = trailing_reserved(toks, close + 1);
     let doc = build_brace_doc(inner, padded);
     let rendered = render(&doc, width.saturating_sub(reserved), *col, base_level);
     emit_str(out, col, &rendered);
-    close + 1
+    close - /* ~ changed by cargo-mutants ~ */ 1
 }
 
 /// Append `s` to `out`, tracking the display column (tabs count as [`TAB_WIDTH`]).
 fn emit_str(out: &mut String, col: &mut usize, s: &str) {
     for ch in s.chars() {
         match ch {
             '\n' => {
                 out.push('\n');

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (985773) panicked at tests/conformance.rs:418:5:
assertion `left == right` failed
  left: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n},};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

---- collapses_initializer_without_trailing_comma stdout ----

thread 'collapses_initializer_without_trailing_comma' (985770) panicked at tests/conformance.rs:172:5:
assertion `left == right` failed
  left: "int v[] = {1, 2, 3}\n};\n"
 right: "int v[] = {1, 2, 3};\n"

---- compound_literal_brace_stays_tight stdout ----

thread 'compound_literal_brace_stays_tight' (985772) panicked at tests/conformance.rs:282:5:
assertion `left == right` failed
  left: "p = &(struct shape){.x = 1}1};\n"
 right: "p = &(struct shape){.x = 1};\n"

failures:
    collapses_initializer_without_trailing_comma
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    enum_body_is_padded_when_flat
    enum_magic_comma_explodes
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    magic_trailing_comma_forces_explosion_with_trailing_comma
    messy_real_world_input_is_idempotent_and_safe
    nested_initializer_collapses_independently
    short_initializer_stays_flat_and_tight

test result: FAILED. 40 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
