*** src/reflow.rs:632:5: replace emit_str with ()

*** mutation diff:
--- src/reflow.rs
+++ replace emit_str with ()
@@ -624,32 +624,17 @@
     let doc = build_brace_doc(inner, padded);
     let rendered = render(&doc, width.saturating_sub(reserved), *col, base_level);
     emit_str(out, col, &rendered);
     close + 1
 }
 
 /// Append `s` to `out`, tracking the display column (tabs count as [`TAB_WIDTH`]).
 fn emit_str(out: &mut String, col: &mut usize, s: &str) {
-    for ch in s.chars() {
-        match ch {
-            '\n' => {
-                out.push('\n');
-                *col = 0;
-            }
-            '\t' => {
-                out.push('\t');
-                *col += TAB_WIDTH;
-            }
-            c => {
-                out.push(c);
-                *col += 1;
-            }
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// True when nothing but whitespace has been emitted on the current output line — so a `#` here
 /// begins a preprocessor directive.
 fn current_line_is_blank(out: &str) -> bool {
     out.rsplit('\n')
         .next()
         .is_none_or(|line| line.chars().all(|c| c == ' ' || c == '\t'))

---- ambiguous_star_is_left_alone stdout ----

thread 'ambiguous_star_is_left_alone' (986826) panicked at tests/conformance.rs:242:5:
assertion `left == right` failed
  left: ""
 right: "z = a*b;\n"

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (986827) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: ""
 right: "struct s {\n\tint x: 2;\n};\n"

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (986828) panicked at tests/conformance.rs:337:5:
assertion `left == right` failed
  left: ""
 right: "int a;\n\nint b;\n"

failures:
    ambiguous_star_is_left_alone
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    block_comment_internals_are_untouched
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes

test result: FAILED. 2 passed; 51 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
