*** src/reflow.rs:640:22: replace += with -= in emit_str

*** mutation diff:
--- src/reflow.rs
+++ replace += with -= in emit_str
@@ -632,17 +632,17 @@
     for ch in s.chars() {
         match ch {
             '\n' => {
                 out.push('\n');
                 *col = 0;
             }
             '\t' => {
                 out.push('\t');
-                *col += TAB_WIDTH;
+                *col -= /* ~ changed by cargo-mutants ~ */ TAB_WIDTH;
             }
             c => {
                 out.push(c);
                 *col += 1;
             }
         }
     }
 }

---- call_with_line_comment_passes_through stdout ----

thread 'call_with_line_comment_passes_through' (639865) panicked at src/reflow.rs:640:17:
attempt to subtract with overflow

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (639871) panicked at src/reflow.rs:640:17:
attempt to subtract with overflow

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (639869) panicked at src/reflow.rs:640:17:
attempt to subtract with overflow

failures:
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    call_with_line_comment_passes_through
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    declaration_with_brace_explodes_and_keeps_brace_attached
    do_while_macro_passes_through
    enum_magic_comma_explodes
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase

test result: FAILED. 26 passed; 25 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
