*** src/reflow.rs:640:22: replace += with *= in emit_str

*** mutation diff:
--- src/reflow.rs
+++ replace += with *= in emit_str
@@ -632,17 +632,17 @@
     for ch in s.chars() {
         match ch {
             '\n' => {
                 out.push('\n');
                 *col = 0;
             }
             '\t' => {
                 out.push('\t');
-                *col += TAB_WIDTH;
+                *col *= /* ~ changed by cargo-mutants ~ */ TAB_WIDTH;
             }
             c => {
                 out.push(c);
                 *col += 1;
             }
         }
     }
 }

---- messy_real_world_input_is_idempotent_and_safe stdout ----

thread 'messy_real_world_input_is_idempotent_and_safe' (988027) panicked at tests/conformance.rs:70:5:
assertion `left == right` failed: must be idempotent on messy input

failures:
    messy_real_world_input_is_idempotent_and_safe

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
