*** src/reflow.rs:644:22: replace += with -= in emit_str

*** mutation diff:
--- src/reflow.rs
+++ replace += with -= in emit_str
@@ -636,17 +636,17 @@
                 *col = 0;
             }
             '\t' => {
                 out.push('\t');
                 *col += TAB_WIDTH;
             }
             c => {
                 out.push(c);
-                *col += 1;
+                *col -= /* ~ changed by cargo-mutants ~ */ 1;
             }
         }
     }
 }
 
 /// True when nothing but whitespace has been emitted on the current output line — so a `#` here
 /// begins a preprocessor directive.
 fn current_line_is_blank(out: &str) -> bool {

---- block_comment_internals_are_untouched stdout ----

thread 'block_comment_internals_are_untouched' (988737) panicked at src/reflow.rs:644:17:
attempt to subtract with overflow

---- crlf_is_normalized_to_lf stdout ----

thread 'crlf_is_normalized_to_lf' (988750) panicked at src/reflow.rs:644:17:
attempt to subtract with overflow

---- generic_macro_explodes_one_association_per_line stdout ----

thread 'generic_macro_explodes_one_association_per_line' (988759) panicked at src/reflow.rs:644:17:
attempt to subtract with overflow

failures:
    ambiguous_star_is_left_alone
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    block_comment_internals_are_untouched
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes

test result: FAILED. 1 passed; 52 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
