*** src/reflow.rs:644:22: replace += with *= in emit_str

*** mutation diff:
--- src/reflow.rs
+++ replace += with *= in emit_str
@@ -636,17 +636,17 @@
                 *col = 0;
             }
             '\t' => {
                 out.push('\t');
                 *col += TAB_WIDTH;
             }
             c => {
                 out.push(c);
-                *col += 1;
+                *col *= /* ~ changed by cargo-mutants ~ */ 1;
             }
         }
     }
 }
 
 /// True when nothing but whitespace has been emitted on the current output line — so a `#` here
 /// begins a preprocessor directive.
 fn current_line_is_blank(out: &str) -> bool {

---- declaration_with_brace_explodes_and_keeps_brace_attached stdout ----

thread 'declaration_with_brace_explodes_and_keeps_brace_attached' (641359) panicked at tests/conformance.rs:479:5:
assertion `left == right` failed
  left: "static int do_something_with_a_long_name(int first_parameter, int second_parameter, int third_parameter) {\n"
 right: "static int do_something_with_a_long_name(\n\tint first_parameter,\n\tint second_parameter,\n\tint third_parameter\n) {\n"

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (641355) panicked at tests/conformance.rs:302:5:
assertion `left == right` failed
  left: "dispatch(&(struct request){.id = 1234567, .kind = KIND_READ}, &response_buffer_out, default_timeout_ms);\n"
 right: "dispatch(\n\t&(struct request){.id = 1234567, .kind = KIND_READ},\n\t&response_buffer_out,\n\tdefault_timeout_ms\n);\n"

---- long_call_explodes_one_per_line stdout ----

thread 'long_call_explodes_one_per_line' (641374) panicked at tests/conformance.rs:132:5:
assertion `left == right` failed
  left: "result = some_function_with_a_fairly_long_name(first_argument_value, second_argument_value, third_argument_value);\n"
 right: "result = some_function_with_a_fairly_long_name(\n\tfirst_argument_value,\n\tsecond_argument_value,\n\tthird_argument_value\n);\n"

failures:
    compound_literals_in_function_args
    declaration_with_brace_explodes_and_keeps_brace_attached
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    long_call_explodes_one_per_line
    messy_real_world_input_is_idempotent_and_safe

test result: FAILED. 45 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
