*** src/reflow.rs:655:63: replace == with != in current_line_is_blank

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in current_line_is_blank
@@ -647,17 +647,17 @@
     }
 }
 
 /// True when nothing but whitespace has been emitted on the current output line — so a `#` here
 /// begins a preprocessor directive.
 fn current_line_is_blank(out: &str) -> bool {
     out.rsplit('\n')
         .next()
-        .is_none_or(|line| line.chars().all(|c| c == ' ' || c == '\t'))
+        .is_none_or(|line| line.chars().all(|c| c == ' ' || c != /* ~ changed by cargo-mutants ~ */ '\t'))
 }
 
 /// Indentation, in columns, of the current output line.
 fn current_line_indent_cols(out: &str) -> usize {
     let line = out.rsplit('\n').next().unwrap_or(out);
     let mut cols = 0;
     for ch in line.chars() {
         match ch {

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (991541) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"(? *AA0 : #)\n"`,
 right: `"(\n\t? *AA0 :\n\t#\n)\n"` at tests/properties.rs:28.
minimal failing input: s = "(?\t*AA0:#)\t", width = 12
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    idempotent_across_widths

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
