*** src/reflow.rs:65:31: replace += with *= in collapse_blank_lines

*** mutation diff:
--- src/reflow.rs
+++ replace += with *= in collapse_blank_lines
@@ -57,17 +57,17 @@
     for t in tokenize(s) {
         match t.kind {
             TokenKind::Newline => {
                 if has_content {
                     out.push_str(&line);
                     out.push('\n');
                     blank_run = 0;
                 } else {
-                    blank_run += 1;
+                    blank_run *= /* ~ changed by cargo-mutants ~ */ 1;
                     if blank_run <= 1 {
                         out.push('\n');
                     }
                 }
                 line.clear();
                 has_content = false;
             }
             TokenKind::Whitespace => line.push_str(t.text),

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (463328) panicked at tests/conformance.rs:337:5:
assertion `left == right` failed
  left: "int a;\n\n\nint b;\n"
 right: "int a;\n\nint b;\n"

failures:
    blank_line_runs_collapse_to_one_everywhere

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
