*** src/reflow.rs:660:5: replace current_line_indent_cols -> usize with 1

*** mutation diff:
--- src/reflow.rs
+++ replace current_line_indent_cols -> usize with 1
@@ -652,26 +652,17 @@
 fn current_line_is_blank(out: &str) -> bool {
     out.rsplit('\n')
         .next()
         .is_none_or(|line| line.chars().all(|c| c == ' ' || c == '\t'))
 }
 
 /// Indentation, in columns, of the current output line.
 fn current_line_indent_cols(out: &str) -> usize {
-    let line = out.rsplit('\n').next().unwrap_or(out);
-    let mut cols = 0;
-    for ch in line.chars() {
-        match ch {
-            '\t' => cols += TAB_WIDTH,
-            ' ' => cols += 1,
-            _ => break,
-        }
-    }
-    cols
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// The last non-whitespace character emitted, used to tell a compound literal `){` from a
 /// statement-expression `({`.
 fn last_nonspace_char(out: &str) -> Option<char> {
     out.chars().rev().find(|c| !c.is_whitespace())
 }

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (645232) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (645230) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 49 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
