*** src/reflow.rs:664:26: replace += with -= in current_line_indent_cols

*** mutation diff:
--- src/reflow.rs
+++ replace += with -= in current_line_indent_cols
@@ -656,17 +656,17 @@
 }
 
 /// Indentation, in columns, of the current output line.
 fn current_line_indent_cols(out: &str) -> usize {
     let line = out.rsplit('\n').next().unwrap_or(out);
     let mut cols = 0;
     for ch in line.chars() {
         match ch {
-            '\t' => cols += TAB_WIDTH,
+            '\t' => cols -= /* ~ changed by cargo-mutants ~ */ TAB_WIDTH,
             ' ' => cols += 1,
             _ => break,
         }
     }
     cols
 }
 
 /// The last non-whitespace character emitted, used to tell a compound literal `){` from a

---- messy_real_world_input_is_idempotent_and_safe stdout ----

thread 'messy_real_world_input_is_idempotent_and_safe' (646296) panicked at src/reflow.rs:664:21:
attempt to subtract with overflow

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (646287) panicked at src/reflow.rs:664:21:
attempt to subtract with overflow

---- idempotent_on_showcase stdout ----

thread 'idempotent_on_showcase' (646288) panicked at src/reflow.rs:664:21:
attempt to subtract with overflow

failures:
    golden_is_a_fixpoint
    idempotent_on_showcase
    messy_real_world_input_is_idempotent_and_safe

test result: FAILED. 48 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
