*** src/reflow.rs:665:25: replace += with -= in current_line_indent_cols

*** mutation diff:
--- src/reflow.rs
+++ replace += with -= in current_line_indent_cols
@@ -657,17 +657,17 @@
 
 /// Indentation, in columns, of the current output line.
 fn current_line_indent_cols(out: &str) -> usize {
     let line = out.rsplit('\n').next().unwrap_or(out);
     let mut cols = 0;
     for ch in line.chars() {
         match ch {
             '\t' => cols += TAB_WIDTH,
-            ' ' => cols += 1,
+            ' ' => cols -= /* ~ changed by cargo-mutants ~ */ 1,
             _ => break,
         }
     }
     cols
 }
 
 /// The last non-whitespace character emitted, used to tell a compound literal `){` from a
 /// statement-expression `({`.

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (647316) panicked at src/reflow.rs:665:20:
attempt to subtract with overflow

---- messy_real_world_input_is_idempotent_and_safe stdout ----

thread 'messy_real_world_input_is_idempotent_and_safe' (647327) panicked at src/reflow.rs:665:20:
attempt to subtract with overflow

---- showcase_content_is_preserved stdout ----

thread 'showcase_content_is_preserved' (647337) panicked at src/reflow.rs:665:20:
attempt to subtract with overflow

failures:
    golden_acceptance_unguarded_showcase
    idempotent_on_showcase
    messy_real_world_input_is_idempotent_and_safe
    showcase_content_is_preserved

test result: FAILED. 47 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
