*** src/reflow.rs:665:25: replace += with *= in current_line_indent_cols

*** mutation diff:
--- src/reflow.rs
+++ replace += with *= in current_line_indent_cols
@@ -657,17 +657,17 @@
 
 /// Indentation, in columns, of the current output line.
 fn current_line_indent_cols(out: &str) -> usize {
     let line = out.rsplit('\n').next().unwrap_or(out);
     let mut cols = 0;
     for ch in line.chars() {
         match ch {
             '\t' => cols += TAB_WIDTH,
-            ' ' => cols += 1,
+            ' ' => cols *= /* ~ changed by cargo-mutants ~ */ 1,
             _ => break,
         }
     }
     cols
 }
 
 /// The last non-whitespace character emitted, used to tell a compound literal `){` from a
 /// statement-expression `({`.

---- messy_real_world_input_is_idempotent_and_safe stdout ----

thread 'messy_real_world_input_is_idempotent_and_safe' (648644) panicked at tests/conformance.rs:70:5:
assertion `left == right` failed: must be idempotent on messy input

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (648633) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

---- idempotent_on_showcase stdout ----

thread 'idempotent_on_showcase' (648636) panicked at tests/conformance.rs:31:5:
assertion `left == right` failed: format must be idempotent

failures:
    golden_acceptance_unguarded_showcase
    idempotent_on_showcase
    messy_real_world_input_is_idempotent_and_safe

test result: FAILED. 48 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
