*** src/reflow.rs:675:32: delete ! in last_nonspace_char

*** mutation diff:
--- src/reflow.rs
+++ delete ! in last_nonspace_char
@@ -667,17 +667,17 @@
         }
     }
     cols
 }
 
 /// The last non-whitespace character emitted, used to tell a compound literal `){` from a
 /// statement-expression `({`.
 fn last_nonspace_char(out: &str) -> Option<char> {
-    out.chars().rev().find(|c| !c.is_whitespace())
+    out.chars().rev().find(|c|  /* ~ changed by cargo-mutants ~ */c.is_whitespace())
 }
 
 /// An identifier immediately followed by `(` (no intervening whitespace) — a call or the
 /// structurally identical declaration parameter list, excluding control/operator keywords.
 fn is_call_head(toks: &[Token], i: usize) -> bool {
     toks.get(i).is_some_and(|t| t.kind == TokenKind::Ident)
         && !is_excluded_callee(toks[i].text)
         && toks

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (649822) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A(\n\t{\n\t\t\"\";,\n\t}\n)\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:28.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")", width = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (649820) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A({\"\";})\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:17.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")"
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
