*** src/reflow.rs:675:5: replace last_nonspace_char -> Option<char> with None

*** mutation diff:
--- src/reflow.rs
+++ replace last_nonspace_char -> Option<char> with None
@@ -667,17 +667,17 @@
         }
     }
     cols
 }
 
 /// The last non-whitespace character emitted, used to tell a compound literal `){` from a
 /// statement-expression `({`.
 fn last_nonspace_char(out: &str) -> Option<char> {
-    out.chars().rev().find(|c| !c.is_whitespace())
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// An identifier immediately followed by `(` (no intervening whitespace) — a call or the
 /// structurally identical declaration parameter list, excluding control/operator keywords.
 fn is_call_head(toks: &[Token], i: usize) -> bool {
     toks.get(i).is_some_and(|t| t.kind == TokenKind::Ident)
         && !is_excluded_callee(toks[i].text)
         && toks

*** result: Success
