*** src/reflow.rs:675:5: replace last_nonspace_char -> Option<char> with Some(Default::default())

*** mutation diff:
--- src/reflow.rs
+++ replace last_nonspace_char -> Option<char> with Some(Default::default())
@@ -667,17 +667,17 @@
         }
     }
     cols
 }
 
 /// The last non-whitespace character emitted, used to tell a compound literal `){` from a
 /// statement-expression `({`.
 fn last_nonspace_char(out: &str) -> Option<char> {
-    out.chars().rev().find(|c| !c.is_whitespace())
+    Some(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// An identifier immediately followed by `(` (no intervening whitespace) — a call or the
 /// structurally identical declaration parameter list, excluding control/operator keywords.
 fn is_call_head(toks: &[Token], i: usize) -> bool {
     toks.get(i).is_some_and(|t| t.kind == TokenKind::Ident)
         && !is_excluded_callee(toks[i].text)
         && toks

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (996868) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"(? *AA0 : #)\n"`,
 right: `"(\n\t? *AA0 :\n\t#\n)\n"` at tests/properties.rs:28.
minimal failing input: s = "(?\t*AA0:#)\t", width = 12
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    idempotent_across_widths

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
