*** src/reflow.rs:681:40: replace == with != in is_call_head

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in is_call_head
@@ -673,17 +673,17 @@
 /// statement-expression `({`.
 fn last_nonspace_char(out: &str) -> Option<char> {
     out.chars().rev().find(|c| !c.is_whitespace())
 }
 
 /// An identifier immediately followed by `(` (no intervening whitespace) — a call or the
 /// structurally identical declaration parameter list, excluding control/operator keywords.
 fn is_call_head(toks: &[Token], i: usize) -> bool {
-    toks.get(i).is_some_and(|t| t.kind == TokenKind::Ident)
+    toks.get(i).is_some_and(|t| t.kind != /* ~ changed by cargo-mutants ~ */ TokenKind::Ident)
         && !is_excluded_callee(toks[i].text)
         && toks
             .get(i + 1)
             .is_some_and(|n| n.kind == TokenKind::Punct && n.text == "(")
 }
 
 /// Keywords that take a `(` but are not calls whose arguments split on commas. `_Generic` is not
 /// excluded: its associations are a comma list and explode exactly per §2.2.

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (652892) panicked at tests/conformance.rs:137:5:
assertion `left == right` failed
  left: "foo(\n\ta,\n\tb\n);\n"
 right: "foo(a, b);\n"

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (652894) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(&(struct config){.alpha = 1111111111, .beta = 2222222222, .gamma = 3333333333, .delta = 4444444444});\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (652897) panicked at tests/conformance.rs:302:5:
assertion `left == right` failed
  left: "dispatch(&(struct request){.id = 1234567, .kind = KIND_READ}, &response_buffer_out, default_timeout_ms);\n"
 right: "dispatch(\n\t&(struct request){.id = 1234567, .kind = KIND_READ},\n\t&response_buffer_out,\n\tdefault_timeout_ms\n);\n"

failures:
    collapses_a_call_that_now_fits
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literals_in_function_args
    declaration_with_brace_explodes_and_keeps_brace_attached
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    long_call_explodes_one_per_line
    long_ternary_chain_explodes_flat_with_trailing_colons
    statement_expression_in_code_block_indents

test result: FAILED. 40 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
