*** src/reflow.rs:682:9: replace && with || in is_call_head

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in is_call_head
@@ -674,17 +674,17 @@
 fn last_nonspace_char(out: &str) -> Option<char> {
     out.chars().rev().find(|c| !c.is_whitespace())
 }
 
 /// An identifier immediately followed by `(` (no intervening whitespace) — a call or the
 /// structurally identical declaration parameter list, excluding control/operator keywords.
 fn is_call_head(toks: &[Token], i: usize) -> bool {
     toks.get(i).is_some_and(|t| t.kind == TokenKind::Ident)
-        && !is_excluded_callee(toks[i].text)
+        || /* ~ changed by cargo-mutants ~ */ !is_excluded_callee(toks[i].text)
         && toks
             .get(i + 1)
             .is_some_and(|n| n.kind == TokenKind::Punct && n.text == "(")
 }
 
 /// Keywords that take a `(` but are not calls whose arguments split on commas. `_Generic` is not
 /// excluded: its associations are a comma list and explode exactly per §2.2.
 fn is_excluded_callee(name: &str) -> bool {

---- collapses_initializer_without_trailing_comma stdout ----

thread 'collapses_initializer_without_trailing_comma' (999811) panicked at tests/conformance.rs:172:5:
assertion `left == right` failed
  left: "int v() = {1, 2, 3};\n"
 right: "int v[] = {1, 2, 3};\n"

---- initializer_with_comment_keeps_structure_but_retabs stdout ----

thread 'initializer_with_comment_keeps_structure_but_retabs' (999836) panicked at tests/conformance.rs:203:5:
assertion `left == right` failed
  left: "int v() = {\n\t1, /* one */\n\t2,\n};\n"
 right: "int v[] = {\n\t1, /* one */\n\t2,\n};\n"

---- long_ternary_chain_explodes_flat_with_trailing_colons stdout ----

thread 'long_ternary_chain_explodes_flat_with_trailing_colons' (999840) panicked at tests/conformance.rs:487:5:
assertion `left == right` failed
  left: "return (\n\tstatus_code == 0 ? \"ok\" : status_code == 1 ? \"busy\" : status_code == 2 ? \"error\" : status_code < 0 ? \"fault\" : \"unknown\"\n);\n"
 right: "return (\n\tstatus_code == 0 ? \"ok\" :\n\tstatus_code == 1 ? \"busy\" :\n\tstatus_code == 2 ? \"error\" :\n\tstatus_code < 0 ? \"fault\" :\n\t\"unknown\"\n);\n"

failures:
    collapses_initializer_without_trailing_comma
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    initializer_with_comment_keeps_structure_but_retabs
    long_ternary_chain_explodes_flat_with_trailing_colons
    magic_trailing_comma_forces_explosion_with_trailing_comma
    messy_real_world_input_is_idempotent_and_safe
    nested_initializer_collapses_independently
    short_initializer_stays_flat_and_tight
    showcase_content_is_preserved
    statement_expression_in_code_block_indents
    unbalanced_brackets_pass_through_verbatim

test result: FAILED. 41 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
