*** src/reflow.rs:684:20: replace + with - in is_call_head

*** mutation diff:
--- src/reflow.rs
+++ replace + with - in is_call_head
@@ -676,17 +676,17 @@
 }
 
 /// An identifier immediately followed by `(` (no intervening whitespace) — a call or the
 /// structurally identical declaration parameter list, excluding control/operator keywords.
 fn is_call_head(toks: &[Token], i: usize) -> bool {
     toks.get(i).is_some_and(|t| t.kind == TokenKind::Ident)
         && !is_excluded_callee(toks[i].text)
         && toks
-            .get(i + 1)
+            .get(i - /* ~ changed by cargo-mutants ~ */ 1)
             .is_some_and(|n| n.kind == TokenKind::Punct && n.text == "(")
 }
 
 /// Keywords that take a `(` but are not calls whose arguments split on commas. `_Generic` is not
 /// excluded: its associations are a comma list and explode exactly per §2.2.
 fn is_excluded_callee(name: &str) -> bool {
     matches!(
         name,

---- ambiguous_star_is_left_alone stdout ----

thread 'ambiguous_star_is_left_alone' (1001410) panicked at src/reflow.rs:684:18:
attempt to subtract with overflow

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (1001414) panicked at src/reflow.rs:684:18:
attempt to subtract with overflow

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (1001412) panicked at src/reflow.rs:684:18:
attempt to subtract with overflow

failures:
    ambiguous_star_is_left_alone
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args

test result: FAILED. 15 passed; 38 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
