*** src/reflow.rs:685:57: replace && with || in is_call_head

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in is_call_head
@@ -677,17 +677,17 @@
 
 /// An identifier immediately followed by `(` (no intervening whitespace) — a call or the
 /// structurally identical declaration parameter list, excluding control/operator keywords.
 fn is_call_head(toks: &[Token], i: usize) -> bool {
     toks.get(i).is_some_and(|t| t.kind == TokenKind::Ident)
         && !is_excluded_callee(toks[i].text)
         && toks
             .get(i + 1)
-            .is_some_and(|n| n.kind == TokenKind::Punct && n.text == "(")
+            .is_some_and(|n| n.kind == TokenKind::Punct || /* ~ changed by cargo-mutants ~ */ n.text == "(")
 }
 
 /// Keywords that take a `(` but are not calls whose arguments split on commas. `_Generic` is not
 /// excluded: its associations are a comma list and explode exactly per §2.2.
 fn is_excluded_callee(name: &str) -> bool {
     matches!(
         name,
         "if" | "for"

---- collapses_initializer_without_trailing_comma stdout ----

thread 'collapses_initializer_without_trailing_comma' (1002626) panicked at tests/conformance.rs:172:5:
assertion `left == right` failed
  left: "int v() = {1, 2, 3};\n"
 right: "int v[] = {1, 2, 3};\n"

---- initializer_with_comment_keeps_structure_but_retabs stdout ----

thread 'initializer_with_comment_keeps_structure_but_retabs' (1002656) panicked at tests/conformance.rs:203:5:
assertion `left == right` failed
  left: "int v() = {\n\t1, /* one */\n\t2,\n};\n"
 right: "int v[] = {\n\t1, /* one */\n\t2,\n};\n"

---- magic_trailing_comma_forces_explosion_with_trailing_comma stdout ----

thread 'magic_trailing_comma_forces_explosion_with_trailing_comma' (1002661) panicked at tests/conformance.rs:166:5:
assertion `left == right` failed
  left: "int v() = {\n\t1,\n\t2,\n\t3,\n};\n"
 right: "int v[] = {\n\t1,\n\t2,\n\t3,\n};\n"

failures:
    collapses_initializer_without_trailing_comma
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    initializer_with_comment_keeps_structure_but_retabs
    magic_trailing_comma_forces_explosion_with_trailing_comma
    messy_real_world_input_is_idempotent_and_safe
    nested_initializer_collapses_independently
    short_initializer_stays_flat_and_tight
    showcase_content_is_preserved
    unbalanced_brackets_pass_through_verbatim

test result: FAILED. 43 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
