*** src/reflow.rs:691:5: replace is_excluded_callee -> bool with true

*** mutation diff:
--- src/reflow.rs
+++ replace is_excluded_callee -> bool with true
@@ -683,40 +683,17 @@
         && toks
             .get(i + 1)
             .is_some_and(|n| n.kind == TokenKind::Punct && n.text == "(")
 }
 
 /// Keywords that take a `(` but are not calls whose arguments split on commas. `_Generic` is not
 /// excluded: its associations are a comma list and explode exactly per §2.2.
 fn is_excluded_callee(name: &str) -> bool {
-    matches!(
-        name,
-        "if" | "for"
-            | "while"
-            | "switch"
-            | "return"
-            | "do"
-            | "else"
-            | "sizeof"
-            | "alignof"
-            | "_Alignof"
-            | "alignas"
-            | "_Alignas"
-            | "typeof"
-            | "typeof_unqual"
-            | "defined"
-            | "static_assert"
-            | "_Static_assert"
-            | "__attribute__"
-            | "_Pragma"
-            | "asm"
-            | "__asm__"
-            | "__asm"
-    )
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// The `{` opening an `enum [tag] [: type] { ... }` body that begins at the `enum` keyword `i`,
 /// or `None` if this `enum` does not introduce a body (a forward declaration or a variable use).
 fn enum_body_brace(toks: &[Token], i: usize) -> Option<usize> {
     for (j, t) in toks.iter().enumerate().skip(i + 1) {
         match t.kind {
             TokenKind::Whitespace | TokenKind::Newline | TokenKind::Ident => {}

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (1004151) panicked at tests/conformance.rs:137:5:
assertion `left == right` failed
  left: "foo(\n\ta,\n\tb\n);\n"
 right: "foo(a, b);\n"

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (1004153) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(&(struct config){.alpha = 1111111111, .beta = 2222222222, .gamma = 3333333333, .delta = 4444444444});\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (1004156) panicked at tests/conformance.rs:302:5:
assertion `left == right` failed
  left: "dispatch(&(struct request){.id = 1234567, .kind = KIND_READ}, &response_buffer_out, default_timeout_ms);\n"
 right: "dispatch(\n\t&(struct request){.id = 1234567, .kind = KIND_READ},\n\t&response_buffer_out,\n\tdefault_timeout_ms\n);\n"

failures:
    collapses_a_call_that_now_fits
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literals_in_function_args
    declaration_with_brace_explodes_and_keeps_brace_attached
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    long_call_explodes_one_per_line

test result: FAILED. 46 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
