*** src/reflow.rs:691:5: replace is_excluded_callee -> bool with false

*** mutation diff:
--- src/reflow.rs
+++ replace is_excluded_callee -> bool with false
@@ -683,40 +683,17 @@
         && toks
             .get(i + 1)
             .is_some_and(|n| n.kind == TokenKind::Punct && n.text == "(")
 }
 
 /// Keywords that take a `(` but are not calls whose arguments split on commas. `_Generic` is not
 /// excluded: its associations are a comma list and explode exactly per §2.2.
 fn is_excluded_callee(name: &str) -> bool {
-    matches!(
-        name,
-        "if" | "for"
-            | "while"
-            | "switch"
-            | "return"
-            | "do"
-            | "else"
-            | "sizeof"
-            | "alignof"
-            | "_Alignof"
-            | "alignas"
-            | "_Alignas"
-            | "typeof"
-            | "typeof_unqual"
-            | "defined"
-            | "static_assert"
-            | "_Static_assert"
-            | "__attribute__"
-            | "_Pragma"
-            | "asm"
-            | "__asm__"
-            | "__asm"
-    )
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// The `{` opening an `enum [tag] [: type] { ... }` body that begins at the `enum` keyword `i`,
 /// or `None` if this `enum` does not introduce a body (a forward declaration or a variable use).
 fn enum_body_brace(toks: &[Token], i: usize) -> Option<usize> {
     for (j, t) in toks.iter().enumerate().skip(i + 1) {
         match t.kind {
             TokenKind::Whitespace | TokenKind::Newline | TokenKind::Ident => {}

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
proptest: Saving this and future failures in /tmp/cargo-mutants-c-format-N1smx1.tmp/tests/properties.proptest-regressions
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file.
cc 2214997093dab41a0079903dfd78b7c4fb5272a710205dbe1c5d0ada3155d4af

thread 'format_is_idempotent' (1004554) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"a({a;})\n"`,
 right: `"a({\n\ta;\n})\n"` at tests/properties.rs:17.
minimal failing input: s = "a({a}\"\"\"\"\"\"[)"
	successes: 205
	local rejects: 0

failures:
    format_is_idempotent

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
