*** src/reflow.rs:720:5: replace enum_body_brace -> Option<usize> with None

*** mutation diff:
--- src/reflow.rs
+++ replace enum_body_brace -> Option<usize> with None
@@ -712,25 +712,17 @@
             | "__asm__"
             | "__asm"
     )
 }
 
 /// The `{` opening an `enum [tag] [: type] { ... }` body that begins at the `enum` keyword `i`,
 /// or `None` if this `enum` does not introduce a body (a forward declaration or a variable use).
 fn enum_body_brace(toks: &[Token], i: usize) -> Option<usize> {
-    for (j, t) in toks.iter().enumerate().skip(i + 1) {
-        match t.kind {
-            TokenKind::Whitespace | TokenKind::Newline | TokenKind::Ident => {}
-            TokenKind::Punct if t.text == ":" => {}
-            TokenKind::Punct if t.text == "{" => return Some(j),
-            _ => return None,
-        }
-    }
-    None
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// The `(` that follows control keyword `i` after only trivia, or `None`.
 fn next_paren(toks: &[Token], i: usize) -> Option<usize> {
     for (j, t) in toks.iter().enumerate().skip(i + 1) {
         match t.kind {
             TokenKind::Whitespace | TokenKind::Newline => {}
             TokenKind::Punct if t.text == "(" => return Some(j),

---- enum_magic_comma_explodes stdout ----

thread 'enum_magic_comma_explodes' (657140) panicked at tests/conformance.rs:195:5:
assertion `left == right` failed
  left: "enum color { RED, GREEN, BLUE, };\n"
 right: "enum color {\n\tRED,\n\tGREEN,\n\tBLUE,\n};\n"

failures:
    enum_magic_comma_explodes

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
