*** src/reflow.rs:720:50: replace + with - in enum_body_brace

*** mutation diff:
--- src/reflow.rs
+++ replace + with - in enum_body_brace
@@ -712,17 +712,17 @@
             | "__asm__"
             | "__asm"
     )
 }
 
 /// The `{` opening an `enum [tag] [: type] { ... }` body that begins at the `enum` keyword `i`,
 /// or `None` if this `enum` does not introduce a body (a forward declaration or a variable use).
 fn enum_body_brace(toks: &[Token], i: usize) -> Option<usize> {
-    for (j, t) in toks.iter().enumerate().skip(i + 1) {
+    for (j, t) in toks.iter().enumerate().skip(i - /* ~ changed by cargo-mutants ~ */ 1) {
         match t.kind {
             TokenKind::Whitespace | TokenKind::Newline | TokenKind::Ident => {}
             TokenKind::Punct if t.text == ":" => {}
             TokenKind::Punct if t.text == "{" => return Some(j),
             _ => return None,
         }
     }
     None

---- enum_body_is_padded_when_flat stdout ----

thread 'enum_body_is_padded_when_flat' (658920) panicked at src/reflow.rs:720:48:
attempt to subtract with overflow

---- enum_magic_comma_explodes stdout ----

thread 'enum_magic_comma_explodes' (658921) panicked at src/reflow.rs:720:48:
attempt to subtract with overflow

failures:
    enum_body_is_padded_when_flat
    enum_magic_comma_explodes

test result: FAILED. 49 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
