*** src/reflow.rs:720:50: replace + with * in enum_body_brace

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in enum_body_brace
@@ -712,17 +712,17 @@
             | "__asm__"
             | "__asm"
     )
 }
 
 /// The `{` opening an `enum [tag] [: type] { ... }` body that begins at the `enum` keyword `i`,
 /// or `None` if this `enum` does not introduce a body (a forward declaration or a variable use).
 fn enum_body_brace(toks: &[Token], i: usize) -> Option<usize> {
-    for (j, t) in toks.iter().enumerate().skip(i + 1) {
+    for (j, t) in toks.iter().enumerate().skip(i * /* ~ changed by cargo-mutants ~ */ 1) {
         match t.kind {
             TokenKind::Whitespace | TokenKind::Newline | TokenKind::Ident => {}
             TokenKind::Punct if t.text == ":" => {}
             TokenKind::Punct if t.text == "{" => return Some(j),
             _ => return None,
         }
     }
     None

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (659073) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A({\"\";})\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:17.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")"
	successes: 0
	local rejects: 0
	global rejects: 0

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (659075) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A(\n\t{\n\t\t\"\";,\n\t}\n)\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:28.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")", width = 1
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
