*** src/reflow.rs:720:5: replace enum_body_brace -> Option<usize> with Some(1)

*** mutation diff:
--- src/reflow.rs
+++ replace enum_body_brace -> Option<usize> with Some(1)
@@ -712,25 +712,17 @@
             | "__asm__"
             | "__asm"
     )
 }
 
 /// The `{` opening an `enum [tag] [: type] { ... }` body that begins at the `enum` keyword `i`,
 /// or `None` if this `enum` does not introduce a body (a forward declaration or a variable use).
 fn enum_body_brace(toks: &[Token], i: usize) -> Option<usize> {
-    for (j, t) in toks.iter().enumerate().skip(i + 1) {
-        match t.kind {
-            TokenKind::Whitespace | TokenKind::Newline | TokenKind::Ident => {}
-            TokenKind::Punct if t.text == ":" => {}
-            TokenKind::Punct if t.text == "{" => return Some(j),
-            _ => return None,
-        }
-    }
-    None
+    Some(1) /* ~ changed by cargo-mutants ~ */
 }
 
 /// The `(` that follows control keyword `i` after only trivia, or `None`.
 fn next_paren(toks: &[Token], i: usize) -> Option<usize> {
     for (j, t) in toks.iter().enumerate().skip(i + 1) {
         match t.kind {
             TokenKind::Whitespace | TokenKind::Newline => {}
             TokenKind::Punct if t.text == "(" => return Some(j),

---- enum_magic_comma_explodes stdout ----

thread 'enum_magic_comma_explodes' (1005953) panicked at tests/conformance.rs:195:5:
assertion `left == right` failed
  left: "enum color { RED, GREEN, BLUE, };\n"
 right: "enum color {\n\tRED,\n\tGREEN,\n\tBLUE,\n};\n"

---- messy_real_world_input_is_idempotent_and_safe stdout ----

thread 'messy_real_world_input_is_idempotent_and_safe' (1005972) panicked at src/reflow.rs:395:29:
slice index starts at 66 but ends at 1

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (1005961) panicked at src/reflow.rs:395:29:
slice index starts at 438 but ends at 1

failures:
    enum_magic_comma_explodes
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    messy_real_world_input_is_idempotent_and_safe
    showcase_content_is_preserved

test result: FAILED. 47 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
