*** src/reflow.rs:723:40: replace == with != in enum_body_brace

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in enum_body_brace
@@ -715,17 +715,17 @@
 }
 
 /// The `{` opening an `enum [tag] [: type] { ... }` body that begins at the `enum` keyword `i`,
 /// or `None` if this `enum` does not introduce a body (a forward declaration or a variable use).
 fn enum_body_brace(toks: &[Token], i: usize) -> Option<usize> {
     for (j, t) in toks.iter().enumerate().skip(i + 1) {
         match t.kind {
             TokenKind::Whitespace | TokenKind::Newline | TokenKind::Ident => {}
-            TokenKind::Punct if t.text == ":" => {}
+            TokenKind::Punct if t.text != /* ~ changed by cargo-mutants ~ */ ":" => {}
             TokenKind::Punct if t.text == "{" => return Some(j),
             _ => return None,
         }
     }
     None
 }
 
 /// The `(` that follows control keyword `i` after only trivia, or `None`.

---- enum_magic_comma_explodes stdout ----

thread 'enum_magic_comma_explodes' (662259) panicked at tests/conformance.rs:195:5:
assertion `left == right` failed
  left: "enum color { RED, GREEN, BLUE, };\n"
 right: "enum color {\n\tRED,\n\tGREEN,\n\tBLUE,\n};\n"

failures:
    enum_magic_comma_explodes

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
