*** src/reflow.rs:724:33: replace match guard t.text == "{" with true in enum_body_brace

*** mutation diff:
--- src/reflow.rs
+++ replace match guard t.text == "{" with true in enum_body_brace
@@ -716,17 +716,17 @@
 
 /// The `{` opening an `enum [tag] [: type] { ... }` body that begins at the `enum` keyword `i`,
 /// or `None` if this `enum` does not introduce a body (a forward declaration or a variable use).
 fn enum_body_brace(toks: &[Token], i: usize) -> Option<usize> {
     for (j, t) in toks.iter().enumerate().skip(i + 1) {
         match t.kind {
             TokenKind::Whitespace | TokenKind::Newline | TokenKind::Ident => {}
             TokenKind::Punct if t.text == ":" => {}
-            TokenKind::Punct if t.text == "{" => return Some(j),
+            TokenKind::Punct if true /* ~ changed by cargo-mutants ~ */ => return Some(j),
             _ => return None,
         }
     }
     None
 }
 
 /// The `(` that follows control keyword `i` after only trivia, or `None`.
 fn next_paren(toks: &[Token], i: usize) -> Option<usize> {

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (1009055) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"(? *AA0 : #)\n"`,
 right: `"(\n\t? *AA0 :\n\t#\n)\n"` at tests/properties.rs:28.
minimal failing input: s = "(?\t*AA0:#)\t", width = 12
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    idempotent_across_widths

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
