*** src/reflow.rs:733:50: replace + with - in next_paren

*** mutation diff:
--- src/reflow.rs
+++ replace + with - in next_paren
@@ -725,17 +725,17 @@
             _ => return None,
         }
     }
     None
 }
 
 /// The `(` that follows control keyword `i` after only trivia, or `None`.
 fn next_paren(toks: &[Token], i: usize) -> Option<usize> {
-    for (j, t) in toks.iter().enumerate().skip(i + 1) {
+    for (j, t) in toks.iter().enumerate().skip(i - /* ~ changed by cargo-mutants ~ */ 1) {
         match t.kind {
             TokenKind::Whitespace | TokenKind::Newline => {}
             TokenKind::Punct if t.text == "(" => return Some(j),
             _ => return None,
         }
     }
     None
 }

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (1012551) panicked at src/reflow.rs:733:48:
attempt to subtract with overflow

---- condition_splits_on_the_outer_logical_operator stdout ----

thread 'condition_splits_on_the_outer_logical_operator' (1012565) panicked at src/reflow.rs:733:48:
attempt to subtract with overflow

---- control_keyword_gets_one_space_before_paren stdout ----

thread 'control_keyword_gets_one_space_before_paren' (1012568) panicked at src/reflow.rs:733:48:
attempt to subtract with overflow

failures:
    brace_attaches_for_functions_and_control
    condition_splits_on_the_outer_logical_operator
    control_headers_are_not_calls
    control_keyword_gets_one_space_before_paren
    for_header_is_not_treated_as_a_call
    golden_acceptance_unguarded_showcase
    long_for_header_explodes_one_clause_per_line
    long_if_condition_explodes_with_trailing_operators
    short_control_headers_unchanged

test result: FAILED. 44 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
