*** src/reflow.rs:733:50: replace + with * in next_paren

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in next_paren
@@ -725,17 +725,17 @@
             _ => return None,
         }
     }
     None
 }
 
 /// The `(` that follows control keyword `i` after only trivia, or `None`.
 fn next_paren(toks: &[Token], i: usize) -> Option<usize> {
-    for (j, t) in toks.iter().enumerate().skip(i + 1) {
+    for (j, t) in toks.iter().enumerate().skip(i * /* ~ changed by cargo-mutants ~ */ 1) {
         match t.kind {
             TokenKind::Whitespace | TokenKind::Newline => {}
             TokenKind::Punct if t.text == "(" => return Some(j),
             _ => return None,
         }
     }
     None
 }

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (1012785) panicked at tests/conformance.rs:276:5:
assertion `left == right` failed
  left: "if(x) {}\n"
 right: "if (x) {}\n"

---- condition_splits_on_the_outer_logical_operator stdout ----

thread 'condition_splits_on_the_outer_logical_operator' (1012794) panicked at tests/conformance.rs:396:5:
assertion `left == right` failed
  left: "if (alpha_value > 100 || bravo_value > 200 || charlie_value > 300 || delta_value > 400 || echo_v > 5) {\n}\n"
 right: "if (\n\talpha_value > 100 ||\n\tbravo_value > 200 ||\n\tcharlie_value > 300 ||\n\tdelta_value > 400 ||\n\techo_v > 5\n) {\n}\n"

---- control_keyword_gets_one_space_before_paren stdout ----

thread 'control_keyword_gets_one_space_before_paren' (1012796) panicked at tests/conformance.rs:226:5:
assertion `left == right` failed
  left: "if(x) y;\n"
 right: "if (x) y;\n"

failures:
    brace_attaches_for_functions_and_control
    condition_splits_on_the_outer_logical_operator
    control_keyword_gets_one_space_before_paren
    golden_acceptance_unguarded_showcase
    long_for_header_explodes_one_clause_per_line
    long_if_condition_explodes_with_trailing_operators

test result: FAILED. 47 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
