*** src/reflow.rs:733:5: replace next_paren -> Option<usize> with Some(0)

*** mutation diff:
--- src/reflow.rs
+++ replace next_paren -> Option<usize> with Some(0)
@@ -725,24 +725,17 @@
             _ => return None,
         }
     }
     None
 }
 
 /// The `(` that follows control keyword `i` after only trivia, or `None`.
 fn next_paren(toks: &[Token], i: usize) -> Option<usize> {
-    for (j, t) in toks.iter().enumerate().skip(i + 1) {
-        match t.kind {
-            TokenKind::Whitespace | TokenKind::Newline => {}
-            TokenKind::Punct if t.text == "(" => return Some(j),
-            _ => return None,
-        }
-    }
-    None
+    Some(0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// The next non-trivia token index at or after `from`.
 fn next_nontrivia(toks: &[Token], from: usize) -> Option<usize> {
     (from..toks.len()).find(|&j| !is_trivia(&toks[j]))
 }
 
 /// The next non-trivia token index in `[from, end)`.

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (663701) panicked at tests/conformance.rs:276:5:
assertion `left == right` failed
  left: "if(x) {}\n"
 right: "if (x) {}\n"

---- control_keyword_gets_one_space_before_paren stdout ----

thread 'control_keyword_gets_one_space_before_paren' (663713) panicked at tests/conformance.rs:226:5:
assertion `left == right` failed
  left: "if(x) y;\n"
 right: "if (x) y;\n"

---- long_if_condition_explodes_with_trailing_operators stdout ----

thread 'long_if_condition_explodes_with_trailing_operators' (663736) panicked at tests/conformance.rs:389:5:
assertion `left == right` failed
  left: "if (averaged_result > MINIMUM_ACCEPTABLE_THRESHOLD && averaged_result < MAXIMUM_ACCEPTABLE_THRESHOLD && averaged_result != 0) {\n}\n"
 right: "if (\n\taveraged_result > MINIMUM_ACCEPTABLE_THRESHOLD &&\n\taveraged_result < MAXIMUM_ACCEPTABLE_THRESHOLD &&\n\taveraged_result != 0\n) {\n}\n"

failures:
    brace_attaches_for_functions_and_control
    control_keyword_gets_one_space_before_paren
    golden_acceptance_unguarded_showcase
    long_for_header_explodes_one_clause_per_line
    long_if_condition_explodes_with_trailing_operators

test result: FAILED. 46 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
