*** src/reflow.rs:733:5: replace next_paren -> Option<usize> with Some(1)

*** mutation diff:
--- src/reflow.rs
+++ replace next_paren -> Option<usize> with Some(1)
@@ -725,24 +725,17 @@
             _ => return None,
         }
     }
     None
 }
 
 /// The `(` that follows control keyword `i` after only trivia, or `None`.
 fn next_paren(toks: &[Token], i: usize) -> Option<usize> {
-    for (j, t) in toks.iter().enumerate().skip(i + 1) {
-        match t.kind {
-            TokenKind::Whitespace | TokenKind::Newline => {}
-            TokenKind::Punct if t.text == "(" => return Some(j),
-            _ => return None,
-        }
-    }
-    None
+    Some(1) /* ~ changed by cargo-mutants ~ */
 }
 
 /// The next non-trivia token index at or after `from`.
 fn next_nontrivia(toks: &[Token], from: usize) -> Option<usize> {
     (from..toks.len()).find(|&j| !is_trivia(&toks[j]))
 }
 
 /// The next non-trivia token index in `[from, end)`.

---- long_for_header_explodes_one_clause_per_line stdout ----

thread 'long_for_header_explodes_one_clause_per_line' (664395) panicked at tests/conformance.rs:382:5:
assertion `left == right` failed
  left: "for (size_t current_sample_index = 0; current_sample_index < total_number_of_samples; current_sample_index++) {\n}\n"
 right: "for (\n\tsize_t current_sample_index = 0;\n\tcurrent_sample_index < total_number_of_samples;\n\tcurrent_sample_index++\n) {\n}\n"

---- long_if_condition_explodes_with_trailing_operators stdout ----

thread 'long_if_condition_explodes_with_trailing_operators' (664396) panicked at tests/conformance.rs:389:5:
assertion `left == right` failed
  left: "if (averaged_result > MINIMUM_ACCEPTABLE_THRESHOLD && averaged_result < MAXIMUM_ACCEPTABLE_THRESHOLD && averaged_result != 0) {\n}\n"
 right: "if (\n\taveraged_result > MINIMUM_ACCEPTABLE_THRESHOLD &&\n\taveraged_result < MAXIMUM_ACCEPTABLE_THRESHOLD &&\n\taveraged_result != 0\n) {\n}\n"

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (664387) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    golden_acceptance_unguarded_showcase
    long_for_header_explodes_one_clause_per_line
    long_if_condition_explodes_with_trailing_operators

test result: FAILED. 48 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
