*** src/reflow.rs:735:13: delete match arm TokenKind::Whitespace | TokenKind::Newline in next_paren

*** mutation diff:
--- src/reflow.rs
+++ delete match arm TokenKind::Whitespace | TokenKind::Newline in next_paren
@@ -727,17 +727,17 @@
     }
     None
 }
 
 /// The `(` that follows control keyword `i` after only trivia, or `None`.
 fn next_paren(toks: &[Token], i: usize) -> Option<usize> {
     for (j, t) in toks.iter().enumerate().skip(i + 1) {
         match t.kind {
-            TokenKind::Whitespace | TokenKind::Newline => {}
+             /* ~ changed by cargo-mutants ~ */
             TokenKind::Punct if t.text == "(" => return Some(j),
             _ => return None,
         }
     }
     None
 }
 
 /// The next non-trivia token index at or after `from`.

---- condition_splits_on_the_outer_logical_operator stdout ----

thread 'condition_splits_on_the_outer_logical_operator' (1014054) panicked at tests/conformance.rs:396:5:
assertion `left == right` failed
  left: "if (alpha_value > 100 || bravo_value > 200 || charlie_value > 300 || delta_value > 400 || echo_v > 5) {\n}\n"
 right: "if (\n\talpha_value > 100 ||\n\tbravo_value > 200 ||\n\tcharlie_value > 300 ||\n\tdelta_value > 400 ||\n\techo_v > 5\n) {\n}\n"

---- long_for_header_explodes_one_clause_per_line stdout ----

thread 'long_for_header_explodes_one_clause_per_line' (1014080) panicked at tests/conformance.rs:382:5:
assertion `left == right` failed
  left: "for (size_t current_sample_index = 0; current_sample_index < total_number_of_samples; current_sample_index++) {\n}\n"
 right: "for (\n\tsize_t current_sample_index = 0;\n\tcurrent_sample_index < total_number_of_samples;\n\tcurrent_sample_index++\n) {\n}\n"

---- long_if_condition_explodes_with_trailing_operators stdout ----

thread 'long_if_condition_explodes_with_trailing_operators' (1014081) panicked at tests/conformance.rs:389:5:
assertion `left == right` failed
  left: "if (averaged_result > MINIMUM_ACCEPTABLE_THRESHOLD && averaged_result < MAXIMUM_ACCEPTABLE_THRESHOLD && averaged_result != 0) {\n}\n"
 right: "if (\n\taveraged_result > MINIMUM_ACCEPTABLE_THRESHOLD &&\n\taveraged_result < MAXIMUM_ACCEPTABLE_THRESHOLD &&\n\taveraged_result != 0\n) {\n}\n"

failures:
    condition_splits_on_the_outer_logical_operator
    golden_acceptance_unguarded_showcase
    long_for_header_explodes_one_clause_per_line
    long_if_condition_explodes_with_trailing_operators

test result: FAILED. 49 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
