*** src/reflow.rs:736:33: replace match guard t.text == "(" with true in next_paren

*** mutation diff:
--- src/reflow.rs
+++ replace match guard t.text == "(" with true in next_paren
@@ -728,17 +728,17 @@
     None
 }
 
 /// The `(` that follows control keyword `i` after only trivia, or `None`.
 fn next_paren(toks: &[Token], i: usize) -> Option<usize> {
     for (j, t) in toks.iter().enumerate().skip(i + 1) {
         match t.kind {
             TokenKind::Whitespace | TokenKind::Newline => {}
-            TokenKind::Punct if t.text == "(" => return Some(j),
+            TokenKind::Punct if true /* ~ changed by cargo-mutants ~ */ => return Some(j),
             _ => return None,
         }
     }
     None
 }
 
 /// The next non-trivia token index at or after `from`.
 fn next_nontrivia(toks: &[Token], from: usize) -> Option<usize> {

*** result: Success
