*** src/reflow.rs:736:40: replace == with != in next_paren

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in next_paren
@@ -728,17 +728,17 @@
     None
 }
 
 /// The `(` that follows control keyword `i` after only trivia, or `None`.
 fn next_paren(toks: &[Token], i: usize) -> Option<usize> {
     for (j, t) in toks.iter().enumerate().skip(i + 1) {
         match t.kind {
             TokenKind::Whitespace | TokenKind::Newline => {}
-            TokenKind::Punct if t.text == "(" => return Some(j),
+            TokenKind::Punct if t.text != /* ~ changed by cargo-mutants ~ */ "(" => return Some(j),
             _ => return None,
         }
     }
     None
 }
 
 /// The next non-trivia token index at or after `from`.
 fn next_nontrivia(toks: &[Token], from: usize) -> Option<usize> {

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (667196) panicked at tests/conformance.rs:276:5:
assertion `left == right` failed
  left: "if(x) {}\n"
 right: "if (x) {}\n"

---- control_keyword_gets_one_space_before_paren stdout ----

thread 'control_keyword_gets_one_space_before_paren' (667206) panicked at tests/conformance.rs:226:5:
assertion `left == right` failed
  left: "if(x) y;\n"
 right: "if (x) y;\n"

---- long_for_header_explodes_one_clause_per_line stdout ----

thread 'long_for_header_explodes_one_clause_per_line' (667224) panicked at tests/conformance.rs:382:5:
assertion `left == right` failed
  left: "for (size_t current_sample_index = 0; current_sample_index < total_number_of_samples; current_sample_index++) {\n}\n"
 right: "for (\n\tsize_t current_sample_index = 0;\n\tcurrent_sample_index < total_number_of_samples;\n\tcurrent_sample_index++\n) {\n}\n"

failures:
    brace_attaches_for_functions_and_control
    control_keyword_gets_one_space_before_paren
    golden_acceptance_unguarded_showcase
    long_for_header_explodes_one_clause_per_line
    long_if_condition_explodes_with_trailing_operators

test result: FAILED. 46 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
