*** src/reflow.rs:73:13: delete match arm TokenKind::Whitespace in collapse_blank_lines

*** mutation diff:
--- src/reflow.rs
+++ delete match arm TokenKind::Whitespace in collapse_blank_lines
@@ -65,17 +65,17 @@
                     blank_run += 1;
                     if blank_run <= 1 {
                         out.push('\n');
                     }
                 }
                 line.clear();
                 has_content = false;
             }
-            TokenKind::Whitespace => line.push_str(t.text),
+             /* ~ changed by cargo-mutants ~ */
             _ => {
                 line.push_str(t.text);
                 has_content = true;
             }
         }
     }
     out.push_str(&line);
     out

*** result: Success
