*** src/reflow.rs:756:5: replace directive_end -> usize with 1

*** mutation diff:
--- src/reflow.rs
+++ replace directive_end -> usize with 1
@@ -748,26 +748,17 @@
 /// The next non-trivia token index in `[from, end)`.
 fn next_nontrivia_in(toks: &[Token], from: usize, end: usize) -> Option<usize> {
     (from..end).find(|&j| !is_trivia(&toks[j]))
 }
 
 /// One past the last token of the preprocessor directive starting at `start` (following `\` line
 /// continuations).
 fn directive_end(toks: &[Token], start: usize) -> usize {
-    let mut i = start;
-    while i < toks.len() {
-        let is_newline = toks[i].kind == TokenKind::Newline;
-        let continued = is_newline && i > 0 && toks[i - 1].text == "\\";
-        i += 1;
-        if is_newline && !continued {
-            break;
-        }
-    }
-    i
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Index of the `)`/`]` matching the bracket at `open`, or `None` if unbalanced.
 fn match_bracket(toks: &[Token], open: usize) -> Option<usize> {
     matching(toks, open, "(", ")").or_else(|| matching(toks, open, "[", "]"))
 }
 
 /// Index of the `}` matching the `{` at `open`, or `None` if unbalanced.

---- function_like_macro_body_opens_on_define_line stdout ----

thread 'function_like_macro_body_opens_on_define_line' (673197) panicked at tests/conformance.rs:410:5:
assertion `left == right` failed
  left: "#define DISPATCH_EVENT(handler, event) dispatch_incoming_event(\n\t(handler),\n\t(event),\n\tread_monotonic_timestamp_ms(),\n\tcurrent_execution_context_id()\n)\n"
 right: "#define DISPATCH_EVENT(handler, event) dispatch_incoming_event( \\\n\t(handler), \\\n\t(event), \\\n\tread_monotonic_timestamp_ms(), \\\n\tcurrent_execution_context_id() \\\n)\n"

---- generic_macro_explodes_one_association_per_line stdout ----

thread 'generic_macro_explodes_one_association_per_line' (673199) panicked at tests/conformance.rs:425:5:
assertion `left == right` failed
  left: "#define type_name(x) _Generic(\n\t(x),\n\tint: \"int\",\n\tlong: \"long\",\n\tfloat: \"float\",\n\tdouble: \"double\",\n\tdefault: \"other\"\n)\n"
 right: "#define type_name(x) _Generic( \\\n\t(x), \\\n\tint: \"int\", \\\n\tlong: \"long\", \\\n\tfloat: \"float\", \\\n\tdouble: \"double\", \\\n\tdefault: \"other\" \\\n)\n"

---- messy_real_world_input_is_idempotent_and_safe stdout ----

thread 'messy_real_world_input_is_idempotent_and_safe' (673211) panicked at src/reflow.rs:1112:21:
slice index starts at 2 but ends at 1

failures:
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    messy_real_world_input_is_idempotent_and_safe
    showcase_content_is_preserved
    statement_expression_macro_blocks_with_continuations

test result: FAILED. 43 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
