*** src/reflow.rs:758:39: replace == with != in directive_end

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in directive_end
@@ -750,17 +750,17 @@
     (from..end).find(|&j| !is_trivia(&toks[j]))
 }
 
 /// One past the last token of the preprocessor directive starting at `start` (following `\` line
 /// continuations).
 fn directive_end(toks: &[Token], start: usize) -> usize {
     let mut i = start;
     while i < toks.len() {
-        let is_newline = toks[i].kind == TokenKind::Newline;
+        let is_newline = toks[i].kind != /* ~ changed by cargo-mutants ~ */ TokenKind::Newline;
         let continued = is_newline && i > 0 && toks[i - 1].text == "\\";
         i += 1;
         if is_newline && !continued {
             break;
         }
     }
     i
 }

---- function_like_macro_body_opens_on_define_line stdout ----

thread 'function_like_macro_body_opens_on_define_line' (1021819) panicked at tests/conformance.rs:425:5:
assertion `left == right` failed
  left: "#define DISPATCH_EVENT(handler, event) dispatch_incoming_event(\n\t(handler),\n\t(event),\n\tread_monotonic_timestamp_ms(),\n\tcurrent_execution_context_id()\n)\n"
 right: "#define DISPATCH_EVENT(handler, event) dispatch_incoming_event( \\\n\t(handler), \\\n\t(event), \\\n\tread_monotonic_timestamp_ms(), \\\n\tcurrent_execution_context_id() \\\n)\n"

---- generic_macro_explodes_one_association_per_line stdout ----

thread 'generic_macro_explodes_one_association_per_line' (1021821) panicked at tests/conformance.rs:440:5:
assertion `left == right` failed
  left: "#define type_name(x) _Generic(\n\t(x),\n\tint: \"int\",\n\tlong: \"long\",\n\tfloat: \"float\",\n\tdouble: \"double\",\n\tdefault: \"other\"\n)\n"
 right: "#define type_name(x) _Generic( \\\n\t(x), \\\n\tint: \"int\", \\\n\tlong: \"long\", \\\n\tfloat: \"float\", \\\n\tdouble: \"double\", \\\n\tdefault: \"other\" \\\n)\n"

---- statement_expression_macro_blocks_with_continuations stdout ----

thread 'statement_expression_macro_blocks_with_continuations' (1021845) panicked at tests/conformance.rs:433:5:
assertion `left == right` failed
  left: "#define MAX(a, b) ({\n\ttypeof(a) _a = (a);\n\ttypeof(b) _b = (b);\n\t_a > _b ? _a : _b;\n})\n"
 right: "#define MAX(a, b) ({ \\\n\ttypeof(a) _a = (a); \\\n\ttypeof(b) _b = (b); \\\n\t_a > _b ? _a : _b; \\\n})\n"

failures:
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    showcase_content_is_preserved
    statement_expression_macro_blocks_with_continuations

test result: FAILED. 47 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
