*** src/reflow.rs:759:36: replace && with || in directive_end

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in directive_end
@@ -751,17 +751,17 @@
 }
 
 /// One past the last token of the preprocessor directive starting at `start` (following `\` line
 /// continuations).
 fn directive_end(toks: &[Token], start: usize) -> usize {
     let mut i = start;
     while i < toks.len() {
         let is_newline = toks[i].kind == TokenKind::Newline;
-        let continued = is_newline && i > 0 && toks[i - 1].text == "\\";
+        let continued = is_newline || /* ~ changed by cargo-mutants ~ */ i > 0 && toks[i - 1].text == "\\";
         i += 1;
         if is_newline && !continued {
             break;
         }
     }
     i
 }

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (1022852) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    golden_acceptance_unguarded_showcase

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
