*** src/reflow.rs:759:41: replace > with >= in directive_end

*** mutation diff:
--- src/reflow.rs
+++ replace > with >= in directive_end
@@ -751,17 +751,17 @@
 }
 
 /// One past the last token of the preprocessor directive starting at `start` (following `\` line
 /// continuations).
 fn directive_end(toks: &[Token], start: usize) -> usize {
     let mut i = start;
     while i < toks.len() {
         let is_newline = toks[i].kind == TokenKind::Newline;
-        let continued = is_newline && i > 0 && toks[i - 1].text == "\\";
+        let continued = is_newline && i >= /* ~ changed by cargo-mutants ~ */ 0 && toks[i - 1].text == "\\";
         i += 1;
         if is_newline && !continued {
             break;
         }
     }
     i
 }

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (1024436) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"a({a;})\n"`,
 right: `"a({\n\ta;\n})\n"` at tests/properties.rs:17.
minimal failing input: s = "a({a}\"\"\"\"\"\"[)"
	successes: 0
	local rejects: 0
	global rejects: 0

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (1024438) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"a(\n\t{\n\t\ta;,\n\t}\n)\n"`,
 right: `"a({\n\ta;\n})\n"` at tests/properties.rs:28.
minimal failing input: s = "a({a}\"\"\"\"\"\"[)", width = 1
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
