*** src/reflow.rs:759:45: replace && with || in directive_end

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in directive_end
@@ -751,17 +751,17 @@
 }
 
 /// One past the last token of the preprocessor directive starting at `start` (following `\` line
 /// continuations).
 fn directive_end(toks: &[Token], start: usize) -> usize {
     let mut i = start;
     while i < toks.len() {
         let is_newline = toks[i].kind == TokenKind::Newline;
-        let continued = is_newline && i > 0 && toks[i - 1].text == "\\";
+        let continued = is_newline && i > 0 || /* ~ changed by cargo-mutants ~ */ toks[i - 1].text == "\\";
         i += 1;
         if is_newline && !continued {
             break;
         }
     }
     i
 }

---- do_while_macro_passes_through stdout ----

thread 'do_while_macro_passes_through' (1022329) panicked at src/reflow.rs:759:88:
attempt to subtract with overflow

---- generic_macro_explodes_one_association_per_line stdout ----

thread 'generic_macro_explodes_one_association_per_line' (1022336) panicked at src/reflow.rs:759:88:
attempt to subtract with overflow

---- short_object_macro_unchanged stdout ----

thread 'short_object_macro_unchanged' (1022356) panicked at src/reflow.rs:759:88:
attempt to subtract with overflow

failures:
    do_while_macro_passes_through
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    passthrough_for_call_free_input
    short_object_macro_unchanged
    statement_expression_macro_blocks_with_continuations

test result: FAILED. 46 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
