*** src/reflow.rs:759:55: replace - with + in directive_end

*** mutation diff:
--- src/reflow.rs
+++ replace - with + in directive_end
@@ -751,17 +751,17 @@
 }
 
 /// One past the last token of the preprocessor directive starting at `start` (following `\` line
 /// continuations).
 fn directive_end(toks: &[Token], start: usize) -> usize {
     let mut i = start;
     while i < toks.len() {
         let is_newline = toks[i].kind == TokenKind::Newline;
-        let continued = is_newline && i > 0 && toks[i - 1].text == "\\";
+        let continued = is_newline && i > 0 && toks[i + /* ~ changed by cargo-mutants ~ */ 1].text == "\\";
         i += 1;
         if is_newline && !continued {
             break;
         }
     }
     i
 }

---- function_like_macro_body_opens_on_define_line stdout ----

thread 'function_like_macro_body_opens_on_define_line' (677899) panicked at src/reflow.rs:759:48:
index out of bounds: the len is 33 but the index is 33

---- generic_macro_explodes_one_association_per_line stdout ----

thread 'generic_macro_explodes_one_association_per_line' (677901) panicked at src/reflow.rs:759:48:
index out of bounds: the len is 45 but the index is 45

---- short_object_macro_unchanged stdout ----

thread 'short_object_macro_unchanged' (677921) panicked at src/reflow.rs:759:48:
index out of bounds: the len is 7 but the index is 7

failures:
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    short_object_macro_unchanged
    statement_expression_macro_blocks_with_continuations

test result: FAILED. 47 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
