*** src/reflow.rs:760:11: replace += with -= in directive_end

*** mutation diff:
--- src/reflow.rs
+++ replace += with -= in directive_end
@@ -752,17 +752,17 @@
 
 /// One past the last token of the preprocessor directive starting at `start` (following `\` line
 /// continuations).
 fn directive_end(toks: &[Token], start: usize) -> usize {
     let mut i = start;
     while i < toks.len() {
         let is_newline = toks[i].kind == TokenKind::Newline;
         let continued = is_newline && i > 0 && toks[i - 1].text == "\\";
-        i += 1;
+        i -= /* ~ changed by cargo-mutants ~ */ 1;
         if is_newline && !continued {
             break;
         }
     }
     i
 }
 
 /// Index of the `)`/`]` matching the bracket at `open`, or `None` if unbalanced.

---- do_while_macro_passes_through stdout ----

thread 'do_while_macro_passes_through' (678930) panicked at src/reflow.rs:760:9:
attempt to subtract with overflow

---- function_like_macro_body_opens_on_define_line stdout ----

thread 'function_like_macro_body_opens_on_define_line' (678935) panicked at src/reflow.rs:760:9:
attempt to subtract with overflow

---- generic_macro_explodes_one_association_per_line stdout ----

thread 'generic_macro_explodes_one_association_per_line' (678937) panicked at src/reflow.rs:760:9:
attempt to subtract with overflow

failures:
    do_while_macro_passes_through
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    messy_real_world_input_is_idempotent_and_safe
    passthrough_for_call_free_input
    short_object_macro_unchanged
    showcase_content_is_preserved
    statement_expression_macro_blocks_with_continuations

test result: FAILED. 40 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
