*** src/reflow.rs:760:11: replace += with *= in directive_end

*** mutation diff:
--- src/reflow.rs
+++ replace += with *= in directive_end
@@ -752,17 +752,17 @@
 
 /// One past the last token of the preprocessor directive starting at `start` (following `\` line
 /// continuations).
 fn directive_end(toks: &[Token], start: usize) -> usize {
     let mut i = start;
     while i < toks.len() {
         let is_newline = toks[i].kind == TokenKind::Newline;
         let continued = is_newline && i > 0 && toks[i - 1].text == "\\";
-        i += 1;
+        i *= /* ~ changed by cargo-mutants ~ */ 1;
         if is_newline && !continued {
             break;
         }
     }
     i
 }
 
 /// Index of the `)`/`]` matching the bracket at `open`, or `None` if unbalanced.

*** result: Timeout
