*** src/reflow.rs:770:5: replace match_bracket -> Option<usize> with None

*** mutation diff:
--- src/reflow.rs
+++ replace match_bracket -> Option<usize> with None
@@ -762,17 +762,17 @@
             break;
         }
     }
     i
 }
 
 /// Index of the `)`/`]` matching the bracket at `open`, or `None` if unbalanced.
 fn match_bracket(toks: &[Token], open: usize) -> Option<usize> {
-    matching(toks, open, "(", ")").or_else(|| matching(toks, open, "[", "]"))
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Index of the `}` matching the `{` at `open`, or `None` if unbalanced.
 fn match_brace(toks: &[Token], open: usize) -> Option<usize> {
     matching(toks, open, "{", "}")
 }
 
 fn matching(toks: &[Token], open: usize, lhs: &str, rhs: &str) -> Option<usize> {

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (681374) panicked at tests/conformance.rs:276:5:
assertion `left == right` failed
  left: "if(x) {}\n"
 right: "if (x) {}\n"

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (681377) panicked at tests/conformance.rs:137:5:
assertion `left == right` failed
  left: "foo(\n\ta,\n\tb\n);\n"
 right: "foo(a, b);\n"

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (681379) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(&(struct config){.alpha = 1111111111, .beta = 2222222222, .gamma = 3333333333, .delta = 4444444444});\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

failures:
    brace_attaches_for_functions_and_control
    collapses_a_call_that_now_fits
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literals_in_function_args
    control_keyword_gets_one_space_before_paren
    declaration_with_brace_explodes_and_keeps_brace_attached
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    long_call_explodes_one_per_line
    long_for_header_explodes_one_clause_per_line
    long_if_condition_explodes_with_trailing_operators

test result: FAILED. 36 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
