*** src/reflow.rs:770:5: replace match_bracket -> Option<usize> with Some(1)

*** mutation diff:
--- src/reflow.rs
+++ replace match_bracket -> Option<usize> with Some(1)
@@ -762,17 +762,17 @@
             break;
         }
     }
     i
 }
 
 /// Index of the `)`/`]` matching the bracket at `open`, or `None` if unbalanced.
 fn match_bracket(toks: &[Token], open: usize) -> Option<usize> {
-    matching(toks, open, "(", ")").or_else(|| matching(toks, open, "[", "]"))
+    Some(1) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Index of the `}` matching the `{` at `open`, or `None` if unbalanced.
 fn match_brace(toks: &[Token], open: usize) -> Option<usize> {
     matching(toks, open, "{", "}")
 }
 
 fn matching(toks: &[Token], open: usize, lhs: &str, rhs: &str) -> Option<usize> {

*** result: Timeout
