*** src/reflow.rs:775:5: replace match_brace -> Option<usize> with Some(1)

*** mutation diff:
--- src/reflow.rs
+++ replace match_brace -> Option<usize> with Some(1)
@@ -767,17 +767,17 @@
 
 /// Index of the `)`/`]` matching the bracket at `open`, or `None` if unbalanced.
 fn match_bracket(toks: &[Token], open: usize) -> Option<usize> {
     matching(toks, open, "(", ")").or_else(|| matching(toks, open, "[", "]"))
 }
 
 /// Index of the `}` matching the `{` at `open`, or `None` if unbalanced.
 fn match_brace(toks: &[Token], open: usize) -> Option<usize> {
-    matching(toks, open, "{", "}")
+    Some(1) /* ~ changed by cargo-mutants ~ */
 }
 
 fn matching(toks: &[Token], open: usize, lhs: &str, rhs: &str) -> Option<usize> {
     if toks.get(open).map(|t| t.text) != Some(lhs) {
         return None;
     }
     let mut depth = 0usize;
     for (j, t) in toks.iter().enumerate().skip(open) {

---- collapses_initializer_without_trailing_comma stdout ----

thread 'collapses_initializer_without_trailing_comma' (683572) panicked at src/reflow.rs:611:22:
slice index starts at 9 but ends at 1

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (683573) panicked at src/reflow.rs:1018:45:
slice index starts at 7 but ends at 1

---- compound_literal_brace_stays_tight stdout ----

thread 'compound_literal_brace_stays_tight' (683574) panicked at src/reflow.rs:611:22:
slice index starts at 11 but ends at 1

failures:
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    enum_body_is_padded_when_flat
    enum_magic_comma_explodes
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    initializer_with_comment_keeps_structure_but_retabs
    magic_trailing_comma_forces_explosion_with_trailing_comma

test result: FAILED. 33 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
