*** src/reflow.rs:779:5: replace matching -> Option<usize> with None

*** mutation diff:
--- src/reflow.rs
+++ replace matching -> Option<usize> with None
@@ -771,31 +771,17 @@
 }
 
 /// Index of the `}` matching the `{` at `open`, or `None` if unbalanced.
 fn match_brace(toks: &[Token], open: usize) -> Option<usize> {
     matching(toks, open, "{", "}")
 }
 
 fn matching(toks: &[Token], open: usize, lhs: &str, rhs: &str) -> Option<usize> {
-    if toks.get(open).map(|t| t.text) != Some(lhs) {
-        return None;
-    }
-    let mut depth = 0usize;
-    for (j, t) in toks.iter().enumerate().skip(open) {
-        if t.text == lhs {
-            depth += 1;
-        } else if t.text == rhs {
-            depth -= 1;
-            if depth == 0 {
-                return Some(j);
-            }
-        }
-    }
-    None
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Split `inner` into segments at the depth-zero tokens for which `is_sep` holds.
 fn split_top_level<'a, 'src>(
     inner: &'a [Token<'src>],
     is_sep: impl Fn(&Token) -> bool,
 ) -> Vec<&'a [Token<'src>]> {
     let mut segments = Vec::new();

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (684081) panicked at tests/conformance.rs:276:5:
assertion `left == right` failed
  left: "if(x) {}\n"
 right: "if (x) {}\n"

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (684084) panicked at tests/conformance.rs:137:5:
assertion `left == right` failed
  left: "foo(\n\ta,\n\tb\n);\n"
 right: "foo(a, b);\n"

---- collapses_initializer_without_trailing_comma stdout ----

thread 'collapses_initializer_without_trailing_comma' (684085) panicked at tests/conformance.rs:172:5:
assertion `left == right` failed
  left: "int v[] = {\n\t1,\n\t2,\n\t3\n};\n"
 right: "int v[] = {1, 2, 3};\n"

failures:
    brace_attaches_for_functions_and_control
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    control_keyword_gets_one_space_before_paren
    declaration_with_brace_explodes_and_keeps_brace_attached
    enum_magic_comma_explodes
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase

test result: FAILED. 31 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
