*** src/reflow.rs:779:5: replace matching -> Option<usize> with Some(0)

*** mutation diff:
--- src/reflow.rs
+++ replace matching -> Option<usize> with Some(0)
@@ -771,31 +771,17 @@
 }
 
 /// Index of the `}` matching the `{` at `open`, or `None` if unbalanced.
 fn match_brace(toks: &[Token], open: usize) -> Option<usize> {
     matching(toks, open, "{", "}")
 }
 
 fn matching(toks: &[Token], open: usize, lhs: &str, rhs: &str) -> Option<usize> {
-    if toks.get(open).map(|t| t.text) != Some(lhs) {
-        return None;
-    }
-    let mut depth = 0usize;
-    for (j, t) in toks.iter().enumerate().skip(open) {
-        if t.text == lhs {
-            depth += 1;
-        } else if t.text == rhs {
-            depth -= 1;
-            if depth == 0 {
-                return Some(j);
-            }
-        }
-    }
-    None
+    Some(0) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Split `inner` into segments at the depth-zero tokens for which `is_sep` holds.
 fn split_top_level<'a, 'src>(
     inner: &'a [Token<'src>],
     is_sep: impl Fn(&Token) -> bool,
 ) -> Vec<&'a [Token<'src>]> {
     let mut segments = Vec::new();

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (1032432) panicked at src/reflow.rs:404:39:
slice index starts at 4 but ends at 0

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (1032430) panicked at src/reflow.rs:404:39:
slice index starts at 4 but ends at 0

---- call_with_line_comment_passes_through stdout ----

thread 'call_with_line_comment_passes_through' (1032433) panicked at src/reflow.rs:404:39:
slice index starts at 2 but ends at 0

failures:
    blank_line_runs_collapse_to_one_everywhere
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    condition_splits_on_the_outer_logical_operator
    control_headers_are_not_calls

test result: FAILED. 10 passed; 43 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
