*** src/reflow.rs:785:19: replace += with *= in matching

*** mutation diff:
--- src/reflow.rs
+++ replace += with *= in matching
@@ -777,17 +777,17 @@
 
 fn matching(toks: &[Token], open: usize, lhs: &str, rhs: &str) -> Option<usize> {
     if toks.get(open).map(|t| t.text) != Some(lhs) {
         return None;
     }
     let mut depth = 0usize;
     for (j, t) in toks.iter().enumerate().skip(open) {
         if t.text == lhs {
-            depth += 1;
+            depth *= /* ~ changed by cargo-mutants ~ */ 1;
         } else if t.text == rhs {
             depth -= 1;
             if depth == 0 {
                 return Some(j);
             }
         }
     }
     None

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (1035020) panicked at src/reflow.rs:787:13:
attempt to subtract with overflow

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (1035022) panicked at src/reflow.rs:787:13:
attempt to subtract with overflow

---- call_with_line_comment_passes_through stdout ----

thread 'call_with_line_comment_passes_through' (1035023) panicked at src/reflow.rs:787:13:
attempt to subtract with overflow

failures:
    blank_line_runs_collapse_to_one_everywhere
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    condition_splits_on_the_outer_logical_operator
    control_headers_are_not_calls

test result: FAILED. 7 passed; 46 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
