*** src/reflow.rs:786:26: replace == with != in matching

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in matching
@@ -778,17 +778,17 @@
 fn matching(toks: &[Token], open: usize, lhs: &str, rhs: &str) -> Option<usize> {
     if toks.get(open).map(|t| t.text) != Some(lhs) {
         return None;
     }
     let mut depth = 0usize;
     for (j, t) in toks.iter().enumerate().skip(open) {
         if t.text == lhs {
             depth += 1;
-        } else if t.text == rhs {
+        } else if t.text != /* ~ changed by cargo-mutants ~ */ rhs {
             depth -= 1;
             if depth == 0 {
                 return Some(j);
             }
         }
     }
     None
 }

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (1035547) panicked at tests/conformance.rs:339:5:
assertion `left == right` failed
  left: "void f()) {\n\tint a;\n\n\tint b;\n}\n"
 right: "void f(void) {\n\tint a;\n\n\tint b;\n}\n"

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (1035549) panicked at tests/conformance.rs:275:5:
assertion `left == right` failed
  left: "void f()) {}\n"
 right: "void f(void) {}\n"

---- call_with_line_comment_passes_through stdout ----

thread 'call_with_line_comment_passes_through' (1035550) panicked at tests/conformance.rs:217:5:
assertion `left == right` failed: comment-bearing calls must not be reflowed
  left: "f()\t// keep me\n\tNULL,\n\t&x\n);\n"
 right: "f(\n\t// keep me\n\tNULL,\n\t&x\n);\n"

failures:
    blank_line_runs_collapse_to_one_everywhere
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    condition_splits_on_the_outer_logical_operator
    control_headers_are_not_calls
    control_keyword_gets_one_space_before_paren

test result: FAILED. 15 passed; 38 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
