*** src/reflow.rs:787:19: replace -= with /= in matching

*** mutation diff:
--- src/reflow.rs
+++ replace -= with /= in matching
@@ -779,17 +779,17 @@
     if toks.get(open).map(|t| t.text) != Some(lhs) {
         return None;
     }
     let mut depth = 0usize;
     for (j, t) in toks.iter().enumerate().skip(open) {
         if t.text == lhs {
             depth += 1;
         } else if t.text == rhs {
-            depth -= 1;
+            depth /= /* ~ changed by cargo-mutants ~ */ 1;
             if depth == 0 {
                 return Some(j);
             }
         }
     }
     None
 }

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (1036567) panicked at tests/conformance.rs:276:5:
assertion `left == right` failed
  left: "if(x) {}\n"
 right: "if (x) {}\n"

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (1036570) panicked at tests/conformance.rs:137:5:
assertion `left == right` failed
  left: "foo(\n\ta,\n\tb\n);\n"
 right: "foo(a, b);\n"

---- collapses_initializer_without_trailing_comma stdout ----

thread 'collapses_initializer_without_trailing_comma' (1036571) panicked at tests/conformance.rs:172:5:
assertion `left == right` failed
  left: "int v[] = {\n\t1,\n\t2,\n\t3\n};\n"
 right: "int v[] = {1, 2, 3};\n"

failures:
    brace_attaches_for_functions_and_control
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    condition_splits_on_the_outer_logical_operator
    control_keyword_gets_one_space_before_paren
    declaration_with_brace_explodes_and_keeps_brace_attached
    enum_magic_comma_explodes
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line

test result: FAILED. 32 passed; 21 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
