*** src/reflow.rs:806:38: replace += with -= in split_top_level

*** mutation diff:
--- src/reflow.rs
+++ replace += with -= in split_top_level
@@ -798,17 +798,17 @@
     inner: &'a [Token<'src>],
     is_sep: impl Fn(&Token) -> bool,
 ) -> Vec<&'a [Token<'src>]> {
     let mut segments = Vec::new();
     let mut depth = 0i32;
     let mut start = 0usize;
     for (j, t) in inner.iter().enumerate() {
         match t.text {
-            "(" | "[" | "{" => depth += 1,
+            "(" | "[" | "{" => depth -= /* ~ changed by cargo-mutants ~ */ 1,
             ")" | "]" | "}" => depth -= 1,
             _ if depth == 0 && is_sep(t) => {
                 segments.push(&inner[start..j]);
                 start = j + 1;
             }
             _ => {}
         }
     }

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (693349) panicked at tests/conformance.rs:403:5:
assertion `left == right` failed
  left: "p = &(struct shape){.tag = R, .rect = {.w = 3, .h = 4},};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (693350) panicked at tests/conformance.rs:302:5:
assertion `left == right` failed
  left: "dispatch(\n\t&(struct request){.id = 1234567, .kind = KIND_READ}, &response_buffer_out, default_timeout_ms\n);\n"
 right: "dispatch(\n\t&(struct request){.id = 1234567, .kind = KIND_READ},\n\t&response_buffer_out,\n\tdefault_timeout_ms\n);\n"

---- function_like_macro_body_opens_on_define_line stdout ----

thread 'function_like_macro_body_opens_on_define_line' (693360) panicked at tests/conformance.rs:410:5:
assertion `left == right` failed
  left: "#define DISPATCH_EVENT(handler, event) dispatch_incoming_event( \\\n\t(handler), (event), read_monotonic_timestamp_ms(), current_execution_context_id() \\\n)\n"
 right: "#define DISPATCH_EVENT(handler, event) dispatch_incoming_event( \\\n\t(handler), \\\n\t(event), \\\n\tread_monotonic_timestamp_ms(), \\\n\tcurrent_execution_context_id() \\\n)\n"

failures:
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    nested_initializer_collapses_independently
    showcase_content_is_preserved
    statement_expression_macro_blocks_with_continuations

test result: FAILED. 41 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
