*** src/reflow.rs:808:18: replace match guard depth == 0 && is_sep(t) with true in split_top_level

*** mutation diff:
--- src/reflow.rs
+++ replace match guard depth == 0 && is_sep(t) with true in split_top_level
@@ -800,17 +800,17 @@
 ) -> Vec<&'a [Token<'src>]> {
     let mut segments = Vec::new();
     let mut depth = 0i32;
     let mut start = 0usize;
     for (j, t) in inner.iter().enumerate() {
         match t.text {
             "(" | "[" | "{" => depth += 1,
             ")" | "]" | "}" => depth -= 1,
-            _ if depth == 0 && is_sep(t) => {
+            _ if true /* ~ changed by cargo-mutants ~ */ => {
                 segments.push(&inner[start..j]);
                 start = j + 1;
             }
             _ => {}
         }
     }
     segments.push(&inner[start..]);
     segments

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (692317) panicked at tests/conformance.rs:339:5:
assertion `left == right` failed
  left: "void f() {\n\tint a;\n\n\tint b;\n}\n"
 right: "void f(void) {\n\tint a;\n\n\tint b;\n}\n"

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (692319) panicked at tests/conformance.rs:275:5:
assertion `left == right` failed
  left: "void f() {}\n"
 right: "void f(void) {}\n"

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (692322) panicked at tests/conformance.rs:137:5:
assertion `left == right` failed
  left: "foo();\n"
 right: "foo(a, b);\n"

failures:
    blank_line_runs_collapse_to_one_everywhere
    brace_attaches_for_functions_and_control
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    control_headers_are_not_calls
    declaration_with_brace_explodes_and_keeps_brace_attached
    enum_body_is_padded_when_flat
    enum_magic_comma_explodes

test result: FAILED. 16 passed; 35 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
