*** src/reflow.rs:808:24: replace == with != in split_top_level

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in split_top_level
@@ -800,17 +800,17 @@
 ) -> Vec<&'a [Token<'src>]> {
     let mut segments = Vec::new();
     let mut depth = 0i32;
     let mut start = 0usize;
     for (j, t) in inner.iter().enumerate() {
         match t.text {
             "(" | "[" | "{" => depth += 1,
             ")" | "]" | "}" => depth -= 1,
-            _ if depth == 0 && is_sep(t) => {
+            _ if depth != /* ~ changed by cargo-mutants ~ */ 0 && is_sep(t) => {
                 segments.push(&inner[start..j]);
                 start = j + 1;
             }
             _ => {}
         }
     }
     segments.push(&inner[start..]);
     segments

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (695436) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(\n\t&(struct config){.alpha = 1111111111,\n\t.beta = 2222222222,\n\t.gamma = 3333333333,\n\t.delta = 4444444444}\n);\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (695438) panicked at tests/conformance.rs:403:5:
assertion `left == right` failed
  left: "p = &(struct shape){.tag = R, .rect = {.w = 3, .h = 4},};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (695439) panicked at tests/conformance.rs:302:5:
assertion `left == right` failed
  left: "dispatch(\n\t&(struct request){.id = 1234567,\n\t.kind = KIND_READ}, &response_buffer_out, default_timeout_ms\n);\n"
 right: "dispatch(\n\t&(struct request){.id = 1234567, .kind = KIND_READ},\n\t&response_buffer_out,\n\tdefault_timeout_ms\n);\n"

failures:
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    declaration_with_brace_explodes_and_keeps_brace_attached
    enum_magic_comma_explodes
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    long_call_explodes_one_per_line
    long_for_header_explodes_one_clause_per_line

test result: FAILED. 31 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
