*** src/reflow.rs:810:27: replace + with * in split_top_level

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in split_top_level
@@ -802,17 +802,17 @@
     let mut depth = 0i32;
     let mut start = 0usize;
     for (j, t) in inner.iter().enumerate() {
         match t.text {
             "(" | "[" | "{" => depth += 1,
             ")" | "]" | "}" => depth -= 1,
             _ if depth == 0 && is_sep(t) => {
                 segments.push(&inner[start..j]);
-                start = j + 1;
+                start = j * /* ~ changed by cargo-mutants ~ */ 1;
             }
             _ => {}
         }
     }
     segments.push(&inner[start..]);
     segments
 }

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (1044217) panicked at tests/conformance.rs:137:5:
assertion `left == right` failed
  left: "foo(a, , b);\n"
 right: "foo(a, b);\n"

---- collapses_initializer_without_trailing_comma stdout ----

thread 'collapses_initializer_without_trailing_comma' (1044218) panicked at tests/conformance.rs:172:5:
assertion `left == right` failed
  left: "int v[] = {1, , 2, , 3};\n"
 right: "int v[] = {1, 2, 3};\n"

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (1044219) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t, .beta = 2222222222,\n\t\t, .gamma = 3333333333,\n\t\t, .delta = 4444444444,\n\t}\n);\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

failures:
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    condition_splits_on_the_outer_logical_operator
    control_headers_are_not_calls
    declaration_with_brace_explodes_and_keeps_brace_attached
    enum_body_is_padded_when_flat
    enum_magic_comma_explodes
    for_header_is_not_treated_as_a_call
    function_like_macro_body_opens_on_define_line

test result: FAILED. 22 passed; 31 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
