*** src/reflow.rs:821:39: replace == with != in split_on_commas

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in split_on_commas
@@ -813,17 +813,17 @@
         }
     }
     segments.push(&inner[start..]);
     segments
 }
 
 /// Split `inner` on commas at bracket depth zero.
 fn split_on_commas<'a, 'src>(inner: &'a [Token<'src>]) -> Vec<&'a [Token<'src>]> {
-    split_top_level(inner, |t| t.kind == TokenKind::Punct && t.text == ",")
+    split_top_level(inner, |t| t.kind != /* ~ changed by cargo-mutants ~ */ TokenKind::Punct && t.text == ",")
 }
 
 /// The outermost logical operator present at bracket depth zero (`||` outranks `&&`), if any.
 fn top_level_logical_op(inner: &[Token]) -> Option<&'static str> {
     let mut depth = 0i32;
     let mut has_and = false;
     for t in inner {
         match t.text {

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (698447) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111, .beta = 2222222222, .gamma = 3333333333, .delta = 4444444444,\n\t}\n);\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (698449) panicked at tests/conformance.rs:403:5:
assertion `left == right` failed
  left: "p = &(struct shape){.tag = R, .rect = {.w = 3, .h = 4},};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (698450) panicked at tests/conformance.rs:302:5:
assertion `left == right` failed
  left: "dispatch(\n\t&(struct request){.id = 1234567, .kind = KIND_READ}, &response_buffer_out, default_timeout_ms\n);\n"
 right: "dispatch(\n\t&(struct request){.id = 1234567, .kind = KIND_READ},\n\t&response_buffer_out,\n\tdefault_timeout_ms\n);\n"

failures:
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    declaration_with_brace_explodes_and_keeps_brace_attached
    enum_magic_comma_explodes
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    long_call_explodes_one_per_line
    magic_trailing_comma_forces_explosion_with_trailing_comma

test result: FAILED. 38 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
