*** src/reflow.rs:821:5: replace split_on_commas -> Vec<&'a[Token<'src>]> with vec![Vec::leak(Vec::new())]

*** mutation diff:
--- src/reflow.rs
+++ replace split_on_commas -> Vec<&'a[Token<'src>]> with vec![Vec::leak(Vec::new())]
@@ -813,17 +813,17 @@
         }
     }
     segments.push(&inner[start..]);
     segments
 }
 
 /// Split `inner` on commas at bracket depth zero.
 fn split_on_commas<'a, 'src>(inner: &'a [Token<'src>]) -> Vec<&'a [Token<'src>]> {
-    split_top_level(inner, |t| t.kind == TokenKind::Punct && t.text == ",")
+    vec![Vec::leak(Vec::new())] /* ~ changed by cargo-mutants ~ */
 }
 
 /// The outermost logical operator present at bracket depth zero (`||` outranks `&&`), if any.
 fn top_level_logical_op(inner: &[Token]) -> Option<&'static str> {
     let mut depth = 0i32;
     let mut has_and = false;
     for t in inner {
         match t.text {

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (1045310) panicked at tests/conformance.rs:339:5:
assertion `left == right` failed
  left: "void f() {\n\tint a;\n\n\tint b;\n}\n"
 right: "void f(void) {\n\tint a;\n\n\tint b;\n}\n"

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (1045312) panicked at tests/conformance.rs:275:5:
assertion `left == right` failed
  left: "void f() {}\n"
 right: "void f(void) {}\n"

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (1045315) panicked at tests/conformance.rs:137:5:
assertion `left == right` failed
  left: "foo();\n"
 right: "foo(a, b);\n"

failures:
    blank_line_runs_collapse_to_one_everywhere
    brace_attaches_for_functions_and_control
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    control_headers_are_not_calls
    declaration_with_brace_explodes_and_keeps_brace_attached
    enum_body_is_padded_when_flat
    enum_magic_comma_explodes

test result: FAILED. 27 passed; 26 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
