*** src/reflow.rs:821:69: replace == with != in split_on_commas

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in split_on_commas
@@ -813,17 +813,17 @@
         }
     }
     segments.push(&inner[start..]);
     segments
 }
 
 /// Split `inner` on commas at bracket depth zero.
 fn split_on_commas<'a, 'src>(inner: &'a [Token<'src>]) -> Vec<&'a [Token<'src>]> {
-    split_top_level(inner, |t| t.kind == TokenKind::Punct && t.text == ",")
+    split_top_level(inner, |t| t.kind == TokenKind::Punct && t.text != /* ~ changed by cargo-mutants ~ */ ",")
 }
 
 /// The outermost logical operator present at bracket depth zero (`||` outranks `&&`), if any.
 fn top_level_logical_op(inner: &[Token]) -> Option<&'static str> {
     let mut depth = 0i32;
     let mut has_and = false;
     for t in inner {
         match t.text {

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (699399) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init((struct config){alpha, 1111111111,, beta, 2222222222,, gamma, 3333333333,, delta, 4444444444});\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literal_brace_stays_tight stdout ----

thread 'compound_literal_brace_stays_tight' (699400) panicked at tests/conformance.rs:282:5:
assertion `left == right` failed
  left: "p = &(struct shape){x, 1};\n"
 right: "p = &(struct shape){.x = 1};\n"

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (699401) panicked at tests/conformance.rs:403:5:
assertion `left == right` failed
  left: "p = &(struct shape){tag, R,, rect, {w, 3,, h, 4},};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

failures:
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    declaration_with_brace_explodes_and_keeps_brace_attached
    enum_body_is_padded_when_flat
    enum_magic_comma_explodes
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase

test result: FAILED. 34 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
