*** src/reflow.rs:826:5: replace top_level_logical_op -> Option<&'static str> with Some("xyzzy")

*** mutation diff:
--- src/reflow.rs
+++ replace top_level_logical_op -> Option<&'static str> with Some("xyzzy")
@@ -818,28 +818,17 @@
 
 /// Split `inner` on commas at bracket depth zero.
 fn split_on_commas<'a, 'src>(inner: &'a [Token<'src>]) -> Vec<&'a [Token<'src>]> {
     split_top_level(inner, |t| t.kind == TokenKind::Punct && t.text == ",")
 }
 
 /// The outermost logical operator present at bracket depth zero (`||` outranks `&&`), if any.
 fn top_level_logical_op(inner: &[Token]) -> Option<&'static str> {
-    let mut depth = 0i32;
-    let mut has_and = false;
-    for t in inner {
-        match t.text {
-            "(" | "[" | "{" => depth += 1,
-            ")" | "]" | "}" => depth -= 1,
-            "||" if depth == 0 && t.kind == TokenKind::Operator => return Some("||"),
-            "&&" if depth == 0 && t.kind == TokenKind::Operator => has_and = true,
-            _ => {}
-        }
-    }
-    has_and.then_some("&&")
+    Some("xyzzy") /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_trivia(t: &Token) -> bool {
     matches!(t.kind, TokenKind::Whitespace | TokenKind::Newline)
 }
 
 fn contains_comment(toks: &[Token]) -> bool {
     toks.iter()

---- long_if_condition_explodes_with_trailing_operators stdout ----

thread 'long_if_condition_explodes_with_trailing_operators' (700947) panicked at tests/conformance.rs:389:5:
assertion `left == right` failed
  left: "if (\n\taveraged_result > MINIMUM_ACCEPTABLE_THRESHOLD && averaged_result < MAXIMUM_ACCEPTABLE_THRESHOLD && averaged_result != 0\n) {\n}\n"
 right: "if (\n\taveraged_result > MINIMUM_ACCEPTABLE_THRESHOLD &&\n\taveraged_result < MAXIMUM_ACCEPTABLE_THRESHOLD &&\n\taveraged_result != 0\n) {\n}\n"

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (700939) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (700941) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    long_if_condition_explodes_with_trailing_operators

test result: FAILED. 48 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
