*** src/reflow.rs:831:13: delete match arm ")" | "]" | "}" in top_level_logical_op

*** mutation diff:
--- src/reflow.rs
+++ delete match arm ")" | "]" | "}" in top_level_logical_op
@@ -823,17 +823,17 @@
 
 /// The outermost logical operator present at bracket depth zero (`||` outranks `&&`), if any.
 fn top_level_logical_op(inner: &[Token]) -> Option<&'static str> {
     let mut depth = 0i32;
     let mut has_and = false;
     for t in inner {
         match t.text {
             "(" | "[" | "{" => depth += 1,
-            ")" | "]" | "}" => depth -= 1,
+             /* ~ changed by cargo-mutants ~ */
             "||" if depth == 0 && t.kind == TokenKind::Operator => return Some("||"),
             "&&" if depth == 0 && t.kind == TokenKind::Operator => has_and = true,
             _ => {}
         }
     }
     has_and.then_some("&&")
 }

*** result: Success
