*** src/reflow.rs:831:38: replace -= with /= in top_level_logical_op

*** mutation diff:
--- src/reflow.rs
+++ replace -= with /= in top_level_logical_op
@@ -823,17 +823,17 @@
 
 /// The outermost logical operator present at bracket depth zero (`||` outranks `&&`), if any.
 fn top_level_logical_op(inner: &[Token]) -> Option<&'static str> {
     let mut depth = 0i32;
     let mut has_and = false;
     for t in inner {
         match t.text {
             "(" | "[" | "{" => depth += 1,
-            ")" | "]" | "}" => depth -= 1,
+            ")" | "]" | "}" => depth /= /* ~ changed by cargo-mutants ~ */ 1,
             "||" if depth == 0 && t.kind == TokenKind::Operator => return Some("||"),
             "&&" if depth == 0 && t.kind == TokenKind::Operator => has_and = true,
             _ => {}
         }
     }
     has_and.then_some("&&")
 }

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (705865) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A({\"\";})\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:17.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")"
	successes: 0
	local rejects: 0
	global rejects: 0

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (705867) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A(\n\t{\n\t\t\"\";,\n\t}\n)\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:28.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")", width = 1
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
