*** src/reflow.rs:832:32: replace && with || in top_level_logical_op

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in top_level_logical_op
@@ -824,17 +824,17 @@
 /// The outermost logical operator present at bracket depth zero (`||` outranks `&&`), if any.
 fn top_level_logical_op(inner: &[Token]) -> Option<&'static str> {
     let mut depth = 0i32;
     let mut has_and = false;
     for t in inner {
         match t.text {
             "(" | "[" | "{" => depth += 1,
             ")" | "]" | "}" => depth -= 1,
-            "||" if depth == 0 && t.kind == TokenKind::Operator => return Some("||"),
+            "||" if depth == 0 || /* ~ changed by cargo-mutants ~ */ t.kind == TokenKind::Operator => return Some("||"),
             "&&" if depth == 0 && t.kind == TokenKind::Operator => has_and = true,
             _ => {}
         }
     }
     has_and.then_some("&&")
 }
 
 fn is_trivia(t: &Token) -> bool {

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (1054686) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"a(\n\t{\n\t\ta;,\n\t}\n)\n"`,
 right: `"a({\n\ta;\n})\n"` at tests/properties.rs:28.
minimal failing input: s = "a({a}\"\"\"\"\"\"[)", width = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (1054684) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"a({a;})\n"`,
 right: `"a({\n\ta;\n})\n"` at tests/properties.rs:17.
minimal failing input: s = "a({a}\"\"\"\"\"\"[)"
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
