*** src/reflow.rs:833:32: replace && with || in top_level_logical_op

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in top_level_logical_op
@@ -825,17 +825,17 @@
 fn top_level_logical_op(inner: &[Token]) -> Option<&'static str> {
     let mut depth = 0i32;
     let mut has_and = false;
     for t in inner {
         match t.text {
             "(" | "[" | "{" => depth += 1,
             ")" | "]" | "}" => depth -= 1,
             "||" if depth == 0 && t.kind == TokenKind::Operator => return Some("||"),
-            "&&" if depth == 0 && t.kind == TokenKind::Operator => has_and = true,
+            "&&" if depth == 0 || /* ~ changed by cargo-mutants ~ */ t.kind == TokenKind::Operator => has_and = true,
             _ => {}
         }
     }
     has_and.then_some("&&")
 }
 
 fn is_trivia(t: &Token) -> bool {
     matches!(t.kind, TokenKind::Whitespace | TokenKind::Newline)

*** result: Success
