*** src/reflow.rs:841:5: replace is_trivia -> bool with true

*** mutation diff:
--- src/reflow.rs
+++ replace is_trivia -> bool with true
@@ -833,17 +833,17 @@
             "&&" if depth == 0 && t.kind == TokenKind::Operator => has_and = true,
             _ => {}
         }
     }
     has_and.then_some("&&")
 }
 
 fn is_trivia(t: &Token) -> bool {
-    matches!(t.kind, TokenKind::Whitespace | TokenKind::Newline)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn contains_comment(toks: &[Token]) -> bool {
     toks.iter()
         .any(|t| matches!(t.kind, TokenKind::LineComment | TokenKind::BlockComment))
 }
 
 /// Whether `()`, `[]`, and `{}` are all balanced (never negative, net zero) in `toks`. Unbalanced

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (1057925) panicked at tests/conformance.rs:339:5:
assertion `left == right` failed
  left: "void f() {\n\tint a;\n\n\tint b;\n}\n"
 right: "void f(void) {\n\tint a;\n\n\tint b;\n}\n"

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (1057922) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: "struct s {\n\tint x:2;\n};\n"
 right: "struct s {\n\tint x: 2;\n};\n"

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (1057928) panicked at tests/conformance.rs:275:5:
assertion `left == right` failed
  left: "void f(){}\n"
 right: "void f(void) {}\n"

failures:
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    brace_attaches_for_functions_and_control
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    condition_splits_on_the_outer_logical_operator
    control_headers_are_not_calls

test result: FAILED. 14 passed; 39 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
