*** src/reflow.rs:841:5: replace is_trivia -> bool with false

*** mutation diff:
--- src/reflow.rs
+++ replace is_trivia -> bool with false
@@ -833,17 +833,17 @@
             "&&" if depth == 0 && t.kind == TokenKind::Operator => has_and = true,
             _ => {}
         }
     }
     has_and.then_some("&&")
 }
 
 fn is_trivia(t: &Token) -> bool {
-    matches!(t.kind, TokenKind::Whitespace | TokenKind::Newline)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn contains_comment(toks: &[Token]) -> bool {
     toks.iter()
         .any(|t| matches!(t.kind, TokenKind::LineComment | TokenKind::BlockComment))
 }
 
 /// Whether `()`, `[]`, and `{}` are all balanced (never negative, net zero) in `toks`. Unbalanced

---- casts_get_a_trailing_space stdout ----

thread 'casts_get_a_trailing_space' (710960) panicked at tests/conformance.rs:262:5:
assertion `left == right` failed
  left: "p = (void *)q;\n"
 right: "p = (void *) q;\n"

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (710962) panicked at tests/conformance.rs:137:5:
assertion `left == right` failed
  left: "foo(\n\ta, \n\tb\n);\n"
 right: "foo(a, b);\n"

---- collapses_initializer_without_trailing_comma stdout ----

thread 'collapses_initializer_without_trailing_comma' (710963) panicked at tests/conformance.rs:172:5:
assertion `left == right` failed
  left: "int v[] = {\n\t1, \n\t2, \n\t3\n};\n"
 right: "int v[] = {1, 2, 3};\n"

failures:
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    control_headers_are_not_calls
    declaration_with_brace_explodes_and_keeps_brace_attached
    enum_body_is_padded_when_flat
    enum_magic_comma_explodes
    for_header_is_not_treated_as_a_call
    function_like_macro_body_opens_on_define_line

test result: FAILED. 18 passed; 33 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
