*** src/reflow.rs:845:5: replace contains_comment -> bool with false

*** mutation diff:
--- src/reflow.rs
+++ replace contains_comment -> bool with false
@@ -837,18 +837,17 @@
     has_and.then_some("&&")
 }
 
 fn is_trivia(t: &Token) -> bool {
     matches!(t.kind, TokenKind::Whitespace | TokenKind::Newline)
 }
 
 fn contains_comment(toks: &[Token]) -> bool {
-    toks.iter()
-        .any(|t| matches!(t.kind, TokenKind::LineComment | TokenKind::BlockComment))
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Whether `()`, `[]`, and `{}` are all balanced (never negative, net zero) in `toks`. Unbalanced
 /// inner brackets defeat depth-aware splitting, so such a construct is unstructurable and is passed
 /// through verbatim rather than risk mis-splitting (which could accumulate commas across passes).
 fn is_balanced(toks: &[Token]) -> bool {
     let (mut paren, mut brack, mut brace) = (0i32, 0i32, 0i32);
     for t in toks {

---- call_with_line_comment_passes_through stdout ----

thread 'call_with_line_comment_passes_through' (1059701) panicked at tests/conformance.rs:217:5:
assertion `left == right` failed: comment-bearing calls must not be reflowed
  left: "f(// keep me NULL, &x);\n"
 right: "f(\n\t// keep me\n\tNULL,\n\t&x\n);\n"

failures:
    call_with_line_comment_passes_through

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
