*** src/reflow.rs:853:5: replace is_balanced -> bool with true

*** mutation diff:
--- src/reflow.rs
+++ replace is_balanced -> bool with true
@@ -845,35 +845,17 @@
     toks.iter()
         .any(|t| matches!(t.kind, TokenKind::LineComment | TokenKind::BlockComment))
 }
 
 /// Whether `()`, `[]`, and `{}` are all balanced (never negative, net zero) in `toks`. Unbalanced
 /// inner brackets defeat depth-aware splitting, so such a construct is unstructurable and is passed
 /// through verbatim rather than risk mis-splitting (which could accumulate commas across passes).
 fn is_balanced(toks: &[Token]) -> bool {
-    let (mut paren, mut brack, mut brace) = (0i32, 0i32, 0i32);
-    for t in toks {
-        if t.kind != TokenKind::Punct {
-            continue;
-        }
-        match t.text {
-            "(" => paren += 1,
-            ")" => paren -= 1,
-            "[" => brack += 1,
-            "]" => brack -= 1,
-            "{" => brace += 1,
-            "}" => brace -= 1,
-            _ => {}
-        }
-        if paren < 0 || brack < 0 || brace < 0 {
-            return false;
-        }
-    }
-    paren == 0 && brack == 0 && brace == 0
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Whether a `?` ternary operator appears at bracket depth zero in `inner`.
 fn has_top_level_question(inner: &[Token]) -> bool {
     let mut depth = 0i32;
     for t in inner {
         match t.text {
             "(" | "[" | "{" => depth += 1,

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (1060055) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"(? *AA0 : #)\n"`,
 right: `"(\n\t? *AA0 :\n\t#\n)\n"` at tests/properties.rs:28.
minimal failing input: s = "(?\t*AA0:#)\t", width = 12
	successes: 0
	local rejects: 0
	global rejects: 0

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (1060053) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"''.0a:aaa: 0\"\"._aa A#_aA\t_= 000.0 {\n\t__]_0A0a_A(00_0&(\"0a\tA]a\"A,,\n}]]a \"\t0 &&aaa&&]0#0_&AaA\ta_a\"0\t.\n"`,
 right: `"''.0a:aaa: 0\"\"._aa A#_aA\t_= 000.0 {\n\t__]_0A0a_A(00_0&(\"0a\tA]a\"A,\n}]]a \"\t0 &&aaa&&]0#0_&AaA\ta_a\"0\t.\n"` at tests/properties.rs:17.
minimal failing input: s = "''.0a:aaa:0\"\"._aa A#_aA\t_= 000.0 {__]_0A0a_A(00_0&(\"0a\tA]a\"A}]]a \"\t0 &&aaa&&]0#0_&AaA\ta_a\"0\t."
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
