*** src/reflow.rs:855:19: replace != with == in is_balanced

*** mutation diff:
--- src/reflow.rs
+++ replace != with == in is_balanced
@@ -847,17 +847,17 @@
 }
 
 /// Whether `()`, `[]`, and `{}` are all balanced (never negative, net zero) in `toks`. Unbalanced
 /// inner brackets defeat depth-aware splitting, so such a construct is unstructurable and is passed
 /// through verbatim rather than risk mis-splitting (which could accumulate commas across passes).
 fn is_balanced(toks: &[Token]) -> bool {
     let (mut paren, mut brack, mut brace) = (0i32, 0i32, 0i32);
     for t in toks {
-        if t.kind != TokenKind::Punct {
+        if t.kind == /* ~ changed by cargo-mutants ~ */ TokenKind::Punct {
             continue;
         }
         match t.text {
             "(" => paren += 1,
             ")" => paren -= 1,
             "[" => brack += 1,
             "]" => brack -= 1,
             "{" => brace += 1,

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (1061490) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"''.0a:aaa: 0\"\"._aa A#_aA\t_= 000.0 {\n\t__]_0A0a_A(00_0&(\"0a\tA]a\"A,,\n}]]a \"\t0 &&aaa&&]0#0_&AaA\ta_a\"0\t.\n"`,
 right: `"''.0a:aaa: 0\"\"._aa A#_aA\t_= 000.0 {\n\t__]_0A0a_A(00_0&(\"0a\tA]a\"A,\n}]]a \"\t0 &&aaa&&]0#0_&AaA\ta_a\"0\t.\n"` at tests/properties.rs:17.
minimal failing input: s = "''.0a:aaa:0\"\"._aa A#_aA\t_= 000.0 {__]_0A0a_A(00_0&(\"0a\tA]a\"A}]]a \"\t0 &&aaa&&]0#0_&AaA\ta_a\"0\t."
	successes: 0
	local rejects: 0
	global rejects: 0

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (1061492) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"''A\"\"\"a0Aa\"0A])a_\ta])._aa A#_aA\t_= 000.0 {\n\t__]_0A0a_A(00_0&(\"0a\tA]a\"A,,\n}]]a \"\t0 &&aaa&&]0#0_&AaA\ta_a\"0\t.\n"`,
 right: `"''A\"\"\"a0Aa\"0A])a_\ta])._aa A#_aA\t_= 000.0 {\n\t__]_0A0a_A(00_0&(\"0a\tA]a\"A,\n}]]a \"\t0 &&aaa&&]0#0_&AaA\ta_a\"0\t.\n"` at tests/properties.rs:28.
minimal failing input: s = "''A\"\"\"a0Aa\"0A])a_\ta])._aa A#_aA\t_= 000.0 {__]_0A0a_A(00_0&(\"0a\tA]a\"A}]]a \"\t0 &&aaa&&]0#0_&AaA\ta_a\"0\t.", width = 1
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
