*** src/reflow.rs:859:26: replace += with *= in is_balanced

*** mutation diff:
--- src/reflow.rs
+++ replace += with *= in is_balanced
@@ -851,17 +851,17 @@
 /// through verbatim rather than risk mis-splitting (which could accumulate commas across passes).
 fn is_balanced(toks: &[Token]) -> bool {
     let (mut paren, mut brack, mut brace) = (0i32, 0i32, 0i32);
     for t in toks {
         if t.kind != TokenKind::Punct {
             continue;
         }
         match t.text {
-            "(" => paren += 1,
+            "(" => paren *= /* ~ changed by cargo-mutants ~ */ 1,
             ")" => paren -= 1,
             "[" => brack += 1,
             "]" => brack -= 1,
             "{" => brace += 1,
             "}" => brace -= 1,
             _ => {}
         }
         if paren < 0 || brack < 0 || brace < 0 {

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (717471) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(&(struct config){.alpha = 1111111111, .beta = 2222222222, .gamma = 3333333333, .delta = 4444444444});\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (717474) panicked at tests/conformance.rs:302:5:
assertion `left == right` failed
  left: "dispatch(&(struct request){.id = 1234567, .kind = KIND_READ}, &response_buffer_out, default_timeout_ms);\n"
 right: "dispatch(\n\t&(struct request){.id = 1234567, .kind = KIND_READ},\n\t&response_buffer_out,\n\tdefault_timeout_ms\n);\n"

---- function_like_macro_body_opens_on_define_line stdout ----

thread 'function_like_macro_body_opens_on_define_line' (717484) panicked at tests/conformance.rs:410:5:
assertion `left == right` failed
  left: "#define DISPATCH_EVENT(handler, event) dispatch_incoming_event((handler), (event), read_monotonic_timestamp_ms(), current_execution_context_id())\n"
 right: "#define DISPATCH_EVENT(handler, event) dispatch_incoming_event( \\\n\t(handler), \\\n\t(event), \\\n\tread_monotonic_timestamp_ms(), \\\n\tcurrent_execution_context_id() \\\n)\n"

failures:
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literals_in_function_args
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    statement_expression_macro_blocks_with_continuations

test result: FAILED. 43 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
