*** src/reflow.rs:861:26: replace += with *= in is_balanced

*** mutation diff:
--- src/reflow.rs
+++ replace += with *= in is_balanced
@@ -853,17 +853,17 @@
     let (mut paren, mut brack, mut brace) = (0i32, 0i32, 0i32);
     for t in toks {
         if t.kind != TokenKind::Punct {
             continue;
         }
         match t.text {
             "(" => paren += 1,
             ")" => paren -= 1,
-            "[" => brack += 1,
+            "[" => brack *= /* ~ changed by cargo-mutants ~ */ 1,
             "]" => brack -= 1,
             "{" => brace += 1,
             "}" => brace -= 1,
             _ => {}
         }
         if paren < 0 || brack < 0 || brace < 0 {
             return false;
         }

*** result: Success
