*** src/reflow.rs:862:13: delete match arm "]" in is_balanced

*** mutation diff:
--- src/reflow.rs
+++ delete match arm "]" in is_balanced
@@ -854,17 +854,17 @@
     for t in toks {
         if t.kind != TokenKind::Punct {
             continue;
         }
         match t.text {
             "(" => paren += 1,
             ")" => paren -= 1,
             "[" => brack += 1,
-            "]" => brack -= 1,
+             /* ~ changed by cargo-mutants ~ */
             "{" => brace += 1,
             "}" => brace -= 1,
             _ => {}
         }
         if paren < 0 || brack < 0 || brace < 0 {
             return false;
         }
     }

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
proptest: Saving this and future failures in /tmp/cargo-mutants-c-format-01Z7wo.tmp/tests/properties.proptest-regressions
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file.
cc d843b777dba53ac2a905c6fb6abce7ab078bc5fb2b14e1c7d46e656a74412e10

thread 'idempotent_across_widths' (715445) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"A={\n\t],,\n}\"\"\".0\"A)\" \"\tAa'AA.\"A&\"_\"Aa\t\t(aa \"00.aaa\"0]&&AA0&  &\"a\"(_\t&&\t _0\t00a(\ta\t&&\n"`,
 right: `"A={\n\t],\n}\"\"\".0\"A)\" \"\tAa'AA.\"A&\"_\"Aa\t\t(aa \"00.aaa\"0]&&AA0&  &\"a\"(_\t&&\t _0\t00a(\ta\t&&\n"

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
proptest: Saving this and future failures in /tmp/cargo-mutants-c-format-01Z7wo.tmp/tests/properties.proptest-regressions
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file.
cc b2cd84e06b4b316c6cbf2cb591d669457bdc4c7fa85c5e53168afccca8329bfd

thread 'format_is_idempotent' (715442) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"_=\t a('AA aA\"&]&0\"_]]0_]a00A\". a0&0A_a'a(\t_Aa Aa_A{\n\t_a 0&\"]]&\t&]&A0a0\t#\t0\t Aa\t]0A00\"A 0000]&,,\n}a.0\n"`,
 right: `"_=\t a('AA aA\"&]&0\"_]]0_]a00A\". a0&0A_a'a(\t_Aa Aa_A{\n\t_a 0&\"]]&\t&]&A0a0\t#\t0\t Aa\t]0A00\"A 0000]&,\

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
