*** src/reflow.rs:862:26: replace -= with += in is_balanced

*** mutation diff:
--- src/reflow.rs
+++ replace -= with += in is_balanced
@@ -854,17 +854,17 @@
     for t in toks {
         if t.kind != TokenKind::Punct {
             continue;
         }
         match t.text {
             "(" => paren += 1,
             ")" => paren -= 1,
             "[" => brack += 1,
-            "]" => brack -= 1,
+            "]" => brack += /* ~ changed by cargo-mutants ~ */ 1,
             "{" => brace += 1,
             "}" => brace -= 1,
             _ => {}
         }
         if paren < 0 || brack < 0 || brace < 0 {
             return false;
         }
     }

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (719826) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A(\n\t{\n\t\t\"\";,\n\t}\n)\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:28.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")", width = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (719824) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A({\"\";})\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:17.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")"
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
