*** src/reflow.rs:862:26: replace -= with /= in is_balanced

*** mutation diff:
--- src/reflow.rs
+++ replace -= with /= in is_balanced
@@ -854,17 +854,17 @@
     for t in toks {
         if t.kind != TokenKind::Punct {
             continue;
         }
         match t.text {
             "(" => paren += 1,
             ")" => paren -= 1,
             "[" => brack += 1,
-            "]" => brack -= 1,
+            "]" => brack /= /* ~ changed by cargo-mutants ~ */ 1,
             "{" => brace += 1,
             "}" => brace -= 1,
             _ => {}
         }
         if paren < 0 || brack < 0 || brace < 0 {
             return false;
         }
     }

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
proptest: Saving this and future failures in /tmp/cargo-mutants-c-format-VApY9p.tmp/tests/properties.proptest-regressions
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file.
cc 18bc7d01b61e398a0478f8e35e87f9cec1640e0baf4b857c2a42e3c46898864d

thread 'idempotent_across_widths' (720197) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"=\"\"\"\"''\"\"{\n\t\"\"]*AA(_000_)A&0_ aA,,\n}aa]A.a0_\n"`,
 right: `"=\"\"\"\"''\"\"{\n\t\"\"]*AA(_000_)A&0_ aA,\n}aa]A.a0_\n"` at tests/properties.rs:28.
minimal failing input: s = "=\"\"\"\"''\"\"{\"\"]*AA(_000_)A&0_ aA}aa]A.a0_

failures:
    idempotent_across_widths

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
