*** src/reflow.rs:867:18: replace < with == in is_balanced

*** mutation diff:
--- src/reflow.rs
+++ replace < with == in is_balanced
@@ -859,17 +859,17 @@
             "(" => paren += 1,
             ")" => paren -= 1,
             "[" => brack += 1,
             "]" => brack -= 1,
             "{" => brace += 1,
             "}" => brace -= 1,
             _ => {}
         }
-        if paren < 0 || brack < 0 || brace < 0 {
+        if paren == /* ~ changed by cargo-mutants ~ */ 0 || brack < 0 || brace < 0 {
             return false;
         }
     }
     paren == 0 && brack == 0 && brace == 0
 }
 
 /// Whether a `?` ternary operator appears at bracket depth zero in `inner`.
 fn has_top_level_question(inner: &[Token]) -> bool {

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (1071992) panicked at tests/conformance.rs:137:5:
assertion `left == right` failed
  left: "foo(\n\ta,\n\tb\n);\n"
 right: "foo(a, b);\n"

---- collapses_initializer_without_trailing_comma stdout ----

thread 'collapses_initializer_without_trailing_comma' (1071993) panicked at tests/conformance.rs:172:5:
assertion `left == right` failed
  left: "int v[] = {\n\t1,\n\t2,\n\t3\n};\n"
 right: "int v[] = {1, 2, 3};\n"

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (1071994) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(&(struct config){.alpha = 1111111111, .beta = 2222222222, .gamma = 3333333333, .delta = 4444444444});\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

failures:
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    condition_splits_on_the_outer_logical_operator
    declaration_with_brace_explodes_and_keeps_brace_attached
    enum_magic_comma_explodes
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 32 passed; 21 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
