*** src/reflow.rs:867:22: replace || with && in is_balanced

*** mutation diff:
--- src/reflow.rs
+++ replace || with && in is_balanced
@@ -859,17 +859,17 @@
             "(" => paren += 1,
             ")" => paren -= 1,
             "[" => brack += 1,
             "]" => brack -= 1,
             "{" => brace += 1,
             "}" => brace -= 1,
             _ => {}
         }
-        if paren < 0 || brack < 0 || brace < 0 {
+        if paren < 0 && /* ~ changed by cargo-mutants ~ */ brack < 0 || brace < 0 {
             return false;
         }
     }
     paren == 0 && brack == 0 && brace == 0
 }
 
 /// Whether a `?` ternary operator appears at bracket depth zero in `inner`.
 fn has_top_level_question(inner: &[Token]) -> bool {

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (1071876) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"(? *AA0 : #)\n"`,
 right: `"(\n\t? *AA0 :\n\t#\n)\n"` at tests/properties.rs:28.
minimal failing input: s = "(?\t*AA0:#)\t", width = 12
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    idempotent_across_widths

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
