*** src/reflow.rs:867:35: replace || with && in is_balanced

*** mutation diff:
--- src/reflow.rs
+++ replace || with && in is_balanced
@@ -859,17 +859,17 @@
             "(" => paren += 1,
             ")" => paren -= 1,
             "[" => brack += 1,
             "]" => brack -= 1,
             "{" => brace += 1,
             "}" => brace -= 1,
             _ => {}
         }
-        if paren < 0 || brack < 0 || brace < 0 {
+        if paren < 0 || brack < 0 && /* ~ changed by cargo-mutants ~ */ brace < 0 {
             return false;
         }
     }
     paren == 0 && brack == 0 && brace == 0
 }
 
 /// Whether a `?` ternary operator appears at bracket depth zero in `inner`.
 fn has_top_level_question(inner: &[Token]) -> bool {

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (722765) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"''\n0_ a#aa(\n\t*&0_a&a0 *\n)\"a.0aA0 a&A&aa\n A_a0  0a&Aa0.\t_ 0.A Aa.0a0a.aA \t&_a0 0&\"\t0Aa.\".00]A0\n]A&\n"`,
 right: `"''\n0_ a#aa(*&0_a&a0 *)\"a.0aA0 a&A&aa\n A_a0  0a&Aa0.\t_ 0.A Aa.0a0a.aA \t&_a0 0&\"\t0Aa.\".00]A0\n]A&\n"` at tests/properties.rs:17.
minimal failing input: s = "''\n0_ a#aa(*&0_a&a0\t*)\"a.0aA0 a&A&aa\n A_a0  0a&Aa0.\t_ 0.A Aa.0a0a.aA \t&_a0 0&\"\t0Aa.\".00]A0\n]A&"
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
