*** src/reflow.rs:867:44: replace < with > in is_balanced

*** mutation diff:
--- src/reflow.rs
+++ replace < with > in is_balanced
@@ -859,17 +859,17 @@
             "(" => paren += 1,
             ")" => paren -= 1,
             "[" => brack += 1,
             "]" => brack -= 1,
             "{" => brace += 1,
             "}" => brace -= 1,
             _ => {}
         }
-        if paren < 0 || brack < 0 || brace < 0 {
+        if paren < 0 || brack < 0 || brace > /* ~ changed by cargo-mutants ~ */ 0 {
             return false;
         }
     }
     paren == 0 && brack == 0 && brace == 0
 }
 
 /// Whether a `?` ternary operator appears at bracket depth zero in `inner`.
 fn has_top_level_question(inner: &[Token]) -> bool {

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (727528) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(&(struct config){.alpha = 1111111111, .beta = 2222222222, .gamma = 3333333333, .delta = 4444444444});\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (727530) panicked at tests/conformance.rs:403:5:
assertion `left == right` failed
  left: "p = &(struct shape){.tag = R, .rect = {.w = 3, .h = 4},};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (727531) panicked at tests/conformance.rs:302:5:
assertion `left == right` failed
  left: "dispatch(&(struct request){.id = 1234567, .kind = KIND_READ}, &response_buffer_out, default_timeout_ms);\n"
 right: "dispatch(\n\t&(struct request){.id = 1234567, .kind = KIND_READ},\n\t&response_buffer_out,\n\tdefault_timeout_ms\n);\n"

failures:
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    nested_initializer_collapses_independently

test result: FAILED. 47 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
