*** src/reflow.rs:871:11: replace == with != in is_balanced

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in is_balanced
@@ -863,17 +863,17 @@
             "{" => brace += 1,
             "}" => brace -= 1,
             _ => {}
         }
         if paren < 0 || brack < 0 || brace < 0 {
             return false;
         }
     }
-    paren == 0 && brack == 0 && brace == 0
+    paren != /* ~ changed by cargo-mutants ~ */ 0 && brack == 0 && brace == 0
 }
 
 /// Whether a `?` ternary operator appears at bracket depth zero in `inner`.
 fn has_top_level_question(inner: &[Token]) -> bool {
     let mut depth = 0i32;
     for t in inner {
         match t.text {
             "(" | "[" | "{" => depth += 1,

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (1077883) panicked at tests/conformance.rs:276:5:
assertion `left == right` failed
  left: "if(x) {}\n"
 right: "if (x) {}\n"

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (1077886) panicked at tests/conformance.rs:137:5:
assertion `left == right` failed
  left: "foo(\n\ta,\n\tb\n);\n"
 right: "foo(a, b);\n"

---- collapses_initializer_without_trailing_comma stdout ----

thread 'collapses_initializer_without_trailing_comma' (1077887) panicked at tests/conformance.rs:172:5:
assertion `left == right` failed
  left: "int v[] = {\n\t1,\n\t2,\n\t3\n};\n"
 right: "int v[] = {1, 2, 3};\n"

failures:
    brace_attaches_for_functions_and_control
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    condition_splits_on_the_outer_logical_operator
    control_keyword_gets_one_space_before_paren
    declaration_with_brace_explodes_and_keeps_brace_attached
    enum_magic_comma_explodes
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line

test result: FAILED. 30 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
