*** src/reflow.rs:871:30: replace && with || in is_balanced

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in is_balanced
@@ -863,17 +863,17 @@
             "{" => brace += 1,
             "}" => brace -= 1,
             _ => {}
         }
         if paren < 0 || brack < 0 || brace < 0 {
             return false;
         }
     }
-    paren == 0 && brack == 0 && brace == 0
+    paren == 0 && brack == 0 || /* ~ changed by cargo-mutants ~ */ brace == 0
 }
 
 /// Whether a `?` ternary operator appears at bracket depth zero in `inner`.
 fn has_top_level_question(inner: &[Token]) -> bool {
     let mut depth = 0i32;
     for t in inner {
         match t.text {
             "(" | "[" | "{" => depth += 1,

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (1076743) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"a(\n\t{\n\t\ta;,\n\t}\n)\n"`,
 right: `"a({\n\ta;\n})\n"` at tests/properties.rs:28.
minimal failing input: s = "a({a}\"\"\"\"\"\"])", width = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (1076741) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"a({a;})\n"`,
 right: `"a({\n\ta;\n})\n"` at tests/properties.rs:17.
minimal failing input: s = "a({a}\"\"\"\"\"\"])"
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
