*** src/reflow.rs:876:5: replace has_top_level_question -> bool with true

*** mutation diff:
--- src/reflow.rs
+++ replace has_top_level_question -> bool with true
@@ -868,26 +868,17 @@
             return false;
         }
     }
     paren == 0 && brack == 0 && brace == 0
 }
 
 /// Whether a `?` ternary operator appears at bracket depth zero in `inner`.
 fn has_top_level_question(inner: &[Token]) -> bool {
-    let mut depth = 0i32;
-    for t in inner {
-        match t.text {
-            "(" | "[" | "{" => depth += 1,
-            ")" | "]" | "}" => depth -= 1,
-            "?" if depth == 0 && t.kind == TokenKind::Punct => return true,
-            _ => {}
-        }
-    }
-    false
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Build the document for a parenthesized ternary chain: split on the depth-zero `:`, each
 /// `cond ? val` segment carrying a trailing ` :` when broken, flat otherwise (§2.4).
 fn build_ternary_doc(inner: &[Token]) -> Doc {
     let segments = split_top_level(inner, |t| t.kind == TokenKind::Punct && t.text == ":")
         .iter()
         .map(|s| render_segment(s))

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (731593) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A(\n\t{\n\t\t\"\";,\n\t}\n)\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:28.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")", width = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (731591) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A({\"\";})\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:17.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")"
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
