*** src/reflow.rs:876:5: replace has_top_level_question -> bool with false

*** mutation diff:
--- src/reflow.rs
+++ replace has_top_level_question -> bool with false
@@ -868,26 +868,17 @@
             return false;
         }
     }
     paren == 0 && brack == 0 && brace == 0
 }
 
 /// Whether a `?` ternary operator appears at bracket depth zero in `inner`.
 fn has_top_level_question(inner: &[Token]) -> bool {
-    let mut depth = 0i32;
-    for t in inner {
-        match t.text {
-            "(" | "[" | "{" => depth += 1,
-            ")" | "]" | "}" => depth -= 1,
-            "?" if depth == 0 && t.kind == TokenKind::Punct => return true,
-            _ => {}
-        }
-    }
-    false
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Build the document for a parenthesized ternary chain: split on the depth-zero `:`, each
 /// `cond ? val` segment carrying a trailing ` :` when broken, flat otherwise (§2.4).
 fn build_ternary_doc(inner: &[Token]) -> Doc {
     let segments = split_top_level(inner, |t| t.kind == TokenKind::Punct && t.text == ":")
         .iter()
         .map(|s| render_segment(s))

---- long_ternary_chain_explodes_flat_with_trailing_colons stdout ----

thread 'long_ternary_chain_explodes_flat_with_trailing_colons' (732005) panicked at tests/conformance.rs:472:5:
assertion `left == right` failed
  left: "return (status_code == 0 ? \"ok\" : status_code == 1 ? \"busy\" : status_code == 2 ? \"error\" : status_code < 0 ? \"fault\" : \"unknown\");\n"
 right: "return (\n\tstatus_code == 0 ? \"ok\" :\n\tstatus_code == 1 ? \"busy\" :\n\tstatus_code == 2 ? \"error\" :\n\tstatus_code < 0 ? \"fault\" :\n\t\"unknown\"\n);\n"

failures:
    long_ternary_chain_explodes_flat_with_trailing_colons

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
