*** src/reflow.rs:879:13: delete match arm "(" | "[" | "{" in has_top_level_question

*** mutation diff:
--- src/reflow.rs
+++ delete match arm "(" | "[" | "{" in has_top_level_question
@@ -871,17 +871,17 @@
     paren == 0 && brack == 0 && brace == 0
 }
 
 /// Whether a `?` ternary operator appears at bracket depth zero in `inner`.
 fn has_top_level_question(inner: &[Token]) -> bool {
     let mut depth = 0i32;
     for t in inner {
         match t.text {
-            "(" | "[" | "{" => depth += 1,
+             /* ~ changed by cargo-mutants ~ */
             ")" | "]" | "}" => depth -= 1,
             "?" if depth == 0 && t.kind == TokenKind::Punct => return true,
             _ => {}
         }
     }
     false
 }

*** result: Success
