*** src/reflow.rs:881:26: replace == with != in has_top_level_question

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in has_top_level_question
@@ -873,17 +873,17 @@
 
 /// Whether a `?` ternary operator appears at bracket depth zero in `inner`.
 fn has_top_level_question(inner: &[Token]) -> bool {
     let mut depth = 0i32;
     for t in inner {
         match t.text {
             "(" | "[" | "{" => depth += 1,
             ")" | "]" | "}" => depth -= 1,
-            "?" if depth == 0 && t.kind == TokenKind::Punct => return true,
+            "?" if depth != /* ~ changed by cargo-mutants ~ */ 0 && t.kind == TokenKind::Punct => return true,
             _ => {}
         }
     }
     false
 }
 
 /// Build the document for a parenthesized ternary chain: split on the depth-zero `:`, each
 /// `cond ? val` segment carrying a trailing ` :` when broken, flat otherwise (§2.4).

---- long_ternary_chain_explodes_flat_with_trailing_colons stdout ----

thread 'long_ternary_chain_explodes_flat_with_trailing_colons' (1085024) panicked at tests/conformance.rs:487:5:
assertion `left == right` failed
  left: "return (status_code == 0 ? \"ok\" : status_code == 1 ? \"busy\" : status_code == 2 ? \"error\" : status_code < 0 ? \"fault\" : \"unknown\");\n"
 right: "return (\n\tstatus_code == 0 ? \"ok\" :\n\tstatus_code == 1 ? \"busy\" :\n\tstatus_code == 2 ? \"error\" :\n\tstatus_code < 0 ? \"fault\" :\n\t\"unknown\"\n);\n"

failures:
    long_ternary_chain_explodes_flat_with_trailing_colons

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
