*** src/reflow.rs:881:31: replace && with || in has_top_level_question

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in has_top_level_question
@@ -873,17 +873,17 @@
 
 /// Whether a `?` ternary operator appears at bracket depth zero in `inner`.
 fn has_top_level_question(inner: &[Token]) -> bool {
     let mut depth = 0i32;
     for t in inner {
         match t.text {
             "(" | "[" | "{" => depth += 1,
             ")" | "]" | "}" => depth -= 1,
-            "?" if depth == 0 && t.kind == TokenKind::Punct => return true,
+            "?" if depth == 0 || /* ~ changed by cargo-mutants ~ */ t.kind == TokenKind::Punct => return true,
             _ => {}
         }
     }
     false
 }
 
 /// Build the document for a parenthesized ternary chain: split on the depth-zero `:`, each
 /// `cond ? val` segment carrying a trailing ` :` when broken, flat otherwise (§2.4).

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (736167) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"''\n0_ a#aa(\n\t*&0_a&a0 *\n)\"a.0aA0 a&A&aa\n A_a0  0a&Aa0.\t_ 0.A Aa.0a0a.aA \t&_a0 0&\"\t0Aa.\".00]A0\n]A&\n"`,
 right: `"''\n0_ a#aa(*&0_a&a0 *)\"a.0aA0 a&A&aa\n A_a0  0a&Aa0.\t_ 0.A Aa.0a0a.aA \t&_a0 0&\"\t0Aa.\".00]A0\n]A&\n"` at tests/properties.rs:17.
minimal failing input: s = "''\n0_ a#aa(*&0_a&a0\t*)\"a.0aA0 a&A&aa\n A_a0  0a&Aa0.\t_ 0.A Aa.0a0a.aA \t&_a0 0&\"\t0Aa.\".00]A0\n]A&"
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
