*** src/reflow.rs:88:5: replace is_type_context -> bool with true

*** mutation diff:
--- src/reflow.rs
+++ replace is_type_context -> bool with true
@@ -80,34 +80,17 @@
     out.push_str(&line);
     out
 }
 
 /// A C type keyword or qualifier — a token after which a `*` is confidently a pointer declarator,
 /// not a multiply. User typedefs (idents) are excluded, so ambiguous `a*b`/`foo*p` pass through
 /// (§2.5 pointers, §6 "prefer passthrough when ambiguous").
 fn is_type_context(text: &str) -> bool {
-    matches!(
-        text,
-        "void"
-            | "char"
-            | "short"
-            | "int"
-            | "long"
-            | "float"
-            | "double"
-            | "signed"
-            | "unsigned"
-            | "_Bool"
-            | "bool"
-            | "const"
-            | "volatile"
-            | "_Atomic"
-            | "restrict"
-    )
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// A significant token paired with the whitespace that preceded it.
 type Piece<'src> = (String, Token<'src>);
 
 fn same_line(gap: &str) -> bool {
     !gap.contains('\n')
 }

---- ambiguous_star_is_left_alone stdout ----

thread 'ambiguous_star_is_left_alone' (464856) panicked at tests/conformance.rs:242:5:
assertion `left == right` failed
  left: "z = a * b;\n"
 right: "z = a*b;\n"

---- function_pointer_star_is_not_spaced stdout ----

thread 'function_pointer_star_is_not_spaced' (464879) panicked at tests/conformance.rs:250:5:
assertion `left == right` failed
  left: "int ( * cb)(void);\n"
 right: "int (*cb)(void);\n"

---- nested_paren_comma_is_not_a_split_point stdout ----

thread 'nested_paren_comma_is_not_a_split_point' (464894) panicked at tests/conformance.rs:143:5:
assertion `left == right` failed: inner comma must stay inside the nested parens
  left: "register_cb(int ( * cb)(void * ctx, int status), int n);\n"
 right: "register_cb(int (*cb)(void * ctx, int status), int n);\n"

failures:
    ambiguous_star_is_left_alone
    function_pointer_star_is_not_spaced
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    nested_paren_comma_is_not_a_split_point
    statement_expression_in_code_block_indents

test result: FAILED. 45 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
