*** src/reflow.rs:891:54: replace == with != in build_ternary_doc

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in build_ternary_doc
@@ -883,17 +883,17 @@
         }
     }
     false
 }
 
 /// Build the document for a parenthesized ternary chain: split on the depth-zero `:`, each
 /// `cond ? val` segment carrying a trailing ` :` when broken, flat otherwise (§2.4).
 fn build_ternary_doc(inner: &[Token]) -> Doc {
-    let segments = split_top_level(inner, |t| t.kind == TokenKind::Punct && t.text == ":")
+    let segments = split_top_level(inner, |t| t.kind != /* ~ changed by cargo-mutants ~ */ TokenKind::Punct && t.text == ":")
         .iter()
         .map(|s| render_segment(s))
         .collect();
     build_clause_group(segments, " :")
 }
 
 /// A segment's text: its non-trivia tokens with runs of whitespace collapsed to one space.
 fn render_segment(toks: &[Token]) -> String {

---- long_ternary_chain_explodes_flat_with_trailing_colons stdout ----

thread 'long_ternary_chain_explodes_flat_with_trailing_colons' (738674) panicked at tests/conformance.rs:472:5:
assertion `left == right` failed
  left: "return (\n\tstatus_code == 0 ? \"ok\" : status_code == 1 ? \"busy\" : status_code == 2 ? \"error\" : status_code < 0 ? \"fault\" : \"unknown\"\n);\n"
 right: "return (\n\tstatus_code == 0 ? \"ok\" :\n\tstatus_code == 1 ? \"busy\" :\n\tstatus_code == 2 ? \"error\" :\n\tstatus_code < 0 ? \"fault\" :\n\t\"unknown\"\n);\n"

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (738667) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (738665) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    long_ternary_chain_explodes_flat_with_trailing_colons

test result: FAILED. 48 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
