*** src/reflow.rs:891:74: replace && with || in build_ternary_doc

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in build_ternary_doc
@@ -883,17 +883,17 @@
         }
     }
     false
 }
 
 /// Build the document for a parenthesized ternary chain: split on the depth-zero `:`, each
 /// `cond ? val` segment carrying a trailing ` :` when broken, flat otherwise (§2.4).
 fn build_ternary_doc(inner: &[Token]) -> Doc {
-    let segments = split_top_level(inner, |t| t.kind == TokenKind::Punct && t.text == ":")
+    let segments = split_top_level(inner, |t| t.kind == TokenKind::Punct || /* ~ changed by cargo-mutants ~ */ t.text == ":")
         .iter()
         .map(|s| render_segment(s))
         .collect();
     build_clause_group(segments, " :")
 }
 
 /// A segment's text: its non-trivia tokens with runs of whitespace collapsed to one space.
 fn render_segment(toks: &[Token]) -> String {

---- long_ternary_chain_explodes_flat_with_trailing_colons stdout ----

thread 'long_ternary_chain_explodes_flat_with_trailing_colons' (738357) panicked at tests/conformance.rs:472:5:
assertion `left == right` failed
  left: "return (\n\tstatus_code == 0 :\n\t\"ok\" :\n\tstatus_code == 1 :\n\t\"busy\" :\n\tstatus_code == 2 :\n\t\"error\" :\n\tstatus_code :\n\t0 :\n\t\"fault\" :\n\t\"unknown\"\n);\n"
 right: "return (\n\tstatus_code == 0 ? \"ok\" :\n\tstatus_code == 1 ? \"busy\" :\n\tstatus_code == 2 ? \"error\" :\n\tstatus_code < 0 ? \"fault\" :\n\t\"unknown\"\n);\n"

---- short_parenthesized_ternary_stays_flat stdout ----

thread 'short_parenthesized_ternary_stays_flat' (738368) panicked at tests/conformance.rs:456:5:
assertion `left == right` failed
  left: "x = (b != 0 : b : 1);\n"
 right: "x = (b != 0 ? b : 1);\n"

---- messy_real_world_input_is_idempotent_and_safe stdout ----

thread 'messy_real_world_input_is_idempotent_and_safe' (738359) panicked at tests/conformance.rs:70:5:
assertion `left == right` failed: must be idempotent on messy input

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    long_ternary_chain_explodes_flat_with_trailing_colons
    messy_real_world_input_is_idempotent_and_safe
    short_parenthesized_ternary_stays_flat
    showcase_content_is_preserved

test result: FAILED. 44 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
