*** src/reflow.rs:900:5: replace render_segment -> String with "xyzzy".into()

*** mutation diff:
--- src/reflow.rs
+++ replace render_segment -> String with "xyzzy".into()
@@ -892,32 +892,17 @@
         .iter()
         .map(|s| render_segment(s))
         .collect();
     build_clause_group(segments, " :")
 }
 
 /// A segment's text: its non-trivia tokens with runs of whitespace collapsed to one space.
 fn render_segment(toks: &[Token]) -> String {
-    let mut s = String::new();
-    let mut pending_space = false;
-    for t in toks {
-        if is_trivia(t) {
-            if !s.is_empty() {
-                pending_space = true;
-            }
-        } else {
-            if pending_space {
-                s.push(' ');
-                pending_space = false;
-            }
-            s.push_str(t.text);
-        }
-    }
-    s
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Build the §2.2 document for a call's argument list, including the surrounding parens. Each
 /// argument is built recursively (via [`build_element_doc`]), so a compound-literal argument's
 /// `{...}` is a nested group that can collapse or explode on its own.
 fn build_call_doc(inner: &[Token]) -> Doc {
     if !is_balanced(inner) {
         return Doc::Text(format!("({})", render_segment(inner)));

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (1087997) panicked at tests/conformance.rs:276:5:
assertion `left == right` failed
  left: "if (xyzzy) {}\n"
 right: "if (x) {}\n"

---- condition_splits_on_the_outer_logical_operator stdout ----

thread 'condition_splits_on_the_outer_logical_operator' (1088007) panicked at tests/conformance.rs:396:5:
assertion `left == right` failed
  left: "if (xyzzy || xyzzy || xyzzy || xyzzy || xyzzy) {\n}\n"
 right: "if (\n\talpha_value > 100 ||\n\tbravo_value > 200 ||\n\tcharlie_value > 300 ||\n\tdelta_value > 400 ||\n\techo_v > 5\n) {\n}\n"

---- control_headers_are_not_calls stdout ----

thread 'control_headers_are_not_calls' (1088008) panicked at tests/conformance.rs:153:5:
assertion `left == right` failed
  left: "if (xyzzy && xyzzy) { return f(x); }\n"
 right: "if (a && b) { return f(x); }\n"

failures:
    brace_attaches_for_functions_and_control
    condition_splits_on_the_outer_logical_operator
    control_headers_are_not_calls
    control_keyword_gets_one_space_before_paren
    for_header_is_not_treated_as_a_call
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    long_for_header_explodes_one_clause_per_line
    long_if_condition_explodes_with_trailing_operators
    long_ternary_chain_explodes_flat_with_trailing_colons
    messy_real_world_input_is_idempotent_and_safe

test result: FAILED. 36 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
