*** src/reflow.rs:904:16: delete ! in render_segment

*** mutation diff:
--- src/reflow.rs
+++ delete ! in render_segment
@@ -896,17 +896,17 @@
 }
 
 /// A segment's text: its non-trivia tokens with runs of whitespace collapsed to one space.
 fn render_segment(toks: &[Token]) -> String {
     let mut s = String::new();
     let mut pending_space = false;
     for t in toks {
         if is_trivia(t) {
-            if !s.is_empty() {
+            if  /* ~ changed by cargo-mutants ~ */s.is_empty() {
                 pending_space = true;
             }
         } else {
             if pending_space {
                 s.push(' ');
                 pending_space = false;
             }
             s.push_str(t.text);

---- control_headers_are_not_calls stdout ----

thread 'control_headers_are_not_calls' (740601) panicked at tests/conformance.rs:153:5:
assertion `left == right` failed
  left: "if (a &&  b) { return f(x); }\n"
 right: "if (a && b) { return f(x); }\n"

---- for_header_is_not_treated_as_a_call stdout ----

thread 'for_header_is_not_treated_as_a_call' (740609) panicked at tests/conformance.rs:396:5:
assertion `left == right` failed
  left: "for (inti=0,j=N-1;  i<j;  i++,j--) {\n}\n"
 right: "for (int i = 0, j = N - 1; i < j; i++, j--) {\n}\n"

---- long_for_header_explodes_one_clause_per_line stdout ----

thread 'long_for_header_explodes_one_clause_per_line' (740620) panicked at tests/conformance.rs:382:5:
assertion `left == right` failed
  left: "for (\n\tsize_tcurrent_sample_index=0;\n\t current_sample_index<total_number_of_samples;\n\t current_sample_index++\n) {\n}\n"
 right: "for (\n\tsize_t current_sample_index = 0;\n\tcurrent_sample_index < total_number_of_samples;\n\tcurrent_sample_index++\n) {\n}\n"

failures:
    control_headers_are_not_calls
    for_header_is_not_treated_as_a_call
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    long_for_header_explodes_one_clause_per_line
    long_if_condition_explodes_with_trailing_operators
    long_ternary_chain_explodes_flat_with_trailing_colons
    messy_real_world_input_is_idempotent_and_safe
    short_control_headers_unchanged
    short_parenthesized_ternary_stays_flat
    statement_expression_in_code_block_indents

test result: FAILED. 38 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
