*** src/reflow.rs:922:8: delete ! in build_call_doc

*** mutation diff:
--- src/reflow.rs
+++ delete ! in build_call_doc
@@ -914,17 +914,17 @@
     }
     s
 }
 
 /// Build the §2.2 document for a call's argument list, including the surrounding parens. Each
 /// argument is built recursively (via [`build_element_doc`]), so a compound-literal argument's
 /// `{...}` is a nested group that can collapse or explode on its own.
 fn build_call_doc(inner: &[Token]) -> Doc {
-    if !is_balanced(inner) {
+    if  /* ~ changed by cargo-mutants ~ */is_balanced(inner) {
         return Doc::Text(format!("({})", render_segment(inner)));
     }
     let args: Vec<&[Token]> = split_on_commas(inner)
         .into_iter()
         .filter(|a| a.iter().any(|t| !is_trivia(t)))
         .collect();
     if args.is_empty() {
         return Doc::text("()");

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (741407) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(&(struct config){.alpha = 1111111111, .beta = 2222222222, .gamma = 3333333333, .delta = 4444444444});\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (741410) panicked at tests/conformance.rs:302:5:
assertion `left == right` failed
  left: "dispatch(&(struct request){.id = 1234567, .kind = KIND_READ}, &response_buffer_out, default_timeout_ms);\n"
 right: "dispatch(\n\t&(struct request){.id = 1234567, .kind = KIND_READ},\n\t&response_buffer_out,\n\tdefault_timeout_ms\n);\n"

---- declaration_with_brace_explodes_and_keeps_brace_attached stdout ----

thread 'declaration_with_brace_explodes_and_keeps_brace_attached' (741414) panicked at tests/conformance.rs:479:5:
assertion `left == right` failed
  left: "static int do_something_with_a_long_name(int first_parameter, int second_parameter, int third_parameter) {\n"
 right: "static int do_something_with_a_long_name(\n\tint first_parameter,\n\tint second_parameter,\n\tint third_parameter\n) {\n"

failures:
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literals_in_function_args
    declaration_with_brace_explodes_and_keeps_brace_attached
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    long_call_explodes_one_per_line

test result: FAILED. 43 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
