*** src/reflow.rs:927:38: delete ! in build_call_doc

*** mutation diff:
--- src/reflow.rs
+++ delete ! in build_call_doc
@@ -919,17 +919,17 @@
 /// argument is built recursively (via [`build_element_doc`]), so a compound-literal argument's
 /// `{...}` is a nested group that can collapse or explode on its own.
 fn build_call_doc(inner: &[Token]) -> Doc {
     if !is_balanced(inner) {
         return Doc::Text(format!("({})", render_segment(inner)));
     }
     let args: Vec<&[Token]> = split_on_commas(inner)
         .into_iter()
-        .filter(|a| a.iter().any(|t| !is_trivia(t)))
+        .filter(|a| a.iter().any(|t|  /* ~ changed by cargo-mutants ~ */is_trivia(t)))
         .collect();
     if args.is_empty() {
         return Doc::text("()");
     }
     let last = args.len() - 1;
     let mut items = vec![Doc::SoftLine];
     for (idx, arg) in args.into_iter().enumerate() {
         items.push(build_element_doc(arg));

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (741325) panicked at tests/conformance.rs:339:5:
assertion `left == right` failed
  left: "void f() {\n\tint a;\n\n\tint b;\n}\n"
 right: "void f(void) {\n\tint a;\n\n\tint b;\n}\n"

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (741327) panicked at tests/conformance.rs:275:5:
assertion `left == right` failed
  left: "void f() {}\n"
 right: "void f(void) {}\n"

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (741335) panicked at tests/conformance.rs:295:5:
assertion `left == right` failed
  left: "register_handler((struct event){.type = T, .data = d}, priority);\n"
 right: "register_handler(handler, (struct event){.type = T, .data = d}, priority);\n"

failures:
    blank_line_runs_collapse_to_one_everywhere
    brace_attaches_for_functions_and_control
    compound_literals_in_function_args
    control_headers_are_not_calls
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    indentation_is_normalized_to_tabs
    long_call_explodes_one_per_line
    messy_real_world_input_is_idempotent_and_safe

test result: FAILED. 36 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
