*** src/reflow.rs:932:27: replace - with + in build_call_doc

*** mutation diff:
--- src/reflow.rs
+++ replace - with + in build_call_doc
@@ -924,17 +924,17 @@
     }
     let args: Vec<&[Token]> = split_on_commas(inner)
         .into_iter()
         .filter(|a| a.iter().any(|t| !is_trivia(t)))
         .collect();
     if args.is_empty() {
         return Doc::text("()");
     }
-    let last = args.len() - 1;
+    let last = args.len() + /* ~ changed by cargo-mutants ~ */ 1;
     let mut items = vec![Doc::SoftLine];
     for (idx, arg) in args.into_iter().enumerate() {
         items.push(build_element_doc(arg));
         if idx < last {
             items.push(Doc::text(","));
             items.push(Doc::Line);
         }
     }

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (742157) panicked at tests/conformance.rs:339:5:
assertion `left == right` failed
  left: "void f(void, ) {\n\tint a;\n\n\tint b;\n}\n"
 right: "void f(void) {\n\tint a;\n\n\tint b;\n}\n"

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (742159) panicked at tests/conformance.rs:275:5:
assertion `left == right` failed
  left: "void f(void, ) {}\n"
 right: "void f(void) {}\n"

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (742162) panicked at tests/conformance.rs:137:5:
assertion `left == right` failed
  left: "foo(a, b, );\n"
 right: "foo(a, b);\n"

failures:
    blank_line_runs_collapse_to_one_everywhere
    brace_attaches_for_functions_and_control
    collapses_a_call_that_now_fits
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literals_in_function_args
    control_headers_are_not_calls
    declaration_with_brace_explodes_and_keeps_brace_attached
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    indentation_is_normalized_to_tabs

test result: FAILED. 35 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
