*** src/reflow.rs:936:16: replace < with > in build_call_doc

*** mutation diff:
--- src/reflow.rs
+++ replace < with > in build_call_doc
@@ -928,17 +928,17 @@
         .collect();
     if args.is_empty() {
         return Doc::text("()");
     }
     let last = args.len() - 1;
     let mut items = vec![Doc::SoftLine];
     for (idx, arg) in args.into_iter().enumerate() {
         items.push(build_element_doc(arg));
-        if idx < last {
+        if idx > /* ~ changed by cargo-mutants ~ */ last {
             items.push(Doc::text(","));
             items.push(Doc::Line);
         }
     }
     Doc::group(Doc::concat([
         Doc::text("("),
         Doc::nest(Doc::concat(items)),
         Doc::SoftLine,

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (1091782) panicked at tests/conformance.rs:137:5:
assertion `left == right` failed
  left: "foo(ab);\n"
 right: "foo(a, b);\n"

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (1091789) panicked at tests/conformance.rs:291:5:
assertion `left == right` failed
  left: "configure(&(struct opts){.mode = 1, .flags = 0}count);\n"
 right: "configure(&(struct opts){.mode = 1, .flags = 0}, count);\n"

---- declaration_with_brace_explodes_and_keeps_brace_attached stdout ----

thread 'declaration_with_brace_explodes_and_keeps_brace_attached' (1091799) panicked at tests/conformance.rs:494:5:
assertion `left == right` failed
  left: "static int do_something_with_a_long_name(\n\tint first_parameterint second_parameterint third_parameter\n) {\n"
 right: "static int do_something_with_a_long_name(\n\tint first_parameter,\n\tint second_parameter,\n\tint third_parameter\n) {\n"

failures:
    collapses_a_call_that_now_fits
    compound_literals_in_function_args
    declaration_with_brace_explodes_and_keeps_brace_attached
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    long_call_explodes_one_per_line
    nested_paren_comma_is_not_a_split_point
    short_call_stays_flat

test result: FAILED. 43 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
