*** src/reflow.rs:953:8: delete ! in build_brace_doc

*** mutation diff:
--- src/reflow.rs
+++ delete ! in build_brace_doc
@@ -945,17 +945,17 @@
         Doc::text(")"),
     ]))
 }
 
 /// Build the document for a `{}` list: comma-separated elements, a trailing comma when broken, and
 /// the §2.3 magic comma (a trailing comma in the source forces explosion). `padded` adds an inner
 /// space in the flat form (`enum { A, B }`) versus the tight initializer form (`{1, 2}`).
 fn build_brace_doc(inner: &[Token], padded: bool) -> Doc {
-    if !is_balanced(inner) {
+    if  /* ~ changed by cargo-mutants ~ */is_balanced(inner) {
         return Doc::Text(format!("{{{}}}", render_segment(inner)));
     }
     let segments = split_on_commas(inner);
     let magic = segments.len() > 1 && segments.last().is_some_and(|s| s.iter().all(is_trivia));
     let elements: Vec<&[Token]> = segments
         .into_iter()
         .filter(|s| s.iter().any(|t| !is_trivia(t)))
         .collect();

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (1092872) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(\n\t&(struct config){.alpha = 1111111111, .beta = 2222222222, .gamma = 3333333333, .delta = 4444444444}\n);\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (1092878) panicked at tests/conformance.rs:418:5:
assertion `left == right` failed
  left: "p = &(struct shape){.tag = R, .rect = {.w = 3, .h = 4},};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

---- enum_body_is_padded_when_flat stdout ----

thread 'enum_body_is_padded_when_flat' (1092892) panicked at tests/conformance.rs:184:5:
assertion `left == right` failed
  left: "enum {A, B};\n"
 right: "enum { A, B };\n"

failures:
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_initializer_explodes
    enum_body_is_padded_when_flat
    enum_magic_comma_explodes
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    magic_trailing_comma_forces_explosion_with_trailing_comma
    nested_initializer_collapses_independently

test result: FAILED. 45 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
