*** src/reflow.rs:957:32: replace > with == in build_brace_doc

*** mutation diff:
--- src/reflow.rs
+++ replace > with == in build_brace_doc
@@ -949,17 +949,17 @@
 /// Build the document for a `{}` list: comma-separated elements, a trailing comma when broken, and
 /// the §2.3 magic comma (a trailing comma in the source forces explosion). `padded` adds an inner
 /// space in the flat form (`enum { A, B }`) versus the tight initializer form (`{1, 2}`).
 fn build_brace_doc(inner: &[Token], padded: bool) -> Doc {
     if !is_balanced(inner) {
         return Doc::Text(format!("{{{}}}", render_segment(inner)));
     }
     let segments = split_on_commas(inner);
-    let magic = segments.len() > 1 && segments.last().is_some_and(|s| s.iter().all(is_trivia));
+    let magic = segments.len() == /* ~ changed by cargo-mutants ~ */ 1 && segments.last().is_some_and(|s| s.iter().all(is_trivia));
     let elements: Vec<&[Token]> = segments
         .into_iter()
         .filter(|s| s.iter().any(|t| !is_trivia(t)))
         .collect();
     if elements.is_empty() {
         return Doc::text("{}");
     }
     let pad = || if padded { Doc::Line } else { Doc::SoftLine };

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (745343) panicked at tests/conformance.rs:403:5:
assertion `left == right` failed
  left: "p = &(struct shape){.tag = R, .rect = {.w = 3, .h = 4}};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

---- enum_magic_comma_explodes stdout ----

thread 'enum_magic_comma_explodes' (745351) panicked at tests/conformance.rs:195:5:
assertion `left == right` failed
  left: "enum color { RED, GREEN, BLUE };\n"
 right: "enum color {\n\tRED,\n\tGREEN,\n\tBLUE,\n};\n"

---- nested_initializer_collapses_independently stdout ----

thread 'nested_initializer_collapses_independently' (745370) panicked at tests/conformance.rs:179:5:
assertion `left == right` failed
  left: "int m[2][3] = {{1, 2, 3}, {4, 5, 6}};\n"
 right: "int m[2][3] = {\n\t{1, 2, 3},\n\t{4, 5, 6},\n};\n"

failures:
    compound_literal_initializer_explodes
    enum_magic_comma_explodes
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    magic_trailing_comma_forces_explosion_with_trailing_comma
    nested_initializer_collapses_independently

test result: FAILED. 45 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
