*** src/reflow.rs:957:36: replace && with || in build_brace_doc

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in build_brace_doc
@@ -949,17 +949,17 @@
 /// Build the document for a `{}` list: comma-separated elements, a trailing comma when broken, and
 /// the §2.3 magic comma (a trailing comma in the source forces explosion). `padded` adds an inner
 /// space in the flat form (`enum { A, B }`) versus the tight initializer form (`{1, 2}`).
 fn build_brace_doc(inner: &[Token], padded: bool) -> Doc {
     if !is_balanced(inner) {
         return Doc::Text(format!("{{{}}}", render_segment(inner)));
     }
     let segments = split_on_commas(inner);
-    let magic = segments.len() > 1 && segments.last().is_some_and(|s| s.iter().all(is_trivia));
+    let magic = segments.len() > 1 || /* ~ changed by cargo-mutants ~ */ segments.last().is_some_and(|s| s.iter().all(is_trivia));
     let elements: Vec<&[Token]> = segments
         .into_iter()
         .filter(|s| s.iter().any(|t| !is_trivia(t)))
         .collect();
     if elements.is_empty() {
         return Doc::text("{}");
     }
     let pad = || if padded { Doc::Line } else { Doc::SoftLine };

---- collapses_initializer_without_trailing_comma stdout ----

thread 'collapses_initializer_without_trailing_comma' (745262) panicked at tests/conformance.rs:172:5:
assertion `left == right` failed
  left: "int v[] = {\n\t1,\n\t2,\n\t3,\n};\n"
 right: "int v[] = {1, 2, 3};\n"

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (745265) panicked at tests/conformance.rs:403:5:
assertion `left == right` failed
  left: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {\n\t\t.w = 3,\n\t\t.h = 4,\n\t},\n};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (745266) panicked at tests/conformance.rs:291:5:
assertion `left == right` failed
  left: "configure(\n\t&(struct opts){\n\t\t.mode = 1,\n\t\t.flags = 0,\n\t},\n\tcount\n);\n"
 right: "configure(&(struct opts){.mode = 1, .flags = 0}, count);\n"

failures:
    collapses_initializer_without_trailing_comma
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    enum_body_is_padded_when_flat
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    nested_initializer_collapses_independently
    short_initializer_stays_flat_and_tight

test result: FAILED. 43 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
