*** src/reflow.rs:960:38: delete ! in build_brace_doc

*** mutation diff:
--- src/reflow.rs
+++ delete ! in build_brace_doc
@@ -952,17 +952,17 @@
 fn build_brace_doc(inner: &[Token], padded: bool) -> Doc {
     if !is_balanced(inner) {
         return Doc::Text(format!("{{{}}}", render_segment(inner)));
     }
     let segments = split_on_commas(inner);
     let magic = segments.len() > 1 && segments.last().is_some_and(|s| s.iter().all(is_trivia));
     let elements: Vec<&[Token]> = segments
         .into_iter()
-        .filter(|s| s.iter().any(|t| !is_trivia(t)))
+        .filter(|s| s.iter().any(|t|  /* ~ changed by cargo-mutants ~ */is_trivia(t)))
         .collect();
     if elements.is_empty() {
         return Doc::text("{}");
     }
     let pad = || if padded { Doc::Line } else { Doc::SoftLine };
     let last = elements.len() - 1;
     let mut items = vec![pad()];
     for (idx, element) in elements.into_iter().enumerate() {

---- enum_magic_comma_explodes stdout ----

thread 'enum_magic_comma_explodes' (747199) panicked at tests/conformance.rs:195:5:
assertion `left == right` failed
  left: "enum color {\n\tRED,\n\tGREEN,\n\tBLUE,\n\t,\n};\n"
 right: "enum color {\n\tRED,\n\tGREEN,\n\tBLUE,\n};\n"

---- magic_trailing_comma_forces_explosion_with_trailing_comma stdout ----

thread 'magic_trailing_comma_forces_explosion_with_trailing_comma' (747224) panicked at tests/conformance.rs:166:5:
assertion `left == right` failed
  left: "int v[] = {\n\t2,\n\t3,\n};\n"
 right: "int v[] = {\n\t1,\n\t2,\n\t3,\n};\n"

---- nested_initializer_collapses_independently stdout ----

thread 'nested_initializer_collapses_independently' (747227) panicked at tests/conformance.rs:179:5:
assertion `left == right` failed
  left: "int m[2][3] = {\n\t{2, 3},\n\t{5, 6},\n};\n"
 right: "int m[2][3] = {\n\t{1, 2, 3},\n\t{4, 5, 6},\n};\n"

failures:
    enum_magic_comma_explodes
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    magic_trailing_comma_forces_explosion_with_trailing_comma
    messy_real_world_input_is_idempotent_and_safe
    nested_initializer_collapses_independently
    short_initializer_stays_flat_and_tight
    showcase_content_is_preserved

test result: FAILED. 42 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
