*** src/reflow.rs:966:31: replace - with / in build_brace_doc

*** mutation diff:
--- src/reflow.rs
+++ replace - with / in build_brace_doc
@@ -958,17 +958,17 @@
     let elements: Vec<&[Token]> = segments
         .into_iter()
         .filter(|s| s.iter().any(|t| !is_trivia(t)))
         .collect();
     if elements.is_empty() {
         return Doc::text("{}");
     }
     let pad = || if padded { Doc::Line } else { Doc::SoftLine };
-    let last = elements.len() - 1;
+    let last = elements.len() / /* ~ changed by cargo-mutants ~ */ 1;
     let mut items = vec![pad()];
     for (idx, element) in elements.into_iter().enumerate() {
         items.push(build_element_doc(element));
         if idx < last {
             items.push(Doc::text(","));
             items.push(Doc::Line);
         } else {
             items.push(Doc::IfBreak {

---- collapses_initializer_without_trailing_comma stdout ----

thread 'collapses_initializer_without_trailing_comma' (1096174) panicked at tests/conformance.rs:172:5:
assertion `left == right` failed
  left: "int v[] = {1, 2, 3, };\n"
 right: "int v[] = {1, 2, 3};\n"

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (1096175) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\n\t}\n);\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literal_brace_stays_tight stdout ----

thread 'compound_literal_brace_stays_tight' (1096176) panicked at tests/conformance.rs:282:5:
assertion `left == right` failed
  left: "p = &(struct shape){.x = 1, };\n"
 right: "p = &(struct shape){.x = 1};\n"

failures:
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    enum_body_is_padded_when_flat
    enum_magic_comma_explodes
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    magic_trailing_comma_forces_explosion_with_trailing_comma
    messy_real_world_input_is_idempotent_and_safe

test result: FAILED. 39 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
