*** src/reflow.rs:970:16: replace < with > in build_brace_doc

*** mutation diff:
--- src/reflow.rs
+++ replace < with > in build_brace_doc
@@ -962,17 +962,17 @@
     if elements.is_empty() {
         return Doc::text("{}");
     }
     let pad = || if padded { Doc::Line } else { Doc::SoftLine };
     let last = elements.len() - 1;
     let mut items = vec![pad()];
     for (idx, element) in elements.into_iter().enumerate() {
         items.push(build_element_doc(element));
-        if idx < last {
+        if idx > /* ~ changed by cargo-mutants ~ */ last {
             items.push(Doc::text(","));
             items.push(Doc::Line);
         } else {
             items.push(Doc::IfBreak {
                 broken: ",".to_owned(),
                 flat: String::new(),
             });
         }

---- collapses_initializer_without_trailing_comma stdout ----

thread 'collapses_initializer_without_trailing_comma' (1097655) panicked at tests/conformance.rs:172:5:
assertion `left == right` failed
  left: "int v[] = {123};\n"
 right: "int v[] = {1, 2, 3};\n"

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (1097656) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(&(struct config){.alpha = 1111111111.beta = 2222222222.gamma = 3333333333.delta = 4444444444});\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (1097659) panicked at tests/conformance.rs:418:5:
assertion `left == right` failed
  left: "p = &(struct shape){\n\t.tag = R,.rect = {.w = 3.h = 4},\n};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

failures:
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    enum_body_is_padded_when_flat
    enum_magic_comma_explodes
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    magic_trailing_comma_forces_explosion_with_trailing_comma
    nested_initializer_collapses_independently
    short_initializer_stays_flat_and_tight

test result: FAILED. 42 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
