*** src/doc.rs:115:5: replace fits -> bool with true

*** mutation diff:
--- src/doc.rs
+++ replace fits -> bool with true
@@ -107,69 +107,17 @@
         }
     }
     out
 }
 
 /// Does `doc`, laid out flat, fit in `remaining` columns before the line would break — including
 /// the work still queued in `rest` up to the first newline?
 fn fits(mut remaining: usize, doc: &Doc, rest: &[(usize, Mode, &Doc)]) -> bool {
-    let mut work: Vec<(Mode, &Doc)> = vec![(Mode::Flat, doc)];
-    let mut rest_idx = rest.len();
-    loop {
-        let (mode, d) = if let Some(item) = work.pop() {
-            item
-        } else {
-            if rest_idx == 0 {
-                return true;
-            }
-            rest_idx -= 1;
-            let (_, mode, d) = rest[rest_idx];
-            (mode, d)
-        };
-        match d {
-            Doc::Text(s) => {
-                let w = display_width(s);
-                if w > remaining {
-                    return false;
-                }
-                remaining -= w;
-            }
-            Doc::Concat(items) => {
-                for child in items.iter().rev() {
-                    work.push((mode, child));
-                }
-            }
-            Doc::Nest(inner) => work.push((mode, inner)),
-            Doc::Group(inner) => work.push((Mode::Flat, inner)),
-            Doc::Line => match mode {
-                Mode::Flat => {
-                    if remaining == 0 {
-                        return false;
-                    }
-                    remaining -= 1;
-                }
-                Mode::Break => return true,
-            },
-            Doc::SoftLine => {
-                if mode == Mode::Break {
-                    return true;
-                }
-            }
-            Doc::IfBreak { broken, flat } => {
-                let s = if mode == Mode::Break { broken } else { flat };
-                let w = display_width(s);
-                if w > remaining {
-                    return false;
-                }
-                remaining -= w;
-            }
-            Doc::ForceBreak(_) => return false,
-        }
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     /// A bracketed, comma-separated group shaped like §2.2: flat `(a, b)` or one-per-line broken.
     fn bracket_group(args: &[&str]) -> Doc {

---- doc::tests::breaks_indent_relative_to_base_level stdout ----

thread 'doc::tests::breaks_indent_relative_to_base_level' (795126) panicked at src/doc.rs:155:9:
assertion `left == right` failed
  left: "(a)"
 right: "(\n\t\t\ta\n\t\t)"

---- doc::tests::fully_breaks_when_it_overflows stdout ----

thread 'doc::tests::fully_breaks_when_it_overflows' (795129) panicked at src/doc.rs:147:9:
assertion `left == right` failed
  left: "(a, b)"
 right: "(\n\ta,\n\tb\n)"

---- doc::tests::trailing_reserved_width_forces_a_break stdout ----

thread 'doc::tests::trailing_reserved_width_forces_a_break' (795131) panicked at src/doc.rs:161:9:
assertion `left == right` failed
  left: "(a)"
 right: "(\n\ta\n)"

failures:
    doc::tests::breaks_indent_relative_to_base_level
    doc::tests::fully_breaks_when_it_overflows
    doc::tests::trailing_reserved_width_forces_a_break

test result: FAILED. 1 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
