*** src/doc.rs:124:22: replace -= with += in fits

*** mutation diff:
--- src/doc.rs
+++ replace -= with += in fits
@@ -116,17 +116,17 @@
     let mut rest_idx = rest.len();
     loop {
         let (mode, d) = if let Some(item) = work.pop() {
             item
         } else {
             if rest_idx == 0 {
                 return true;
             }
-            rest_idx -= 1;
+            rest_idx += /* ~ changed by cargo-mutants ~ */ 1;
             let (_, mode, d) = rest[rest_idx];
             (mode, d)
         };
         match d {
             Doc::Text(s) => {
                 let w = display_width(s);
                 if w > remaining {
                     return false;

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (797211) panicked at src/doc.rs:125:32:
index out of bounds: the len is 3 but the index is 4

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (797212) panicked at src/doc.rs:125:32:
index out of bounds: the len is 5 but the index is 6

---- nested_initializer_collapses_independently stdout ----

thread 'nested_initializer_collapses_independently' (797238) panicked at src/doc.rs:125:32:
index out of bounds: the len is 6 but the index is 7

failures:
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    nested_initializer_collapses_independently
    showcase_content_is_preserved

test result: FAILED. 46 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
