*** src/doc.rs:131:22: replace > with == in fits

*** mutation diff:
--- src/doc.rs
+++ replace > with == in fits
@@ -123,17 +123,17 @@
             }
             rest_idx -= 1;
             let (_, mode, d) = rest[rest_idx];
             (mode, d)
         };
         match d {
             Doc::Text(s) => {
                 let w = display_width(s);
-                if w > remaining {
+                if w == /* ~ changed by cargo-mutants ~ */ remaining {
                     return false;
                 }
                 remaining -= w;
             }
             Doc::Concat(items) => {
                 for child in items.iter().rev() {
                     work.push((mode, child));
                 }

---- doc::tests::breaks_indent_relative_to_base_level stdout ----

thread 'doc::tests::breaks_indent_relative_to_base_level' (797190) panicked at src/doc.rs:134:17:
attempt to subtract with overflow

failures:
    doc::tests::breaks_indent_relative_to_base_level

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
