*** src/doc.rs:134:27: replace -= with /= in fits

*** mutation diff:
--- src/doc.rs
+++ replace -= with /= in fits
@@ -126,17 +126,17 @@
             (mode, d)
         };
         match d {
             Doc::Text(s) => {
                 let w = display_width(s);
                 if w > remaining {
                     return false;
                 }
-                remaining -= w;
+                remaining /= /* ~ changed by cargo-mutants ~ */ w;
             }
             Doc::Concat(items) => {
                 for child in items.iter().rev() {
                     work.push((mode, child));
                 }
             }
             Doc::Nest(inner) => work.push((mode, inner)),
             Doc::Group(inner) => work.push((Mode::Flat, inner)),

---- doc::tests::fully_breaks_when_it_overflows stdout ----

thread 'doc::tests::fully_breaks_when_it_overflows' (451030) panicked at src/doc.rs:199:9:
assertion `left == right` failed
  left: "(a, b)"
 right: "(\n\ta,\n\tb\n)"

---- doc::tests::trailing_reserved_width_forces_a_break stdout ----

thread 'doc::tests::trailing_reserved_width_forces_a_break' (451032) panicked at src/doc.rs:213:9:
assertion `left == right` failed
  left: "(a)"
 right: "(\n\ta\n)"

failures:
    doc::tests::fully_breaks_when_it_overflows
    doc::tests::trailing_reserved_width_forces_a_break

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
