*** src/doc.rs:148:31: replace -= with += in fits

*** mutation diff:
--- src/doc.rs
+++ replace -= with += in fits
@@ -140,17 +140,17 @@
             }
             Doc::Nest(inner) => work.push((mode, inner)),
             Doc::Group(inner) => work.push((Mode::Flat, inner)),
             Doc::Line => match mode {
                 Mode::Flat => {
                     if remaining == 0 {
                         return false;
                     }
-                    remaining -= 1;
+                    remaining += /* ~ changed by cargo-mutants ~ */ 1;
                 }
                 Mode::Break => return true,
             },
             Doc::SoftLine => {
                 if mode == Mode::Break {
                     return true;
                 }
             }

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (801100) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(&(struct config){.alpha = 1111111111, .beta = 2222222222, .gamma = 3333333333, .delta = 4444444444});\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- condition_splits_on_the_outer_logical_operator stdout ----

thread 'condition_splits_on_the_outer_logical_operator' (801109) panicked at tests/conformance.rs:396:5:
assertion `left == right` failed
  left: "if (alpha_value > 100 || bravo_value > 200 || charlie_value > 300 || delta_value > 400 || echo_v > 5) {\n}\n"
 right: "if (\n\talpha_value > 100 ||\n\tbravo_value > 200 ||\n\tcharlie_value > 300 ||\n\tdelta_value > 400 ||\n\techo_v > 5\n) {\n}\n"

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (801106) panicked at tests/conformance.rs:302:5:
assertion `left == right` failed
  left: "dispatch(&(struct request){.id = 1234567, .kind = KIND_READ}, &response_buffer_out, default_timeout_ms);\n"
 right: "dispatch(\n\t&(struct request){.id = 1234567, .kind = KIND_READ},\n\t&response_buffer_out,\n\tdefault_timeout_ms\n);\n"

failures:
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literals_in_function_args
    condition_splits_on_the_outer_logical_operator
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 48 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
