*** src/doc.rs:148:31: replace -= with /= in fits

*** mutation diff:
--- src/doc.rs
+++ replace -= with /= in fits
@@ -140,17 +140,17 @@
             }
             Doc::Nest(inner) => work.push((mode, inner)),
             Doc::Group(inner) => work.push((Mode::Flat, inner)),
             Doc::Line => match mode {
                 Mode::Flat => {
                     if remaining == 0 {
                         return false;
                     }
-                    remaining -= 1;
+                    remaining /= /* ~ changed by cargo-mutants ~ */ 1;
                 }
                 Mode::Break => return true,
             },
             Doc::SoftLine => {
                 if mode == Mode::Break {
                     return true;
                 }
             }

---- condition_splits_on_the_outer_logical_operator stdout ----

thread 'condition_splits_on_the_outer_logical_operator' (801094) panicked at tests/conformance.rs:396:5:
assertion `left == right` failed
  left: "if (alpha_value > 100 || bravo_value > 200 || charlie_value > 300 || delta_value > 400 || echo_v > 5) {\n}\n"
 right: "if (\n\talpha_value > 100 ||\n\tbravo_value > 200 ||\n\tcharlie_value > 300 ||\n\tdelta_value > 400 ||\n\techo_v > 5\n) {\n}\n"

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (801117) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (801115) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    condition_splits_on_the_outer_logical_operator
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 50 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
