*** src/doc.rs:70:21: replace += with -= in render

*** mutation diff:
--- src/doc.rs
+++ replace += with -= in render
@@ -62,17 +62,17 @@
 pub fn render(doc: &Doc, width: usize, start_col: usize, base_level: usize) -> String {
     let mut out = String::new();
     let mut col = start_col;
     let mut stack: Vec<(usize, Mode, &Doc)> = vec![(base_level, Mode::Break, doc)];
     while let Some((level, mode, d)) = stack.pop() {
         match d {
             Doc::Text(s) => {
                 out.push_str(s);
-                col += display_width(s);
+                col -= /* ~ changed by cargo-mutants ~ */ display_width(s);
             }
             Doc::Concat(items) => {
                 for child in items.iter().rev() {
                     stack.push((level, mode, child));
                 }
             }
             Doc::Nest(inner) => stack.push((level + 1, mode, inner)),
             Doc::Line | Doc::SoftLine => match mode {

---- doc::tests::breaks_indent_relative_to_base_level stdout ----

thread 'doc::tests::breaks_indent_relative_to_base_level' (789431) panicked at src/doc.rs:70:17:
attempt to subtract with overflow

---- doc::tests::flat_when_it_fits stdout ----

thread 'doc::tests::flat_when_it_fits' (789432) panicked at src/doc.rs:70:17:
attempt to subtract with overflow

---- doc::tests::fully_breaks_when_it_overflows stdout ----

thread 'doc::tests::fully_breaks_when_it_overflows' (789433) panicked at src/doc.rs:70:17:
attempt to subtract with overflow

failures:
    doc::tests::breaks_indent_relative_to_base_level
    doc::tests::flat_when_it_fits
    doc::tests::fully_breaks_when_it_overflows
    doc::tests::trailing_reserved_width_forces_a_break

test result: FAILED. 0 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
