*** src/doc.rs:77:51: replace + with * in render

*** mutation diff:
--- src/doc.rs
+++ replace + with * in render
@@ -69,17 +69,17 @@
                 out.push_str(s);
                 col += display_width(s);
             }
             Doc::Concat(items) => {
                 for child in items.iter().rev() {
                     stack.push((level, mode, child));
                 }
             }
-            Doc::Nest(inner) => stack.push((level + 1, mode, inner)),
+            Doc::Nest(inner) => stack.push((level * /* ~ changed by cargo-mutants ~ */ 1, mode, inner)),
             Doc::Line | Doc::SoftLine => match mode {
                 Mode::Flat => {
                     if matches!(d, Doc::Line) {
                         out.push(' ');
                         col += 1;
                     }
                 }
                 Mode::Break => {

---- doc::tests::breaks_indent_relative_to_base_level stdout ----

thread 'doc::tests::breaks_indent_relative_to_base_level' (443256) panicked at src/doc.rs:207:9:
assertion `left == right` failed
  left: "(\n\t\ta\n\t\t)"
 right: "(\n\t\t\ta\n\t\t)"

---- doc::tests::fully_breaks_when_it_overflows stdout ----

thread 'doc::tests::fully_breaks_when_it_overflows' (443258) panicked at src/doc.rs:199:9:
assertion `left == right` failed
  left: "(\na,\nb\n)"
 right: "(\n\ta,\n\tb\n)"

---- doc::tests::trailing_reserved_width_forces_a_break stdout ----

thread 'doc::tests::trailing_reserved_width_forces_a_break' (443259) panicked at src/doc.rs:213:9:
assertion `left == right` failed
  left: "(\na\n)"
 right: "(\n\ta\n)"

failures:
    doc::tests::breaks_indent_relative_to_base_level
    doc::tests::fully_breaks_when_it_overflows
    doc::tests::trailing_reserved_width_forces_a_break

test result: FAILED. 1 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
