*** src/doc.rs:90:33: replace * with + in render

*** mutation diff:
--- src/doc.rs
+++ replace * with + in render
@@ -82,17 +82,17 @@
                         col += 1;
                     }
                 }
                 Mode::Break => {
                     out.push('\n');
                     for _ in 0..level {
                         out.push('\t');
                     }
-                    col = level * TAB_WIDTH;
+                    col = level + /* ~ changed by cargo-mutants ~ */ TAB_WIDTH;
                 }
             },
             Doc::Group(inner) => {
                 let mode = if fits(width.saturating_sub(col), inner, &stack) {
                     Mode::Flat
                 } else {
                     Mode::Break
                 };

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (444168) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A(\n\t{\n\t\t\"\";,\n\t}\n)\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:28.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")", width = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (444166) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A({\"\";})\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:17.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")"
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
