*** src/lexer.rs:78:5: replace tokenize -> Vec<Token<'_>> with vec![]

*** mutation diff:
--- src/lexer.rs
+++ replace tokenize -> Vec<Token<'_>> with vec![]
@@ -70,18 +70,10 @@
     pub kind: TokenKind,
     pub text: &'src str,
 }
 
 /// Lex `src` into a lossless token stream: `tokenize(src).iter().map(|t| t.text).collect::<String>()`
 /// equals `src` for every input. A byte logos cannot classify becomes a [`TokenKind::Unknown`]
 /// token carrying that slice rather than being dropped.
 pub fn tokenize(src: &str) -> Vec<Token<'_>> {
-    let mut lex = TokenKind::lexer(src);
-    let mut out = Vec::new();
-    while let Some(result) = lex.next() {
-        out.push(Token {
-            kind: result.unwrap_or(TokenKind::Unknown),
-            text: lex.slice(),
-        });
-    }
-    out
+    vec![] /* ~ changed by cargo-mutants ~ */
 }

---- ambiguous_star_is_left_alone stdout ----

thread 'ambiguous_star_is_left_alone' (459097) panicked at tests/conformance.rs:242:5:
assertion `left == right` failed
  left: ""
 right: "z = a*b;\n"

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (459098) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: ""
 right: "struct s {\n\tint x: 2;\n};\n"

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (459099) panicked at tests/conformance.rs:337:5:
assertion `left == right` failed
  left: ""
 right: "int a;\n\nint b;\n"

failures:
    ambiguous_star_is_left_alone
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    block_comment_internals_are_untouched
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes

test result: FAILED. 2 passed; 49 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
