*** src/main.rs:107:34: replace == with != in main

*** mutation diff:
--- src/main.rs
+++ replace == with != in main
@@ -99,16 +99,16 @@
             return ExitCode::FAILURE;
         }
     };
     if args.mode == Mode::Version {
         println!("cfmt {}", env!("CARGO_PKG_VERSION"));
         return ExitCode::SUCCESS;
     }
     match run(&args) {
-        Ok(changed) if args.mode == Mode::Check && changed => ExitCode::FAILURE,
+        Ok(changed) if args.mode != /* ~ changed by cargo-mutants ~ */ Mode::Check && changed => ExitCode::FAILURE,
         Ok(_) => ExitCode::SUCCESS,
         Err(err) => {
             eprintln!("cfmt: {err}");
             ExitCode::FAILURE
         }
     }
 }

*** result: Success
