*** src/main.rs:37:13: delete match arm "-h" | "--help" in parse_args

*** mutation diff:
--- src/main.rs
+++ delete match arm "-h" | "--help" in parse_args
@@ -29,17 +29,17 @@
     let mut width = DEFAULT_WIDTH;
     let mut files = Vec::new();
     let mut rest = argv.iter();
     while let Some(arg) = rest.next() {
         match arg.as_str() {
             "-i" | "--in-place" => mode = Mode::InPlace,
             "--check" => mode = Mode::Check,
             "-V" | "--version" => mode = Mode::Version,
-            "-h" | "--help" => return Err(USAGE.to_owned()),
+             /* ~ changed by cargo-mutants ~ */
             "--width" => {
                 let value = rest.next().ok_or("--width requires a value")?;
                 width = value
                     .parse()
                     .map_err(|_| format!("invalid --width: {value}"))?;
             }
             flag if flag.starts_with("--width=") => {
                 let value = &flag["--width=".len()..];

*** result: Success
