*** src/main.rs:44:21: replace match guard flag.starts_with("--width=") with true in parse_args

*** mutation diff:
--- src/main.rs
+++ replace match guard flag.starts_with("--width=") with true in parse_args
@@ -36,17 +36,17 @@
             "-V" | "--version" => mode = Mode::Version,
             "-h" | "--help" => return Err(USAGE.to_owned()),
             "--width" => {
                 let value = rest.next().ok_or("--width requires a value")?;
                 width = value
                     .parse()
                     .map_err(|_| format!("invalid --width: {value}"))?;
             }
-            flag if flag.starts_with("--width=") => {
+            flag if true /* ~ changed by cargo-mutants ~ */ => {
                 let value = &flag["--width=".len()..];
                 width = value
                     .parse()
                     .map_err(|_| format!("invalid --width: {value}"))?;
             }
             flag if flag.starts_with('-') && flag != "-" => {
                 return Err(format!("unknown flag: {flag}"));
             }

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs
proptest: Saving this and future failures in /tmp/cargo-mutants-c-format-01Z7wo.tmp/tests/properties.proptest-regressions
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file.
cc a06e231f6a93d00b35a0af8719000a76038d3ab8ba5ca3b678bbc732f15e25e2

thread 'idempotent_across_widths' (431797) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A(\n\t{\n\t\t\"\";,\n\t}\n)\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:28.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")", width = 1
	successes: 185
	local rejects: 0

failures:
    idempotent_across_widths

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
