*** src/main.rs:70:5: replace run -> std::io::Result<bool> with Ok(true)

*** mutation diff:
--- src/main.rs
+++ replace run -> std::io::Result<bool> with Ok(true)
@@ -62,37 +62,17 @@
 fn read_stdin() -> std::io::Result<String> {
     let mut buf = String::new();
     std::io::stdin().read_to_string(&mut buf)?;
     Ok(buf)
 }
 
 /// Returns `true` if any input differed from its formatted form.
 fn run(args: &Args) -> std::io::Result<bool> {
-    if args.files.is_empty() {
-        let src = read_stdin()?;
-        let out = format_with_width(&src, args.width);
-        if args.mode != Mode::Check {
-            std::io::stdout().write_all(out.as_bytes())?;
-        }
-        return Ok(out != src);
-    }
-    let mut any_changed = false;
-    for path in &args.files {
-        let src = std::fs::read_to_string(path)?;
-        let out = format_with_width(&src, args.width);
-        let changed = out != src;
-        any_changed |= changed;
-        match args.mode {
-            Mode::Stdout => std::io::stdout().write_all(out.as_bytes())?,
-            Mode::InPlace if changed => std::fs::write(path, out)?,
-            Mode::InPlace | Mode::Check | Mode::Version => {}
-        }
-    }
-    Ok(any_changed)
+    Ok(true) /* ~ changed by cargo-mutants ~ */
 }
 
 fn main() -> ExitCode {
     let argv: Vec<String> = std::env::args().skip(1).collect();
     let args = match parse_args(&argv) {
         Ok(args) => args,
         Err(msg) => {
             eprintln!("cfmt: {msg}");

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (435477) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A({\"\";})\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:17.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")"
	successes: 0
	local rejects: 0
	global rejects: 0

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (435479) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A(\n\t{\n\t\t\"\";,\n\t}\n)\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:28.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")", width = 1
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
