*** src/main.rs:83:21: replace |= with &= in run

*** mutation diff:
--- src/main.rs
+++ replace |= with &= in run
@@ -75,17 +75,17 @@
         }
         return Ok(out != src);
     }
     let mut any_changed = false;
     for path in &args.files {
         let src = std::fs::read_to_string(path)?;
         let out = format_with_width(&src, args.width);
         let changed = out != src;
-        any_changed |= changed;
+        any_changed &= /* ~ changed by cargo-mutants ~ */ changed;
         match args.mode {
             Mode::Stdout => std::io::stdout().write_all(out.as_bytes())?,
             Mode::InPlace if changed => std::fs::write(path, out)?,
             Mode::InPlace | Mode::Check | Mode::Version => {}
         }
     }
     Ok(any_changed)
 }

*** result: Success
