*** src/main.rs:86:30: replace match guard changed with false in run

*** mutation diff:
--- src/main.rs
+++ replace match guard changed with false in run
@@ -78,17 +78,17 @@
     let mut any_changed = false;
     for path in &args.files {
         let src = std::fs::read_to_string(path)?;
         let out = format_with_width(&src, args.width);
         let changed = out != src;
         any_changed |= changed;
         match args.mode {
             Mode::Stdout => std::io::stdout().write_all(out.as_bytes())?,
-            Mode::InPlace if changed => std::fs::write(path, out)?,
+            Mode::InPlace if false /* ~ changed by cargo-mutants ~ */ => std::fs::write(path, out)?,
             Mode::InPlace | Mode::Check | Mode::Version => {}
         }
     }
     Ok(any_changed)
 }
 
 fn main() -> ExitCode {
     let argv: Vec<String> = std::env::args().skip(1).collect();

*** result: Success
