*** src/reflow.rs:112:5: replace same_line -> bool with true

*** mutation diff:
--- src/reflow.rs
+++ replace same_line -> bool with true
@@ -104,17 +104,17 @@
             | "restrict"
     )
 }
 
 /// A significant token paired with the whitespace that preceded it.
 type Piece<'src> = (String, Token<'src>);
 
 fn same_line(gap: &str) -> bool {
-    !gap.contains('\n')
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Index of the `(` matching the `)` at `close`, scanning the piece list backward.
 fn piece_open_paren(pieces: &[Piece], close: usize) -> Option<usize> {
     let mut depth = 0i32;
     for j in (0..=close).rev() {
         match pieces[j].1.text {
             ")" => depth += 1,

*** result: Success
