*** src/reflow.rs:117:5: replace piece_open_paren -> Option<usize> with None

*** mutation diff:
--- src/reflow.rs
+++ replace piece_open_paren -> Option<usize> with None
@@ -109,30 +109,17 @@
 type Piece<'src> = (String, Token<'src>);
 
 fn same_line(gap: &str) -> bool {
     !gap.contains('\n')
 }
 
 /// Index of the `(` matching the `)` at `close`, scanning the piece list backward.
 fn piece_open_paren(pieces: &[Piece], close: usize) -> Option<usize> {
-    let mut depth = 0i32;
-    for j in (0..=close).rev() {
-        match pieces[j].1.text {
-            ")" => depth += 1,
-            "(" => {
-                depth -= 1;
-                if depth == 0 {
-                    return Some(j);
-                }
-            }
-            _ => {}
-        }
-    }
-    None
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Index of the `)` matching the `(` at `open`, scanning forward.
 fn piece_close_paren(pieces: &[Piece], open: usize) -> Option<usize> {
     let mut depth = 0i32;
     for (j, p) in pieces.iter().enumerate().skip(open) {
         match p.1.text {
             "(" => depth += 1,

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (467276) panicked at tests/conformance.rs:275:5:
assertion `left == right` failed
  left: "void f(void){}\n"
 right: "void f(void) {}\n"

failures:
    brace_attaches_for_functions_and_control

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
