*** src/reflow.rs:117:5: replace piece_open_paren -> Option<usize> with Some(1)

*** mutation diff:
--- src/reflow.rs
+++ replace piece_open_paren -> Option<usize> with Some(1)
@@ -109,30 +109,17 @@
 type Piece<'src> = (String, Token<'src>);
 
 fn same_line(gap: &str) -> bool {
     !gap.contains('\n')
 }
 
 /// Index of the `(` matching the `)` at `close`, scanning the piece list backward.
 fn piece_open_paren(pieces: &[Piece], close: usize) -> Option<usize> {
-    let mut depth = 0i32;
-    for j in (0..=close).rev() {
-        match pieces[j].1.text {
-            ")" => depth += 1,
-            "(" => {
-                depth -= 1;
-                if depth == 0 {
-                    return Some(j);
-                }
-            }
-            _ => {}
-        }
-    }
-    None
+    Some(1) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Index of the `)` matching the `(` at `open`, scanning forward.
 fn piece_close_paren(pieces: &[Piece], open: usize) -> Option<usize> {
     let mut depth = 0i32;
     for (j, p) in pieces.iter().enumerate().skip(open) {
         match p.1.text {
             "(" => depth += 1,

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (468908) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(\n\t&(struct config) {\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literal_brace_stays_tight stdout ----

thread 'compound_literal_brace_stays_tight' (468911) panicked at tests/conformance.rs:282:5:
assertion `left == right` failed
  left: "p = &(struct shape) {.x = 1};\n"
 right: "p = &(struct shape){.x = 1};\n"

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (468915) panicked at tests/conformance.rs:291:5:
assertion `left == right` failed
  left: "configure(&(struct opts) {.mode = 1, .flags = 0}, count);\n"
 right: "configure(&(struct opts){.mode = 1, .flags = 0}, count);\n"

failures:
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args

test result: FAILED. 47 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
