*** src/reflow.rs:135:5: replace piece_close_paren -> Option<usize> with None

*** mutation diff:
--- src/reflow.rs
+++ replace piece_close_paren -> Option<usize> with None
@@ -127,30 +127,17 @@
             _ => {}
         }
     }
     None
 }
 
 /// Index of the `)` matching the `(` at `open`, scanning forward.
 fn piece_close_paren(pieces: &[Piece], open: usize) -> Option<usize> {
-    let mut depth = 0i32;
-    for (j, p) in pieces.iter().enumerate().skip(open) {
-        match p.1.text {
-            "(" => depth += 1,
-            ")" => {
-                depth -= 1;
-                if depth == 0 {
-                    return Some(j);
-                }
-            }
-            _ => {}
-        }
-    }
-    None
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Apply the §2.5 token-spacing rules. Whitespace is semantically inert, so this never changes
 /// meaning; only the listed pairs are touched and everything else keeps its exact spacing.
 fn space_tokens(s: &str) -> String {
     let mut pieces: Vec<Piece> = Vec::new();
     let mut gap = String::new();
     for t in tokenize(s) {

---- casts_get_a_trailing_space stdout ----

thread 'casts_get_a_trailing_space' (472923) panicked at tests/conformance.rs:261:5:
assertion `left == right` failed
  left: "x = (int)y;\n"
 right: "x = (int) y;\n"

failures:
    casts_get_a_trailing_space

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
