*** src/reflow.rs:189:21: replace && with || in space_pointers

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in space_pointers
@@ -181,17 +181,17 @@
 /// function pointers `(*f)`, and bare-typedef pointers are left as is (§6).
 fn space_pointers(pieces: &mut [Piece]) {
     let is_star = |t: &Token| t.kind == TokenKind::Punct && t.text == "*";
     let mut j = 0;
     while j < pieces.len() {
         let prev_is_type = j > 0
             && (is_type_context(pieces[j - 1].1.text)
                 || (pieces[j - 1].1.kind == TokenKind::Ident
-                    && j >= 2
+                    || /* ~ changed by cargo-mutants ~ */ j >= 2
                     && matches!(pieces[j - 2].1.text, "struct" | "union" | "enum")));
         if is_star(&pieces[j].1) && prev_is_type && same_line(&pieces[j].0) {
             let mut k = j;
             while k + 1 < pieces.len() && is_star(&pieces[k + 1].1) && same_line(&pieces[k + 1].0) {
                 k += 1;
             }
             pieces[j].0 = " ".to_owned();
             for piece in &mut pieces[j + 1..=k] {

---- ambiguous_star_is_left_alone stdout ----

thread 'ambiguous_star_is_left_alone' (835228) panicked at tests/conformance.rs:242:5:
assertion `left == right` failed
  left: "z = a * b;\n"
 right: "z = a*b;\n"

---- statement_expression_in_code_block_indents stdout ----

thread 'statement_expression_in_code_block_indents' (835276) panicked at tests/conformance.rs:466:5:
assertion `left == right` failed
  left: "int d = ({\n\tint t = larger;\n\tt *2;\n});\n"
 right: "int d = ({\n\tint t = larger;\n\tt * 2;\n});\n"

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (835256) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

failures:
    ambiguous_star_is_left_alone
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    statement_expression_in_code_block_indents

test result: FAILED. 49 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
