*** src/reflow.rs:191:50: replace && with || in space_pointers

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in space_pointers
@@ -183,17 +183,17 @@
     let is_star = |t: &Token| t.kind == TokenKind::Punct && t.text == "*";
     let mut j = 0;
     while j < pieces.len() {
         let prev_is_type = j > 0
             && (is_type_context(pieces[j - 1].1.text)
                 || (pieces[j - 1].1.kind == TokenKind::Ident
                     && j >= 2
                     && matches!(pieces[j - 2].1.text, "struct" | "union" | "enum")));
-        if is_star(&pieces[j].1) && prev_is_type && same_line(&pieces[j].0) {
+        if is_star(&pieces[j].1) && prev_is_type || /* ~ changed by cargo-mutants ~ */ same_line(&pieces[j].0) {
             let mut k = j;
             while k + 1 < pieces.len() && is_star(&pieces[k + 1].1) && same_line(&pieces[k + 1].0) {
                 k += 1;
             }
             pieces[j].0 = " ".to_owned();
             for piece in &mut pieces[j + 1..=k] {
                 piece.0.clear();
             }

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (837496) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: " struct s {\n\tint x: 2 ;\n} ;\n"
 right: "struct s {\n\tint x: 2;\n};\n"

---- ambiguous_star_is_left_alone stdout ----

thread 'ambiguous_star_is_left_alone' (837495) panicked at tests/conformance.rs:242:5:
assertion `left == right` failed
  left: " z = a* b ;\n"
 right: "z = a*b;\n"

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (837497) panicked at tests/conformance.rs:337:5:
assertion `left == right` failed
  left: " int a ;\n\nint b ;\n"
 right: "int a;\n\nint b;\n"

failures:
    ambiguous_star_is_left_alone
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    block_comment_internals_are_untouched
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes

test result: FAILED. 3 passed; 50 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
