*** src/reflow.rs:193:25: replace < with > in space_pointers

*** mutation diff:
--- src/reflow.rs
+++ replace < with > in space_pointers
@@ -185,17 +185,17 @@
     while j < pieces.len() {
         let prev_is_type = j > 0
             && (is_type_context(pieces[j - 1].1.text)
                 || (pieces[j - 1].1.kind == TokenKind::Ident
                     && j >= 2
                     && matches!(pieces[j - 2].1.text, "struct" | "union" | "enum")));
         if is_star(&pieces[j].1) && prev_is_type && same_line(&pieces[j].0) {
             let mut k = j;
-            while k + 1 < pieces.len() && is_star(&pieces[k + 1].1) && same_line(&pieces[k + 1].0) {
+            while k + 1 > /* ~ changed by cargo-mutants ~ */ pieces.len() && is_star(&pieces[k + 1].1) && same_line(&pieces[k + 1].0) {
                 k += 1;
             }
             pieces[j].0 = " ".to_owned();
             for piece in &mut pieces[j + 1..=k] {
                 piece.0.clear();
             }
             if let Some(after) = pieces.get_mut(k + 1)
                 && same_line(&after.0)

---- pointers_are_middle_spaced_after_type_keywords stdout ----

thread 'pointers_are_middle_spaced_after_type_keywords' (492668) panicked at tests/conformance.rs:234:5:
assertion `left == right` failed
  left: "int **p;\n"
 right: "int ** p;\n"

failures:
    pointers_are_middle_spaced_after_type_keywords

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
