*** src/reflow.rs:193:61: replace + with * in space_pointers

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in space_pointers
@@ -185,17 +185,17 @@
     while j < pieces.len() {
         let prev_is_type = j > 0
             && (is_type_context(pieces[j - 1].1.text)
                 || (pieces[j - 1].1.kind == TokenKind::Ident
                     && j >= 2
                     && matches!(pieces[j - 2].1.text, "struct" | "union" | "enum")));
         if is_star(&pieces[j].1) && prev_is_type && same_line(&pieces[j].0) {
             let mut k = j;
-            while k + 1 < pieces.len() && is_star(&pieces[k + 1].1) && same_line(&pieces[k + 1].0) {
+            while k + 1 < pieces.len() && is_star(&pieces[k * /* ~ changed by cargo-mutants ~ */ 1].1) && same_line(&pieces[k + 1].0) {
                 k += 1;
             }
             pieces[j].0 = " ".to_owned();
             for piece in &mut pieces[j + 1..=k] {
                 piece.0.clear();
             }
             if let Some(after) = pieces.get_mut(k + 1)
                 && same_line(&after.0)

---- pointers_are_middle_spaced_after_type_keywords stdout ----

thread 'pointers_are_middle_spaced_after_type_keywords' (495992) panicked at tests/conformance.rs:233:5:
assertion `left == right` failed
  left: "int *p;\n"
 right: "int * p;\n"

---- nested_paren_comma_is_not_a_split_point stdout ----

thread 'nested_paren_comma_is_not_a_split_point' (495989) panicked at tests/conformance.rs:143:5:
assertion `left == right` failed: inner comma must stay inside the nested parens
  left: "register_cb(int (*cb)(void *ctx, int status), int n);\n"
 right: "register_cb(int (*cb)(void * ctx, int status), int n);\n"

---- passthrough_for_call_free_input stdout ----

thread 'passthrough_for_call_free_input' (495991) panicked at tests/conformance.rs:114:9:
assertion `left == right` failed: call-free input must be unchanged: "char const * p = \"a\\\"b\\n\"; char c = '\\'';\n"
  left: "char const *p= \"a\\\"b\\n\"; char c = '\\'';\n"
 right: "char const * p = \"a\\\"b\\n\"; char c = '\\'';\n"

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    nested_paren_comma_is_not_a_split_point
    passthrough_for_call_free_input
    pointers_are_middle_spaced_after_type_keywords
    struct_tag_pointer_is_middle_spaced

test result: FAILED. 45 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
