*** src/reflow.rs:193:69: replace && with || in space_pointers

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in space_pointers
@@ -185,17 +185,17 @@
     while j < pieces.len() {
         let prev_is_type = j > 0
             && (is_type_context(pieces[j - 1].1.text)
                 || (pieces[j - 1].1.kind == TokenKind::Ident
                     && j >= 2
                     && matches!(pieces[j - 2].1.text, "struct" | "union" | "enum")));
         if is_star(&pieces[j].1) && prev_is_type && same_line(&pieces[j].0) {
             let mut k = j;
-            while k + 1 < pieces.len() && is_star(&pieces[k + 1].1) && same_line(&pieces[k + 1].0) {
+            while k + 1 < pieces.len() && is_star(&pieces[k + 1].1) || /* ~ changed by cargo-mutants ~ */ same_line(&pieces[k + 1].0) {
                 k += 1;
             }
             pieces[j].0 = " ".to_owned();
             for piece in &mut pieces[j + 1..=k] {
                 piece.0.clear();
             }
             if let Some(after) = pieces.get_mut(k + 1)
                 && same_line(&after.0)

---- casts_get_a_trailing_space stdout ----

thread 'casts_get_a_trailing_space' (838794) panicked at src/reflow.rs:193:118:
index out of bounds: the len is 8 but the index is 8

---- passthrough_for_call_free_input stdout ----

thread 'passthrough_for_call_free_input' (838828) panicked at src/reflow.rs:193:118:
index out of bounds: the len is 12 but the index is 12

---- nested_paren_comma_is_not_a_split_point stdout ----

thread 'nested_paren_comma_is_not_a_split_point' (838827) panicked at src/reflow.rs:193:118:
index out of bounds: the len is 20 but the index is 20

failures:
    casts_get_a_trailing_space
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    messy_real_world_input_is_idempotent_and_safe
    nested_paren_comma_is_not_a_split_point
    passthrough_for_call_free_input
    pointers_are_middle_spaced_after_type_keywords
    struct_tag_pointer_is_middle_spaced

test result: FAILED. 44 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
