*** src/reflow.rs:194:19: replace += with -= in space_pointers

*** mutation diff:
--- src/reflow.rs
+++ replace += with -= in space_pointers
@@ -186,17 +186,17 @@
         let prev_is_type = j > 0
             && (is_type_context(pieces[j - 1].1.text)
                 || (pieces[j - 1].1.kind == TokenKind::Ident
                     && j >= 2
                     && matches!(pieces[j - 2].1.text, "struct" | "union" | "enum")));
         if is_star(&pieces[j].1) && prev_is_type && same_line(&pieces[j].0) {
             let mut k = j;
             while k + 1 < pieces.len() && is_star(&pieces[k + 1].1) && same_line(&pieces[k + 1].0) {
-                k += 1;
+                k -= /* ~ changed by cargo-mutants ~ */ 1;
             }
             pieces[j].0 = " ".to_owned();
             for piece in &mut pieces[j + 1..=k] {
                 piece.0.clear();
             }
             if let Some(after) = pieces.get_mut(k + 1)
                 && same_line(&after.0)
             {

---- pointers_are_middle_spaced_after_type_keywords stdout ----

thread 'pointers_are_middle_spaced_after_type_keywords' (844166) panicked at src/reflow.rs:194:17:
attempt to subtract with overflow

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (844152) panicked at src/reflow.rs:197:37:
slice index starts at 569 but ends at 567

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (844149) panicked at src/reflow.rs:197:37:
slice index starts at 569 but ends at 567

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    pointers_are_middle_spaced_after_type_keywords
    showcase_content_is_preserved

test result: FAILED. 48 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
