*** src/reflow.rs:200:51: replace + with - in space_pointers

*** mutation diff:
--- src/reflow.rs
+++ replace + with - in space_pointers
@@ -192,17 +192,17 @@
             let mut k = j;
             while k + 1 < pieces.len() && is_star(&pieces[k + 1].1) && same_line(&pieces[k + 1].0) {
                 k += 1;
             }
             pieces[j].0 = " ".to_owned();
             for piece in &mut pieces[j + 1..=k] {
                 piece.0.clear();
             }
-            if let Some(after) = pieces.get_mut(k + 1)
+            if let Some(after) = pieces.get_mut(k - /* ~ changed by cargo-mutants ~ */ 1)
                 && same_line(&after.0)
             {
                 after.0 = if after.1.kind == TokenKind::Ident {
                     " ".to_owned()
                 } else {
                     String::new()
                 };
             }

---- casts_get_a_trailing_space stdout ----

thread 'casts_get_a_trailing_space' (499710) panicked at tests/conformance.rs:262:5:
assertion `left == right` failed
  left: "p = ( void *) q;\n"
 right: "p = (void *) q;\n"

---- struct_tag_pointer_is_middle_spaced stdout ----

thread 'struct_tag_pointer_is_middle_spaced' (499753) panicked at tests/conformance.rs:255:5:
assertion `left == right` failed
  left: "struct shape *s;\n"
 right: "struct shape * s;\n"

---- pointers_are_middle_spaced_after_type_keywords stdout ----

thread 'pointers_are_middle_spaced_after_type_keywords' (499744) panicked at tests/conformance.rs:233:5:
assertion `left == right` failed
  left: " int *p;\n"
 right: "int * p;\n"

failures:
    casts_get_a_trailing_space
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    nested_paren_comma_is_not_a_split_point
    pointers_are_middle_spaced_after_type_keywords
    struct_tag_pointer_is_middle_spaced

test result: FAILED. 45 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
