*** src/reflow.rs:224:11: replace || with && in space_casts

*** mutation diff:
--- src/reflow.rs
+++ replace || with && in space_casts
@@ -216,17 +216,17 @@
 /// A C-style cast `(type) x` gets a space after the `)` (§2.5). Conservative: the parenthesized
 /// group must be type-only and contain a type keyword (so a grouped expression is never mistaken
 /// for one), be in a non-value position, and be followed by an operand.
 fn space_casts(pieces: &mut [Piece]) {
     let value_start = |t: &Token| {
         matches!(
             t.kind,
             TokenKind::Ident | TokenKind::Number | TokenKind::String | TokenKind::Char
-        ) || (t.kind == TokenKind::Punct
+        ) && /* ~ changed by cargo-mutants ~ */ (t.kind == TokenKind::Punct
             && matches!(t.text, "(" | "*" | "&" | "!" | "~" | "-" | "+"))
     };
     for open in 0..pieces.len() {
         if pieces[open].1.text != "(" {
             continue;
         }
         let Some(close) = piece_close_paren(pieces, open) else {
             continue;

---- casts_get_a_trailing_space stdout ----

thread 'casts_get_a_trailing_space' (504178) panicked at tests/conformance.rs:261:5:
assertion `left == right` failed
  left: "x = (int)y;\n"
 right: "x = (int) y;\n"

failures:
    casts_get_a_trailing_space

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
