*** src/reflow.rs:228:32: replace != with == in space_casts

*** mutation diff:
--- src/reflow.rs
+++ replace != with == in space_casts
@@ -220,17 +220,17 @@
     let value_start = |t: &Token| {
         matches!(
             t.kind,
             TokenKind::Ident | TokenKind::Number | TokenKind::String | TokenKind::Char
         ) || (t.kind == TokenKind::Punct
             && matches!(t.text, "(" | "*" | "&" | "!" | "~" | "-" | "+"))
     };
     for open in 0..pieces.len() {
-        if pieces[open].1.text != "(" {
+        if pieces[open].1.text == /* ~ changed by cargo-mutants ~ */ "(" {
             continue;
         }
         let Some(close) = piece_close_paren(pieces, open) else {
             continue;
         };
         let inner = &pieces[open + 1..close];
         let type_only = inner.iter().all(|p| {
             p.1.kind == TokenKind::Ident

---- casts_get_a_trailing_space stdout ----

thread 'casts_get_a_trailing_space' (852793) panicked at tests/conformance.rs:261:5:
assertion `left == right` failed
  left: "x = (int)y;\n"
 right: "x = (int) y;\n"

failures:
    casts_get_a_trailing_space

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
