*** src/reflow.rs:237:17: replace || with && in space_casts

*** mutation diff:
--- src/reflow.rs
+++ replace || with && in space_casts
@@ -229,17 +229,17 @@
             continue;
         }
         let Some(close) = piece_close_paren(pieces, open) else {
             continue;
         };
         let inner = &pieces[open + 1..close];
         let type_only = inner.iter().all(|p| {
             p.1.kind == TokenKind::Ident
-                || matches!(p.1.text, "*" | "[" | "]")
+                && /* ~ changed by cargo-mutants ~ */ matches!(p.1.text, "*" | "[" | "]")
                 || p.1.kind == TokenKind::Number
         });
         let has_type = inner
             .iter()
             .any(|p| is_type_context(p.1.text) || matches!(p.1.text, "struct" | "union" | "enum"));
         let prev_is_value = open > 0
             && (pieces[open - 1].1.kind == TokenKind::Ident
                 || matches!(pieces[open - 1].1.text, ")" | "]"));

---- casts_get_a_trailing_space stdout ----

thread 'casts_get_a_trailing_space' (507771) panicked at tests/conformance.rs:261:5:
assertion `left == right` failed
  left: "x = (int)y;\n"
 right: "x = (int) y;\n"

failures:
    casts_get_a_trailing_space

test result: FAILED. 50 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
