*** src/reflow.rs:260:29: replace == with != in space_braces

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in space_braces
@@ -252,17 +252,17 @@
     }
 }
 
 /// K&R brace attach: `) {` keeps one space (§2.5) for function and control bodies, but the tight
 /// `({` statement-expression and `(type){...}` compound literal are left alone. The matching `(`
 /// follows an identifier for the former and an operator/`&`/`=` for the latter, which decides it.
 fn space_braces(pieces: &mut [Piece]) {
     for j in 1..pieces.len() {
-        if pieces[j].1.text == "{" && pieces[j - 1].1.text == ")" && same_line(&pieces[j].0) {
+        if pieces[j].1.text != /* ~ changed by cargo-mutants ~ */ "{" && pieces[j - 1].1.text == ")" && same_line(&pieces[j].0) {
             let function_or_control = piece_open_paren(pieces, j - 1)
                 .and_then(|open| open.checked_sub(1))
                 .is_some_and(|before| pieces[before].1.kind == TokenKind::Ident);
             if function_or_control {
                 pieces[j].0 = " ".to_owned();
             }
         }
     }

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (866791) panicked at tests/conformance.rs:275:5:
assertion `left == right` failed
  left: "void f(void){}\n"
 right: "void f(void) {}\n"

---- call_with_line_comment_passes_through stdout ----

thread 'call_with_line_comment_passes_through' (866792) panicked at tests/conformance.rs:217:5:
assertion `left == right` failed: comment-bearing calls must not be reflowed
  left: "f(\n\t// keep me\n\tNULL,\n\t&x\n) ;\n"
 right: "f(\n\t// keep me\n\tNULL,\n\t&x\n);\n"

---- casts_get_a_trailing_space stdout ----

thread 'casts_get_a_trailing_space' (866793) panicked at tests/conformance.rs:270:5:
assertion `left == right` failed
  left: "v = sizeof(int) ;\n"
 right: "v = sizeof(int);\n"

failures:
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literals_in_function_args
    control_headers_are_not_calls
    function_pointer_star_is_not_spaced
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    long_call_explodes_one_per_line
    long_ternary_chain_explodes_flat_with_trailing_colons

test result: FAILED. 37 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
