*** src/reflow.rs:260:67: replace && with || in space_braces

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in space_braces
@@ -252,17 +252,17 @@
     }
 }
 
 /// K&R brace attach: `) {` keeps one space (§2.5) for function and control bodies, but the tight
 /// `({` statement-expression and `(type){...}` compound literal are left alone. The matching `(`
 /// follows an identifier for the former and an operator/`&`/`=` for the latter, which decides it.
 fn space_braces(pieces: &mut [Piece]) {
     for j in 1..pieces.len() {
-        if pieces[j].1.text == "{" && pieces[j - 1].1.text == ")" && same_line(&pieces[j].0) {
+        if pieces[j].1.text == "{" && pieces[j - 1].1.text == ")" || /* ~ changed by cargo-mutants ~ */ same_line(&pieces[j].0) {
             let function_or_control = piece_open_paren(pieces, j - 1)
                 .and_then(|open| open.checked_sub(1))
                 .is_some_and(|before| pieces[before].1.kind == TokenKind::Ident);
             if function_or_control {
                 pieces[j].0 = " ".to_owned();
             }
         }
     }

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (519310) panicked at tests/conformance.rs:339:5:
assertion `left == right` failed
  left: "void f(void) {\n\tint a ;\n\n\tint b ;\n}\n"
 right: "void f(void) {\n\tint a;\n\n\tint b;\n}\n"

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (519313) panicked at tests/conformance.rs:275:5:
assertion `left == right` failed
  left: "void f(void) { }\n"
 right: "void f(void) {}\n"

---- call_with_line_comment_passes_through stdout ----

thread 'call_with_line_comment_passes_through' (519314) panicked at tests/conformance.rs:217:5:
assertion `left == right` failed: comment-bearing calls must not be reflowed
  left: "f(\n\t// keep me\n\tNULL,\n\t&x\n) ;\n"
 right: "f(\n\t// keep me\n\tNULL,\n\t&x\n);\n"

failures:
    blank_line_runs_collapse_to_one_everywhere
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literals_in_function_args
    control_headers_are_not_calls
    control_keyword_gets_one_space_before_paren
    do_while_macro_passes_through
    function_like_macro_body_opens_on_define_line
    function_pointer_star_is_not_spaced

test result: FAILED. 30 passed; 21 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
