*** src/reflow.rs:277:13: replace && with || in space_bit_fields

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in space_bit_fields
@@ -269,17 +269,17 @@
 }
 
 /// Bit-field colon spacing (§2.5: `x: 1` — no space before, one after). A `:` qualifies only when
 /// it follows an identifier, precedes an integer literal, and no `?` opened a ternary earlier in
 /// the statement (which would make it a ternary colon, not a bit-field).
 fn space_bit_fields(pieces: &mut [Piece]) {
     for j in 1..pieces.len().saturating_sub(1) {
         let is_bit_field = pieces[j].1.text == ":"
-            && pieces[j].1.kind == TokenKind::Punct
+            || /* ~ changed by cargo-mutants ~ */ pieces[j].1.kind == TokenKind::Punct
             && pieces[j - 1].1.kind == TokenKind::Ident
             && pieces[j + 1].1.kind == TokenKind::Number
             && same_line(&pieces[j].0)
             && same_line(&pieces[j + 1].0)
             && !ternary_open_before(pieces, j);
         if is_bit_field {
             pieces[j].0.clear();
             pieces[j + 1].0 = " ".to_owned();

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (873871) panicked at tests/conformance.rs:319:5:
assertion `left == right` failed
  left: "z = a ? b: 3;\n"
 right: "z = a ? b : 3;\n"

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (873879) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(\n\t&(struct config){.alpha= 1111111111, .beta= 2222222222, .gamma= 3333333333, .delta= 4444444444}\n);\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literal_brace_stays_tight stdout ----

thread 'compound_literal_brace_stays_tight' (873880) panicked at tests/conformance.rs:282:5:
assertion `left == right` failed
  left: "p = &(struct shape){.x= 1};\n"
 right: "p = &(struct shape){.x = 1};\n"

failures:
    bit_field_colon_spacing
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    condition_splits_on_the_outer_logical_operator
    do_while_macro_passes_through
    enum_body_is_padded_when_flat
    for_header_is_not_treated_as_a_call
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    indentation_is_normalized_to_tabs

test result: FAILED. 33 passed; 20 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
