*** src/reflow.rs:279:37: replace == with != in space_bit_fields

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in space_bit_fields
@@ -271,17 +271,17 @@
 /// Bit-field colon spacing (§2.5: `x: 1` — no space before, one after). A `:` qualifies only when
 /// it follows an identifier, precedes an integer literal, and no `?` opened a ternary earlier in
 /// the statement (which would make it a ternary colon, not a bit-field).
 fn space_bit_fields(pieces: &mut [Piece]) {
     for j in 1..pieces.len().saturating_sub(1) {
         let is_bit_field = pieces[j].1.text == ":"
             && pieces[j].1.kind == TokenKind::Punct
             && pieces[j - 1].1.kind == TokenKind::Ident
-            && pieces[j + 1].1.kind == TokenKind::Number
+            && pieces[j + 1].1.kind != /* ~ changed by cargo-mutants ~ */ TokenKind::Number
             && same_line(&pieces[j].0)
             && same_line(&pieces[j + 1].0)
             && !ternary_open_before(pieces, j);
         if is_bit_field {
             pieces[j].0.clear();
             pieces[j + 1].0 = " ".to_owned();
         }
     }

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (530698) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: "struct s {\n\tint x:2;\n};\n"
 right: "struct s {\n\tint x: 2;\n};\n"

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (530742) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (530738) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    bit_field_colon_spacing
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 48 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
