*** src/reflow.rs:280:13: replace && with || in space_bit_fields

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in space_bit_fields
@@ -272,17 +272,17 @@
 /// it follows an identifier, precedes an integer literal, and no `?` opened a ternary earlier in
 /// the statement (which would make it a ternary colon, not a bit-field).
 fn space_bit_fields(pieces: &mut [Piece]) {
     for j in 1..pieces.len().saturating_sub(1) {
         let is_bit_field = pieces[j].1.text == ":"
             && pieces[j].1.kind == TokenKind::Punct
             && pieces[j - 1].1.kind == TokenKind::Ident
             && pieces[j + 1].1.kind == TokenKind::Number
-            && same_line(&pieces[j].0)
+            || /* ~ changed by cargo-mutants ~ */ same_line(&pieces[j].0)
             && same_line(&pieces[j + 1].0)
             && !ternary_open_before(pieces, j);
         if is_bit_field {
             pieces[j].0.clear();
             pieces[j + 1].0 = " ".to_owned();
         }
     }
 }

---- ambiguous_star_is_left_alone stdout ----

thread 'ambiguous_star_is_left_alone' (872195) panicked at tests/conformance.rs:242:5:
assertion `left == right` failed
  left: "z=a*b ;\n"
 right: "z = a*b;\n"

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (872196) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: "structs {\n\tintx:2 ;\n};\n"
 right: "struct s {\n\tint x: 2;\n};\n"

---- block_comment_internals_are_untouched stdout ----

thread 'block_comment_internals_are_untouched' (872198) panicked at tests/conformance.rs:361:5:
assertion `left == right` failed: comment bodies are sacred (§2.1)
  left: "/*\n * aligned\n *   deeper\n */\nintx ;\n"
 right: "/*\n * aligned\n *   deeper\n */\nint x;\n"

failures:
    ambiguous_star_is_left_alone
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    block_comment_internals_are_untouched
    brace_attaches_for_functions_and_control
    casts_get_a_trailing_space
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    condition_splits_on_the_outer_logical_operator

test result: FAILED. 4 passed; 49 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
