*** src/reflow.rs:281:36: replace + with * in space_bit_fields

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in space_bit_fields
@@ -273,17 +273,17 @@
 /// the statement (which would make it a ternary colon, not a bit-field).
 fn space_bit_fields(pieces: &mut [Piece]) {
     for j in 1..pieces.len().saturating_sub(1) {
         let is_bit_field = pieces[j].1.text == ":"
             && pieces[j].1.kind == TokenKind::Punct
             && pieces[j - 1].1.kind == TokenKind::Ident
             && pieces[j + 1].1.kind == TokenKind::Number
             && same_line(&pieces[j].0)
-            && same_line(&pieces[j + 1].0)
+            && same_line(&pieces[j * /* ~ changed by cargo-mutants ~ */ 1].0)
             && !ternary_open_before(pieces, j);
         if is_bit_field {
             pieces[j].0.clear();
             pieces[j + 1].0 = " ".to_owned();
         }
     }
 }

*** result: Success
