*** src/reflow.rs:282:13: replace && with || in space_bit_fields

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in space_bit_fields
@@ -274,17 +274,17 @@
 fn space_bit_fields(pieces: &mut [Piece]) {
     for j in 1..pieces.len().saturating_sub(1) {
         let is_bit_field = pieces[j].1.text == ":"
             && pieces[j].1.kind == TokenKind::Punct
             && pieces[j - 1].1.kind == TokenKind::Ident
             && pieces[j + 1].1.kind == TokenKind::Number
             && same_line(&pieces[j].0)
             && same_line(&pieces[j + 1].0)
-            && !ternary_open_before(pieces, j);
+            || /* ~ changed by cargo-mutants ~ */ !ternary_open_before(pieces, j);
         if is_bit_field {
             pieces[j].0.clear();
             pieces[j + 1].0 = " ".to_owned();
         }
     }
 }
 
 /// Whether an unmatched `?` precedes index `j` within the current statement (back to `;`/`{`/`}`).

---- ambiguous_star_is_left_alone stdout ----

thread 'ambiguous_star_is_left_alone' (870476) panicked at tests/conformance.rs:242:5:
assertion `left == right` failed
  left: "z=a*b ;\n"
 right: "z = a*b;\n"

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (870477) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: "structs{intx:2;} ;\n"
 right: "struct s {\n\tint x: 2;\n};\n"

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (870478) panicked at tests/conformance.rs:337:5:
assertion `left == right` failed
  left: "inta;intb ;\n"
 right: "int a;\n\nint b;\n"

failures:
    ambiguous_star_is_left_alone
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    block_comment_internals_are_untouched
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes

test result: FAILED. 3 passed; 50 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
