*** src/reflow.rs:292:5: replace ternary_open_before -> bool with true

*** mutation diff:
--- src/reflow.rs
+++ replace ternary_open_before -> bool with true
@@ -284,24 +284,17 @@
             pieces[j].0.clear();
             pieces[j + 1].0 = " ".to_owned();
         }
     }
 }
 
 /// Whether an unmatched `?` precedes index `j` within the current statement (back to `;`/`{`/`}`).
 fn ternary_open_before(pieces: &[Piece], j: usize) -> bool {
-    for p in pieces[..j].iter().rev() {
-        match p.1.text {
-            "?" => return true,
-            ";" | "{" | "}" => return false,
-            _ => {}
-        }
-    }
-    false
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Normalize every line ending to LF and guarantee exactly one trailing newline (§2.1). An
 /// all-whitespace input yields the empty string.
 fn normalize_endings(s: &str) -> String {
     let lf = s.replace("\r\n", "\n").replace('\r', "\n");
     let trimmed = lf.trim_end();
     if trimmed.is_empty() {

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (882039) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: "struct s {\n\tint x:2;\n};\n"
 right: "struct s {\n\tint x: 2;\n};\n"

failures:
    bit_field_colon_spacing

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
