*** src/reflow.rs:295:13: delete match arm ";" | "{" | "}" in ternary_open_before

*** mutation diff:
--- src/reflow.rs
+++ delete match arm ";" | "{" | "}" in ternary_open_before
@@ -287,17 +287,17 @@
     }
 }
 
 /// Whether an unmatched `?` precedes index `j` within the current statement (back to `;`/`{`/`}`).
 fn ternary_open_before(pieces: &[Piece], j: usize) -> bool {
     for p in pieces[..j].iter().rev() {
         match p.1.text {
             "?" => return true,
-            ";" | "{" | "}" => return false,
+             /* ~ changed by cargo-mutants ~ */
             _ => {}
         }
     }
     false
 }
 
 /// Normalize every line ending to LF and guarantee exactly one trailing newline (§2.1). An
 /// all-whitespace input yields the empty string.

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (536258) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A(\n\t{\n\t\t\"\";,\n\t}\n)\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:28.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")", width = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (536256) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"\"\"A({\"\";})\n"`,
 right: `"\"\"A({\n\t\"\";\n})\n"` at tests/properties.rs:17.
minimal failing input: s = "\"\"A({\"\"}]\"\"''\"\"\"\")"
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
