*** src/reflow.rs:305:5: replace normalize_endings -> String with "xyzzy".into()

*** mutation diff:
--- src/reflow.rs
+++ replace normalize_endings -> String with "xyzzy".into()
@@ -297,25 +297,17 @@
         }
     }
     false
 }
 
 /// Normalize every line ending to LF and guarantee exactly one trailing newline (§2.1). An
 /// all-whitespace input yields the empty string.
 fn normalize_endings(s: &str) -> String {
-    let lf = s.replace("\r\n", "\n").replace('\r', "\n");
-    let trimmed = lf.trim_end();
-    if trimmed.is_empty() {
-        return String::new();
-    }
-    let mut out = String::with_capacity(trimmed.len() + 1);
-    out.push_str(trimmed);
-    out.push('\n');
-    out
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Normalize every line's leading indentation to hard tabs (§2.1): re-lex the output and rewrite
 /// each line-leading whitespace run as `cols / TAB_WIDTH` tabs plus the remainder in spaces.
 /// Comment- and string-safe — their bodies are single tokens, never line-leading whitespace.
 fn retab(s: &str) -> String {
     let mut out = String::with_capacity(s.len());
     let mut at_line_start = true;

---- ambiguous_star_is_left_alone stdout ----

thread 'ambiguous_star_is_left_alone' (537273) panicked at tests/conformance.rs:242:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "z = a*b;\n"

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (537275) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "struct s {\n\tint x: 2;\n};\n"

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (537277) panicked at tests/conformance.rs:337:5:
assertion `left == right` failed
  left: "xyzzy"
 right: "int a;\n\nint b;\n"

failures:
    ambiguous_star_is_left_alone
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    block_comment_internals_are_untouched
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes

test result: FAILED. 2 passed; 49 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
