*** src/reflow.rs:320:5: replace retab -> String with String::new()

*** mutation diff:
--- src/reflow.rs
+++ replace retab -> String with String::new()
@@ -312,39 +312,17 @@
     out.push('\n');
     out
 }
 
 /// Normalize every line's leading indentation to hard tabs (§2.1): re-lex the output and rewrite
 /// each line-leading whitespace run as `cols / TAB_WIDTH` tabs plus the remainder in spaces.
 /// Comment- and string-safe — their bodies are single tokens, never line-leading whitespace.
 fn retab(s: &str) -> String {
-    let mut out = String::with_capacity(s.len());
-    let mut at_line_start = true;
-    for t in tokenize(s) {
-        let pure_indent =
-            t.kind == TokenKind::Whitespace && t.text.bytes().all(|b| b == b' ' || b == b'\t');
-        if at_line_start && pure_indent {
-            let cols: usize = t
-                .text
-                .chars()
-                .map(|c| if c == '\t' { TAB_WIDTH } else { 1 })
-                .sum();
-            for _ in 0..cols / TAB_WIDTH {
-                out.push('\t');
-            }
-            for _ in 0..cols % TAB_WIDTH {
-                out.push(' ');
-            }
-        } else {
-            out.push_str(t.text);
-        }
-        at_line_start = t.kind == TokenKind::Newline;
-    }
-    out
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Run the structuring pass over `toks`, with the cursor starting at `start_col` (non-zero when
 /// formatting a fragment such as a macro body that follows a prefix).
 fn structure(toks: &[Token], start_col: usize, width: usize) -> String {
     let mut out = String::new();
     let mut col = start_col;
     let mut i = 0usize;

---- ambiguous_star_is_left_alone stdout ----

thread 'ambiguous_star_is_left_alone' (883921) panicked at tests/conformance.rs:242:5:
assertion `left == right` failed
  left: ""
 right: "z = a*b;\n"

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (883924) panicked at tests/conformance.rs:337:5:
assertion `left == right` failed
  left: ""
 right: "int a;\n\nint b;\n"

---- block_comment_internals_are_untouched stdout ----

thread 'block_comment_internals_are_untouched' (883926) panicked at tests/conformance.rs:361:5:
assertion `left == right` failed: comment bodies are sacred (§2.1)
  left: ""
 right: "/*\n * aligned\n *   deeper\n */\nint x;\n"

failures:
    ambiguous_star_is_left_alone
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    block_comment_internals_are_untouched
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes

test result: FAILED. 2 passed; 51 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
