*** src/reflow.rs:324:20: replace == with != in retab

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in retab
@@ -316,17 +316,17 @@
 /// Normalize every line's leading indentation to hard tabs (§2.1): re-lex the output and rewrite
 /// each line-leading whitespace run as `cols / TAB_WIDTH` tabs plus the remainder in spaces.
 /// Comment- and string-safe — their bodies are single tokens, never line-leading whitespace.
 fn retab(s: &str) -> String {
     let mut out = String::with_capacity(s.len());
     let mut at_line_start = true;
     for t in tokenize(s) {
         let pure_indent =
-            t.kind == TokenKind::Whitespace && t.text.bytes().all(|b| b == b' ' || b == b'\t');
+            t.kind != /* ~ changed by cargo-mutants ~ */ TokenKind::Whitespace && t.text.bytes().all(|b| b == b' ' || b == b'\t');
         if at_line_start && pure_indent {
             let cols: usize = t
                 .text
                 .chars()
                 .map(|c| if c == '\t' { TAB_WIDTH } else { 1 })
                 .sum();
             for _ in 0..cols / TAB_WIDTH {
                 out.push('\t');

---- indentation_is_normalized_to_tabs stdout ----

thread 'indentation_is_normalized_to_tabs' (539179) panicked at tests/conformance.rs:210:5:
assertion `left == right` failed
  left: "void f(void) {\n    int x = 1;\n        int y = 2;\n}\n"
 right: "void f(void) {\n\tint x = 1;\n\t\tint y = 2;\n}\n"

---- initializer_with_comment_keeps_structure_but_retabs stdout ----

thread 'initializer_with_comment_keeps_structure_but_retabs' (539180) panicked at tests/conformance.rs:203:5:
assertion `left == right` failed
  left: "int v[] = {\n    1, /* one */\n    2,\n};\n"
 right: "int v[] = {\n\t1, /* one */\n\t2,\n};\n"

---- messy_real_world_input_is_idempotent_and_safe stdout ----

thread 'messy_real_world_input_is_idempotent_and_safe' (539186) panicked at tests/conformance.rs:78:13:
messy line 21 is space-indented code: "    uint32_t flags;"

failures:
    golden_acceptance_unguarded_showcase
    indentation_is_normalized_to_tabs
    initializer_with_comment_keeps_structure_but_retabs
    messy_real_world_input_is_idempotent_and_safe

test result: FAILED. 47 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
