*** src/reflow.rs:325:26: replace && with || in retab

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in retab
@@ -317,17 +317,17 @@
 /// each line-leading whitespace run as `cols / TAB_WIDTH` tabs plus the remainder in spaces.
 /// Comment- and string-safe — their bodies are single tokens, never line-leading whitespace.
 fn retab(s: &str) -> String {
     let mut out = String::with_capacity(s.len());
     let mut at_line_start = true;
     for t in tokenize(s) {
         let pure_indent =
             t.kind == TokenKind::Whitespace && t.text.bytes().all(|b| b == b' ' || b == b'\t');
-        if at_line_start && pure_indent {
+        if at_line_start || /* ~ changed by cargo-mutants ~ */ pure_indent {
             let cols: usize = t
                 .text
                 .chars()
                 .map(|c| if c == '\t' { TAB_WIDTH } else { 1 })
                 .sum();
             for _ in 0..cols / TAB_WIDTH {
                 out.push('\t');
             }

---- ambiguous_star_is_left_alone stdout ----

thread 'ambiguous_star_is_left_alone' (888189) panicked at tests/conformance.rs:242:5:
assertion `left == right` failed
  left: "  = a*b;\n"
 right: "z = a*b;\n"

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (888190) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: "\t   s {\n\tint x: 2;\n ;\n"
 right: "struct s {\n\tint x: 2;\n};\n"

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (888191) panicked at tests/conformance.rs:337:5:
assertion `left == right` failed
  left: "    a;\n      b;\n"
 right: "int a;\n\nint b;\n"

failures:
    ambiguous_star_is_left_alone
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    block_comment_internals_are_untouched
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes

test result: FAILED. 1 passed; 52 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
