*** src/reflow.rs:334:30: replace % with + in retab

*** mutation diff:
--- src/reflow.rs
+++ replace % with + in retab
@@ -326,17 +326,17 @@
             let cols: usize = t
                 .text
                 .chars()
                 .map(|c| if c == '\t' { TAB_WIDTH } else { 1 })
                 .sum();
             for _ in 0..cols / TAB_WIDTH {
                 out.push('\t');
             }
-            for _ in 0..cols % TAB_WIDTH {
+            for _ in 0..cols + /* ~ changed by cargo-mutants ~ */ TAB_WIDTH {
                 out.push(' ');
             }
         } else {
             out.push_str(t.text);
         }
         at_line_start = t.kind == TokenKind::Newline;
     }
     out

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (890599) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: "struct s {\n\t        int x: 2;\n};\n"
 right: "struct s {\n\tint x: 2;\n};\n"

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (890600) panicked at tests/conformance.rs:339:5:
assertion `left == right` failed
  left: "void f(void) {\n\t        int a;\n\n\t        int b;\n}\n"
 right: "void f(void) {\n\tint a;\n\n\tint b;\n}\n"

---- call_with_line_comment_passes_through stdout ----

thread 'call_with_line_comment_passes_through' (890603) panicked at tests/conformance.rs:217:5:
assertion `left == right` failed: comment-bearing calls must not be reflowed
  left: "f(\n\t        // keep me\n\t        NULL,\n\t        &x\n);\n"
 right: "f(\n\t// keep me\n\tNULL,\n\t&x\n);\n"

failures:
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    call_with_line_comment_passes_through
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_initializer_explodes
    compound_literals_in_function_args
    condition_splits_on_the_outer_logical_operator
    declaration_with_brace_explodes_and_keeps_brace_attached
    do_while_macro_passes_through
    enum_magic_comma_explodes
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line

test result: FAILED. 26 passed; 27 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
