*** src/reflow.rs:357:52: replace + with - in structure

*** mutation diff:
--- src/reflow.rs
+++ replace + with - in structure
@@ -349,17 +349,17 @@
     let mut col = start_col;
     let mut i = 0usize;
     let mut paren_depth = 0i32;
     let mut in_init = false;
     while i < toks.len() {
         let t = toks[i];
 
         if t.kind == TokenKind::Punct && t.text == "#" && current_line_is_blank(&out) {
-            let is_define = next_nontrivia(toks, i + 1)
+            let is_define = next_nontrivia(toks, i - /* ~ changed by cargo-mutants ~ */ 1)
                 .is_some_and(|j| toks[j].kind == TokenKind::Ident && toks[j].text == "define");
             i = if is_define {
                 emit_define(toks, i, &mut out, &mut col, width)
             } else {
                 emit_directive(toks, i, &mut out, &mut col)
             };
             continue;
         }

---- do_while_macro_passes_through stdout ----

thread 'do_while_macro_passes_through' (549877) panicked at src/reflow.rs:357:50:
attempt to subtract with overflow

---- function_like_macro_body_opens_on_define_line stdout ----

thread 'function_like_macro_body_opens_on_define_line' (549882) panicked at src/reflow.rs:357:50:
attempt to subtract with overflow

---- generic_macro_explodes_one_association_per_line stdout ----

thread 'generic_macro_explodes_one_association_per_line' (549884) panicked at src/reflow.rs:357:50:
attempt to subtract with overflow

failures:
    do_while_macro_passes_through
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    passthrough_for_call_free_input
    short_object_macro_unchanged
    statement_expression_macro_blocks_with_continuations

test result: FAILED. 45 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
