*** src/reflow.rs:387:23: replace + with - in structure

*** mutation diff:
--- src/reflow.rs
+++ replace + with - in structure
@@ -379,17 +379,17 @@
                 build_for_doc(inner)
             } else {
                 build_cond_doc(inner)
             };
             let base_level = current_line_indent_cols(&out) / TAB_WIDTH;
             let reserved = trailing_reserved(toks, close + 1);
             let rendered = render(&doc, width.saturating_sub(reserved), col, base_level);
             emit_str(&mut out, &mut col, &rendered);
-            i = close + 1;
+            i = close - /* ~ changed by cargo-mutants ~ */ 1;
             continue;
         }
 
         if t.kind == TokenKind::Ident
             && t.text == "enum"
             && let Some(brace) = enum_body_brace(toks, i)
         {
             for tok in &toks[i..brace] {

---- brace_attaches_for_functions_and_control stdout ----

thread 'brace_attaches_for_functions_and_control' (558635) panicked at tests/conformance.rs:276:5:
assertion `left == right` failed
  left: "if (x)x) {}\n"
 right: "if (x) {}\n"

---- control_headers_are_not_calls stdout ----

thread 'control_headers_are_not_calls' (558646) panicked at tests/conformance.rs:153:5:
assertion `left == right` failed
  left: "if (a && b)b) { return f(x); }\n"
 right: "if (a && b) { return f(x); }\n"

---- control_keyword_gets_one_space_before_paren stdout ----

thread 'control_keyword_gets_one_space_before_paren' (558648) panicked at tests/conformance.rs:226:5:
assertion `left == right` failed
  left: "if (x)x) y;\n"
 right: "if (x) y;\n"

failures:
    brace_attaches_for_functions_and_control
    control_headers_are_not_calls
    control_keyword_gets_one_space_before_paren
    for_header_is_not_treated_as_a_call
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    long_for_header_explodes_one_clause_per_line
    long_if_condition_explodes_with_trailing_operators
    messy_real_world_input_is_idempotent_and_safe
    short_control_headers_unchanged
    showcase_content_is_preserved

test result: FAILED. 39 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
