*** src/reflow.rs:392:23: replace == with != in structure

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in structure
@@ -384,17 +384,17 @@
             let reserved = trailing_reserved(toks, close + 1);
             let rendered = render(&doc, width.saturating_sub(reserved), col, base_level);
             emit_str(&mut out, &mut col, &rendered);
             i = close + 1;
             continue;
         }
 
         if t.kind == TokenKind::Ident
-            && t.text == "enum"
+            && t.text != /* ~ changed by cargo-mutants ~ */ "enum"
             && let Some(brace) = enum_body_brace(toks, i)
         {
             for tok in &toks[i..brace] {
                 emit_str(&mut out, &mut col, tok.text);
             }
             i = emit_brace(toks, brace, true, &mut out, &mut col, width);
             continue;
         }

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (907181) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: "struct s { int x: 2; };\n"
 right: "struct s {\n\tint x: 2;\n};\n"

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (907207) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (907209) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

failures:
    bit_field_colon_spacing
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 50 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
