*** src/reflow.rs:403:56: replace + with * in structure

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in structure
@@ -395,17 +395,17 @@
             for tok in &toks[i..brace] {
                 emit_str(&mut out, &mut col, tok.text);
             }
             i = emit_brace(toks, brace, true, &mut out, &mut col, width);
             continue;
         }
 
         if is_call_head(toks, i)
-            && let Some(close) = match_bracket(toks, i + 1)
+            && let Some(close) = match_bracket(toks, i * /* ~ changed by cargo-mutants ~ */ 1)
             && !contains_comment(&toks[i + 2..close])
             && is_balanced(&toks[i + 2..close])
         {
             emit_str(&mut out, &mut col, t.text);
             let doc = build_call_doc(&toks[i + 2..close]);
             let base_level = current_line_indent_cols(&out) / TAB_WIDTH;
             let reserved = trailing_reserved(toks, close + 1);
             let rendered = render(&doc, width.saturating_sub(reserved), col, base_level);

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (561874) panicked at tests/conformance.rs:137:5:
assertion `left == right` failed
  left: "foo(\n\ta,\n\tb\n);\n"
 right: "foo(a, b);\n"

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (561876) panicked at tests/conformance.rs:309:5:
assertion `left == right` failed
  left: "init(&(struct config){.alpha = 1111111111, .beta = 2222222222, .gamma = 3333333333, .delta = 4444444444});\n"
 right: "init(\n\t&(struct config){\n\t\t.alpha = 1111111111,\n\t\t.beta = 2222222222,\n\t\t.gamma = 3333333333,\n\t\t.delta = 4444444444,\n\t}\n);\n"

---- compound_literals_in_function_args stdout ----

thread 'compound_literals_in_function_args' (561879) panicked at tests/conformance.rs:302:5:
assertion `left == right` failed
  left: "dispatch(&(struct request){.id = 1234567, .kind = KIND_READ}, &response_buffer_out, default_timeout_ms);\n"
 right: "dispatch(\n\t&(struct request){.id = 1234567, .kind = KIND_READ},\n\t&response_buffer_out,\n\tdefault_timeout_ms\n);\n"

failures:
    collapses_a_call_that_now_fits
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literals_in_function_args
    declaration_with_brace_explodes_and_keeps_brace_attached
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    long_call_explodes_one_per_line

test result: FAILED. 41 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
