*** src/reflow.rs:404:42: replace + with - in structure

*** mutation diff:
--- src/reflow.rs
+++ replace + with - in structure
@@ -396,17 +396,17 @@
                 emit_str(&mut out, &mut col, tok.text);
             }
             i = emit_brace(toks, brace, true, &mut out, &mut col, width);
             continue;
         }
 
         if is_call_head(toks, i)
             && let Some(close) = match_bracket(toks, i + 1)
-            && !contains_comment(&toks[i + 2..close])
+            && !contains_comment(&toks[i - /* ~ changed by cargo-mutants ~ */ 2..close])
             && is_balanced(&toks[i + 2..close])
         {
             emit_str(&mut out, &mut col, t.text);
             let doc = build_call_doc(&toks[i + 2..close]);
             let base_level = current_line_indent_cols(&out) / TAB_WIDTH;
             let reserved = trailing_reserved(toks, close + 1);
             let rendered = render(&doc, width.saturating_sub(reserved), col, base_level);
             emit_str(&mut out, &mut col, &rendered);

---- call_with_line_comment_passes_through stdout ----

thread 'call_with_line_comment_passes_through' (562022) panicked at src/reflow.rs:404:40:
attempt to subtract with overflow

---- collapses_a_call_that_now_fits stdout ----

thread 'collapses_a_call_that_now_fits' (562024) panicked at src/reflow.rs:404:40:
attempt to subtract with overflow

---- compound_literal_arg_explodes_its_initializer_when_long stdout ----

thread 'compound_literal_arg_explodes_its_initializer_when_long' (562026) panicked at src/reflow.rs:404:40:
attempt to subtract with overflow

failures:
    call_with_line_comment_passes_through
    collapses_a_call_that_now_fits
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literals_in_function_args
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    messy_real_world_input_is_idempotent_and_safe
    nested_paren_comma_is_not_a_split_point
    short_call_stays_flat

test result: FAILED. 38 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
