*** src/reflow.rs:404:42: replace + with * in structure

*** mutation diff:
--- src/reflow.rs
+++ replace + with * in structure
@@ -396,17 +396,17 @@
                 emit_str(&mut out, &mut col, tok.text);
             }
             i = emit_brace(toks, brace, true, &mut out, &mut col, width);
             continue;
         }
 
         if is_call_head(toks, i)
             && let Some(close) = match_bracket(toks, i + 1)
-            && !contains_comment(&toks[i + 2..close])
+            && !contains_comment(&toks[i * /* ~ changed by cargo-mutants ~ */ 2..close])
             && is_balanced(&toks[i + 2..close])
         {
             emit_str(&mut out, &mut col, t.text);
             let doc = build_call_doc(&toks[i + 2..close]);
             let base_level = current_line_indent_cols(&out) / TAB_WIDTH;
             let reserved = trailing_reserved(toks, close + 1);
             let rendered = render(&doc, width.saturating_sub(reserved), col, base_level);
             emit_str(&mut out, &mut col, &rendered);

---- control_headers_are_not_calls stdout ----

thread 'control_headers_are_not_calls' (563813) panicked at src/reflow.rs:404:39:
range start index 28 out of range for slice of length 22

---- messy_real_world_input_is_idempotent_and_safe stdout ----

thread 'messy_real_world_input_is_idempotent_and_safe' (563836) panicked at src/reflow.rs:404:39:
slice index starts at 280 but ends at 165

---- pointers_are_middle_spaced_after_type_keywords stdout ----

thread 'pointers_are_middle_spaced_after_type_keywords' (563840) panicked at src/reflow.rs:404:39:
slice index starts at 8 but ends at 7

failures:
    control_headers_are_not_calls
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    messy_real_world_input_is_idempotent_and_safe
    pointers_are_middle_spaced_after_type_keywords
    showcase_content_is_preserved

test result: FAILED. 44 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
