*** src/reflow.rs:409:61: replace / with % in structure

*** mutation diff:
--- src/reflow.rs
+++ replace / with % in structure
@@ -401,17 +401,17 @@
 
         if is_call_head(toks, i)
             && let Some(close) = match_bracket(toks, i + 1)
             && !contains_comment(&toks[i + 2..close])
             && is_balanced(&toks[i + 2..close])
         {
             emit_str(&mut out, &mut col, t.text);
             let doc = build_call_doc(&toks[i + 2..close]);
-            let base_level = current_line_indent_cols(&out) / TAB_WIDTH;
+            let base_level = current_line_indent_cols(&out) % /* ~ changed by cargo-mutants ~ */ TAB_WIDTH;
             let reserved = trailing_reserved(toks, close + 1);
             let rendered = render(&doc, width.saturating_sub(reserved), col, base_level);
             emit_str(&mut out, &mut col, &rendered);
             i = close + 1;
             continue;
         }
 
         // GNU statement-expression `({ ... })` — block-indent its statements.

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (566019) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (566021) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 49 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
