*** src/reflow.rs:41:5: replace format_with_width -> String with String::new()

*** mutation diff:
--- src/reflow.rs
+++ replace format_with_width -> String with String::new()
@@ -33,22 +33,17 @@
 /// ```
 /// let narrow = cfmt::format_with_width("call(aaa, bbb, ccc);\n", 10);
 /// assert_eq!(narrow, "call(\n\taaa,\n\tbbb,\n\tccc\n);\n");
 /// ```
 pub fn format_with_width(src: &str, width: usize) -> String {
     // Token spacing runs first so the layout measures final widths — otherwise a space added
     // afterward (`(int)x` -> `(int) x`) could widen a line and flip a fits/explode decision on
     // the next pass, breaking idempotency.
-    let spaced = space_tokens(src);
-    normalize_endings(&collapse_blank_lines(&retab(&structure(
-        &tokenize(&spaced),
-        0,
-        width,
-    ))))
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Collapse runs of two or more blank lines to a single blank line everywhere (file scope and
 /// function bodies). Never inserts a blank line, so grouped declarations and adjacent closers are
 /// preserved. Comment interiors are untouched — their newlines live inside one comment token.
 fn collapse_blank_lines(s: &str) -> String {
     let mut out = String::with_capacity(s.len());
     let mut line = String::new();

---- ambiguous_star_is_left_alone stdout ----

thread 'ambiguous_star_is_left_alone' (460545) panicked at tests/conformance.rs:242:5:
assertion `left == right` failed
  left: ""
 right: "z = a*b;\n"

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (460551) panicked at tests/conformance.rs:337:5:
assertion `left == right` failed
  left: ""
 right: "int a;\n\nint b;\n"

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (460548) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: ""
 right: "struct s {\n\tint x: 2;\n};\n"

failures:
    ambiguous_star_is_left_alone
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    block_comment_internals_are_untouched
    brace_attaches_for_functions_and_control
    call_with_line_comment_passes_through
    casts_get_a_trailing_space
    collapses_a_call_that_now_fits
    collapses_initializer_without_trailing_comma
    compound_literal_arg_explodes_its_initializer_when_long
    compound_literal_brace_stays_tight
    compound_literal_initializer_explodes

test result: FAILED. 2 passed; 49 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
