*** src/reflow.rs:438:42: replace + with - in structure

*** mutation diff:
--- src/reflow.rs
+++ replace + with - in structure
@@ -430,17 +430,17 @@
         }
 
         // A parenthesized ternary `( ... ? ... : ... )` — flat chain, each `cond ? val :` on its
         // own line with the colon trailing (§2.4). Parens are author-written (§8.2), not inserted.
         if t.kind == TokenKind::Punct
             && t.text == "("
             && let Some(close) = match_bracket(toks, i)
             && has_top_level_question(&toks[i + 1..close])
-            && !contains_comment(&toks[i + 1..close])
+            && !contains_comment(&toks[i - /* ~ changed by cargo-mutants ~ */ 1..close])
             && is_balanced(&toks[i + 1..close])
         {
             let doc = build_ternary_doc(&toks[i + 1..close]);
             let base_level = current_line_indent_cols(&out) / TAB_WIDTH;
             let reserved = trailing_reserved(toks, close + 1);
             let rendered = render(&doc, width.saturating_sub(reserved), col, base_level);
             emit_str(&mut out, &mut col, &rendered);
             i = close + 1;

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (924600) panicked at src/reflow.rs:438:40:
attempt to subtract with overflow

thread 'format_is_idempotent' (924600) panicked at src/reflow.rs:438:40:
attempt to subtract with overflow

thread 'format_is_idempotent' (924600) panicked at src/reflow.rs:438:40:
attempt to subtract with overflow

thread 'format_is_idempotent' (924600) panicked at src/reflow.rs:438:40:
attempt to subtract with overflow

---- idempotent_across_widths stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'idempotent_across_widths' (924602) panicked at src/reflow.rs:438:40:
attempt to subtract with overflow

thread 'idempotent_across_widths' (924602) panicked at src/reflow.rs:438:40:
attempt to subtract with overflow

thread 'idempotent_across_widths' (924602) panicked at src/reflow.rs:438:40:
attempt to subtract with overflow

thread 'idempotent_across_widths' (924602) panicked at src/reflow.rs:438:40:
attempt to subtract with overflow

failures:
    format_is_idempotent
    idempotent_across_widths

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
