*** src/reflow.rs:442:61: replace / with % in structure

*** mutation diff:
--- src/reflow.rs
+++ replace / with % in structure
@@ -434,17 +434,17 @@
         if t.kind == TokenKind::Punct
             && t.text == "("
             && let Some(close) = match_bracket(toks, i)
             && has_top_level_question(&toks[i + 1..close])
             && !contains_comment(&toks[i + 1..close])
             && is_balanced(&toks[i + 1..close])
         {
             let doc = build_ternary_doc(&toks[i + 1..close]);
-            let base_level = current_line_indent_cols(&out) / TAB_WIDTH;
+            let base_level = current_line_indent_cols(&out) % /* ~ changed by cargo-mutants ~ */ TAB_WIDTH;
             let reserved = trailing_reserved(toks, close + 1);
             let rendered = render(&doc, width.saturating_sub(reserved), col, base_level);
             emit_str(&mut out, &mut col, &rendered);
             i = close + 1;
             continue;
         }
 
         // An initializer brace: in an `= ... ;` region, a `{` that is not a statement-expression.

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (580571) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (580569) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 49 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
