*** src/reflow.rs:452:13: replace && with || in structure

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in structure
@@ -444,17 +444,17 @@
             let rendered = render(&doc, width.saturating_sub(reserved), col, base_level);
             emit_str(&mut out, &mut col, &rendered);
             i = close + 1;
             continue;
         }
 
         // An initializer brace: in an `= ... ;` region, a `{` that is not a statement-expression.
         if in_init
-            && t.kind == TokenKind::Punct
+            || /* ~ changed by cargo-mutants ~ */ t.kind == TokenKind::Punct
             && t.text == "{"
             && last_nonspace_char(&out) != Some('(')
             && match_brace(toks, i).is_some()
         {
             i = emit_brace(toks, i, false, &mut out, &mut col, width);
             continue;
         }

---- bit_field_colon_spacing stdout ----

thread 'bit_field_colon_spacing' (931346) panicked at tests/conformance.rs:314:5:
assertion `left == right` failed
  left: "struct s {int x: 2;};\n"
 right: "struct s {\n\tint x: 2;\n};\n"

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (931347) panicked at tests/conformance.rs:339:5:
assertion `left == right` failed
  left: "void f(void) {int a; int b;}\n"
 right: "void f(void) {\n\tint a;\n\n\tint b;\n}\n"

---- condition_splits_on_the_outer_logical_operator stdout ----

thread 'condition_splits_on_the_outer_logical_operator' (931358) panicked at tests/conformance.rs:396:5:
assertion `left == right` failed
  left: "if (\n\talpha_value > 100 ||\n\tbravo_value > 200 ||\n\tcharlie_value > 300 ||\n\tdelta_value > 400 ||\n\techo_v > 5\n) {}\n"
 right: "if (\n\talpha_value > 100 ||\n\tbravo_value > 200 ||\n\tcharlie_value > 300 ||\n\tdelta_value > 400 ||\n\techo_v > 5\n) {\n}\n"

failures:
    bit_field_colon_spacing
    blank_line_runs_collapse_to_one_everywhere
    condition_splits_on_the_outer_logical_operator
    control_headers_are_not_calls
    control_keyword_gets_one_space_before_paren
    for_header_is_not_treated_as_a_call
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    indentation_is_normalized_to_tabs
    long_for_header_explodes_one_clause_per_line
    long_if_condition_explodes_with_trailing_operators
    short_control_headers_unchanged

test result: FAILED. 41 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
