*** src/reflow.rs:465:24: replace match guard paren_depth == 0 with true in structure

*** mutation diff:
--- src/reflow.rs
+++ replace match guard paren_depth == 0 with true in structure
@@ -457,17 +457,17 @@
             i = emit_brace(toks, i, false, &mut out, &mut col, width);
             continue;
         }
 
         if t.kind == TokenKind::Punct {
             match t.text {
                 "(" | "[" => paren_depth += 1,
                 ")" | "]" => paren_depth = (paren_depth - 1).max(0),
-                "=" if paren_depth == 0 => in_init = true,
+                "=" if true /* ~ changed by cargo-mutants ~ */ => in_init = true,
                 ";" if paren_depth == 0 => in_init = false,
                 _ => {}
             }
         }
         emit_str(&mut out, &mut col, t.text);
         i += 1;
     }
     out

*** result: Success
