*** src/reflow.rs:465:36: replace == with != in structure

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in structure
@@ -457,17 +457,17 @@
             i = emit_brace(toks, i, false, &mut out, &mut col, width);
             continue;
         }
 
         if t.kind == TokenKind::Punct {
             match t.text {
                 "(" | "[" => paren_depth += 1,
                 ")" | "]" => paren_depth = (paren_depth - 1).max(0),
-                "=" if paren_depth == 0 => in_init = true,
+                "=" if paren_depth != /* ~ changed by cargo-mutants ~ */ 0 => in_init = true,
                 ";" if paren_depth == 0 => in_init = false,
                 _ => {}
             }
         }
         emit_str(&mut out, &mut col, t.text);
         i += 1;
     }
     out

---- collapses_initializer_without_trailing_comma stdout ----

thread 'collapses_initializer_without_trailing_comma' (939673) panicked at tests/conformance.rs:172:5:
assertion `left == right` failed
  left: "int v[] = {\n\t1,\n\t2,\n\t3\n};\n"
 right: "int v[] = {1, 2, 3};\n"

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (939683) panicked at tests/conformance.rs:418:5:
assertion `left == right` failed
  left: "p = &(struct shape){.tag = R, .rect = {.w = 3, .h = 4},};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

---- magic_trailing_comma_forces_explosion_with_trailing_comma stdout ----

thread 'magic_trailing_comma_forces_explosion_with_trailing_comma' (939759) panicked at tests/conformance.rs:166:5:
assertion `left == right` failed
  left: "int v[] = {1, 2, 3,};\n"
 right: "int v[] = {\n\t1,\n\t2,\n\t3,\n};\n"

failures:
    collapses_initializer_without_trailing_comma
    compound_literal_initializer_explodes
    magic_trailing_comma_forces_explosion_with_trailing_comma
    nested_initializer_collapses_independently

test result: FAILED. 49 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
