*** src/reflow.rs:466:24: replace match guard paren_depth == 0 with true in structure

*** mutation diff:
--- src/reflow.rs
+++ replace match guard paren_depth == 0 with true in structure
@@ -458,17 +458,17 @@
             continue;
         }
 
         if t.kind == TokenKind::Punct {
             match t.text {
                 "(" | "[" => paren_depth += 1,
                 ")" | "]" => paren_depth = (paren_depth - 1).max(0),
                 "=" if paren_depth == 0 => in_init = true,
-                ";" if paren_depth == 0 => in_init = false,
+                ";" if true /* ~ changed by cargo-mutants ~ */ => in_init = false,
                 _ => {}
             }
         }
         emit_str(&mut out, &mut col, t.text);
         i += 1;
     }
     out
 }

*** result: Success
