*** src/reflow.rs:466:36: replace == with != in structure

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in structure
@@ -458,17 +458,17 @@
             continue;
         }
 
         if t.kind == TokenKind::Punct {
             match t.text {
                 "(" | "[" => paren_depth += 1,
                 ")" | "]" => paren_depth = (paren_depth - 1).max(0),
                 "=" if paren_depth == 0 => in_init = true,
-                ";" if paren_depth == 0 => in_init = false,
+                ";" if paren_depth != /* ~ changed by cargo-mutants ~ */ 0 => in_init = false,
                 _ => {}
             }
         }
         emit_str(&mut out, &mut col, t.text);
         i += 1;
     }
     out
 }

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (939734) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (939722) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 51 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
