*** src/reflow.rs:486:5: replace emit_define -> usize with 1

*** mutation diff:
--- src/reflow.rs
+++ replace emit_define -> usize with 1
@@ -478,30 +478,17 @@
 /// continuations one space after each line; any other body is emitted verbatim.
 fn emit_define(
     toks: &[Token],
     start: usize,
     out: &mut String,
     col: &mut usize,
     width: usize,
 ) -> usize {
-    let end = directive_end(toks, start);
-    if let Some((prefix, body)) = split_define(toks, start, end)
-        && let Some(body_str) = format_define_body(&body, display_width(&prefix), width)
-    {
-        let full = format!("{prefix}{body_str}");
-        let continued = full.split('\n').collect::<Vec<_>>().join(" \\\n");
-        emit_str(out, col, &continued);
-        emit_str(out, col, "\n");
-        return end;
-    }
-    for tok in &toks[start..end] {
-        emit_str(out, col, tok.text);
-    }
-    end
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Split a `#define` into its `#define NAME(params) ` prefix text and its body tokens (with
 /// continuation backslashes removed and surrounding trivia trimmed). `None` if it has no body.
 fn split_define<'src>(
     toks: &[Token<'src>],
     start: usize,
     end: usize,

*** result: Timeout
