*** src/reflow.rs:544:30: replace && with || in format_define_body

*** mutation diff:
--- src/reflow.rs
+++ replace && with || in format_define_body
@@ -536,17 +536,17 @@
     Some((prefix, body))
 }
 
 /// Format a macro body if it is a single call/`_Generic` or a statement-expression; else `None`.
 fn format_define_body(body: &[Token], prefix_col: usize, width: usize) -> Option<String> {
     if contains_comment(body) {
         return None;
     }
-    if is_call_head(body, 0) && match_bracket(body, 1) == Some(body.len() - 1) {
+    if is_call_head(body, 0) || /* ~ changed by cargo-mutants ~ */ match_bracket(body, 1) == Some(body.len() - 1) {
         return Some(structure(body, prefix_col, width));
     }
     if body.len() >= 2
         && body[0].kind == TokenKind::Punct
         && body[0].text == "("
         && body[1].kind == TokenKind::Punct
         && body[1].text == "{"
     {

*** result: Success
