*** src/reflow.rs:562:5: replace format_stmt_expr -> Option<(String, usize)> with Some((String::new(), 1))

*** mutation diff:
--- src/reflow.rs
+++ replace format_stmt_expr -> Option<(String, usize)> with Some((String::new(), 1))
@@ -554,48 +554,17 @@
     }
     None
 }
 
 /// Format a `({ ... })` statement-expression: `({` opens the line, each statement on its own line
 /// at `base_level + 1`, `})` at `base_level`. Returns the block and the index past the `)`, or
 /// `None` if the braces are unbalanced or a statement nests a block or carries a comment.
 fn format_stmt_expr(toks: &[Token], open: usize, base_level: usize) -> Option<(String, usize)> {
-    let paren_close = match_bracket(toks, open)?;
-    let brace_close = match_brace(toks, open + 1)?;
-    let inner = &toks[open + 2..brace_close];
-    let unformattable = inner.iter().any(|t| {
-        (t.kind == TokenKind::Punct && t.text == "{")
-            || matches!(t.kind, TokenKind::LineComment | TokenKind::BlockComment)
-    });
-    if unformattable || !is_balanced(inner) {
-        return None;
-    }
-    let statements: Vec<String> =
-        split_top_level(inner, |t| t.kind == TokenKind::Punct && t.text == ";")
-            .iter()
-            .map(|s| render_segment(s))
-            .filter(|s| !s.is_empty())
-            .collect();
-    if statements.is_empty() {
-        return None;
-    }
-    let inner_indent = "\t".repeat(base_level + 1);
-    let close_indent = "\t".repeat(base_level);
-    let mut s = String::from("({");
-    for statement in &statements {
-        s.push('\n');
-        s.push_str(&inner_indent);
-        s.push_str(statement);
-        s.push(';');
-    }
-    s.push('\n');
-    s.push_str(&close_indent);
-    s.push_str("})");
-    Some((s, paren_close + 1))
+    Some((String::new(), 1)) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Format the `{...}` opening at `open` (an initializer when `padded` is false, an enum body when
 /// true) and return the index just past its `}`. Falls back to verbatim if the braces are
 /// unbalanced or the list contains a comment or directive (deferred to M7).
 fn emit_brace(
     toks: &[Token],
     open: usize,

*** result: Success
