*** src/reflow.rs:593:26: replace + with - in format_stmt_expr

*** mutation diff:
--- src/reflow.rs
+++ replace + with - in format_stmt_expr
@@ -585,17 +585,17 @@
         s.push('\n');
         s.push_str(&inner_indent);
         s.push_str(statement);
         s.push(';');
     }
     s.push('\n');
     s.push_str(&close_indent);
     s.push_str("})");
-    Some((s, paren_close + 1))
+    Some((s, paren_close - /* ~ changed by cargo-mutants ~ */ 1))
 }
 
 /// Format the `{...}` opening at `open` (an initializer when `padded` is false, an enum body when
 /// true) and return the index just past its `}`. Falls back to verbatim if the braces are
 /// unbalanced or the list contains a comment or directive (deferred to M7).
 fn emit_brace(
     toks: &[Token],
     open: usize,

---- statement_expression_in_code_block_indents stdout ----

thread 'statement_expression_in_code_block_indents' (628133) panicked at tests/conformance.rs:451:5:
assertion `left == right` failed
  left: "int d = ({\n\tint t = larger;\n\tt * 2;\n})});\n"
 right: "int d = ({\n\tint t = larger;\n\tt * 2;\n});\n"

---- messy_real_world_input_is_idempotent_and_safe stdout ----

thread 'messy_real_world_input_is_idempotent_and_safe' (628105) panicked at tests/conformance.rs:70:5:
assertion `left == right` failed: must be idempotent on messy input

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (628082) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    messy_real_world_input_is_idempotent_and_safe
    showcase_content_is_preserved
    statement_expression_in_code_block_indents

test result: FAILED. 45 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
