*** src/reflow.rs:611:28: replace + with - in emit_brace

*** mutation diff:
--- src/reflow.rs
+++ replace + with - in emit_brace
@@ -603,17 +603,17 @@
     out: &mut String,
     col: &mut usize,
     width: usize,
 ) -> usize {
     let Some(close) = match_brace(toks, open) else {
         emit_str(out, col, toks[open].text);
         return open + 1;
     };
-    let inner = &toks[open + 1..close];
+    let inner = &toks[open - /* ~ changed by cargo-mutants ~ */ 1..close];
     let has_comment_or_directive = inner.iter().any(|t| {
         matches!(t.kind, TokenKind::LineComment | TokenKind::BlockComment)
             || (t.kind == TokenKind::Punct && t.text == "#")
     });
     if has_comment_or_directive || !is_balanced(inner) {
         for tok in &toks[open..=close] {
             emit_str(out, col, tok.text);
         }

---- compound_literal_initializer_explodes stdout ----

thread 'compound_literal_initializer_explodes' (631087) panicked at tests/conformance.rs:403:5:
assertion `left == right` failed
  left: "p = &(struct shape){.tag = R, .rect = {.w = 3, .h = 4},};\n"
 right: "p = &(struct shape){\n\t.tag = R,\n\t.rect = {.w = 3, .h = 4},\n};\n"

---- collapses_initializer_without_trailing_comma stdout ----

thread 'collapses_initializer_without_trailing_comma' (631084) panicked at tests/conformance.rs:172:5:
assertion `left == right` failed
  left: "int v[] = {\n\t1,\n\t2,\n\t3\n};\n"
 right: "int v[] = {1, 2, 3};\n"

---- enum_magic_comma_explodes stdout ----

thread 'enum_magic_comma_explodes' (631095) panicked at tests/conformance.rs:195:5:
assertion `left == right` failed
  left: "enum color { RED, GREEN, BLUE, };\n"
 right: "enum color {\n\tRED,\n\tGREEN,\n\tBLUE,\n};\n"

failures:
    collapses_initializer_without_trailing_comma
    compound_literal_initializer_explodes
    enum_magic_comma_explodes
    magic_trailing_comma_forces_explosion_with_trailing_comma
    nested_initializer_collapses_independently

test result: FAILED. 46 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
