*** src/reflow.rs:614:13: replace || with && in emit_brace

*** mutation diff:
--- src/reflow.rs
+++ replace || with && in emit_brace
@@ -606,17 +606,17 @@
 ) -> usize {
     let Some(close) = match_brace(toks, open) else {
         emit_str(out, col, toks[open].text);
         return open + 1;
     };
     let inner = &toks[open + 1..close];
     let has_comment_or_directive = inner.iter().any(|t| {
         matches!(t.kind, TokenKind::LineComment | TokenKind::BlockComment)
-            || (t.kind == TokenKind::Punct && t.text == "#")
+            && /* ~ changed by cargo-mutants ~ */ (t.kind == TokenKind::Punct && t.text == "#")
     });
     if has_comment_or_directive || !is_balanced(inner) {
         for tok in &toks[open..=close] {
             emit_str(out, col, tok.text);
         }
         return close + 1;
     }
     let base_level = current_line_indent_cols(out) / TAB_WIDTH;

---- initializer_with_comment_keeps_structure_but_retabs stdout ----

thread 'initializer_with_comment_keeps_structure_but_retabs' (632106) panicked at tests/conformance.rs:203:5:
assertion `left == right` failed
  left: "int v[] = {\n\t1,\n\t/* one */ 2,\n};\n"
 right: "int v[] = {\n\t1, /* one */\n\t2,\n};\n"

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (632103) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (632100) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    initializer_with_comment_keeps_structure_but_retabs

test result: FAILED. 48 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
