*** src/reflow.rs:623:50: replace + with - in emit_brace

*** mutation diff:
--- src/reflow.rs
+++ replace + with - in emit_brace
@@ -615,17 +615,17 @@
     });
     if has_comment_or_directive || !is_balanced(inner) {
         for tok in &toks[open..=close] {
             emit_str(out, col, tok.text);
         }
         return close + 1;
     }
     let base_level = current_line_indent_cols(out) / TAB_WIDTH;
-    let reserved = trailing_reserved(toks, close + 1);
+    let reserved = trailing_reserved(toks, close - /* ~ changed by cargo-mutants ~ */ 1);
     let doc = build_brace_doc(inner, padded);
     let rendered = render(&doc, width.saturating_sub(reserved), *col, base_level);
     emit_str(out, col, &rendered);
     close + 1
 }
 
 /// Append `s` to `out`, tracking the display column (tabs count as [`TAB_WIDTH`]).
 fn emit_str(out: &mut String, col: &mut usize, s: &str) {

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (637065) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"''\n0_ a#aa(\n\t*&0_a&a0 *\n)\"a.0aA0 a&A&aa\n A_a0  0a&Aa0.\t_ 0.A Aa.0a0a.aA \t&_a0 0&\"\t0Aa.\".00]A0\n]A&\n"`,
 right: `"''\n0_ a#aa(*&0_a&a0 *)\"a.0aA0 a&A&aa\n A_a0  0a&Aa0.\t_ 0.A Aa.0a0a.aA \t&_a0 0&\"\t0Aa.\".00]A0\n]A&\n"` at tests/properties.rs:17.
minimal failing input: s = "''\n0_ a#aa(*&0_a&a0\t*)\"a.0aA0 a&A&aa\n A_a0  0a&Aa0.\t_ 0.A Aa.0a0a.aA \t&_a0 0&\"\t0Aa.\".00]A0\n]A&"
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
