*** src/reflow.rs:653:5: replace current_line_is_blank -> bool with false

*** mutation diff:
--- src/reflow.rs
+++ replace current_line_is_blank -> bool with false
@@ -645,19 +645,17 @@
             }
         }
     }
 }
 
 /// True when nothing but whitespace has been emitted on the current output line — so a `#` here
 /// begins a preprocessor directive.
 fn current_line_is_blank(out: &str) -> bool {
-    out.rsplit('\n')
-        .next()
-        .is_none_or(|line| line.chars().all(|c| c == ' ' || c == '\t'))
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Indentation, in columns, of the current output line.
 fn current_line_indent_cols(out: &str) -> usize {
     let line = out.rsplit('\n').next().unwrap_or(out);
     let mut cols = 0;
     for ch in line.chars() {
         match ch {

---- function_like_macro_body_opens_on_define_line stdout ----

thread 'function_like_macro_body_opens_on_define_line' (642032) panicked at tests/conformance.rs:410:5:
assertion `left == right` failed
  left: "#define DISPATCH_EVENT(handler, event) dispatch_incoming_event(\n\t(handler),\n\t(event),\n\tread_monotonic_timestamp_ms(),\n\tcurrent_execution_context_id()\n)\n"
 right: "#define DISPATCH_EVENT(handler, event) dispatch_incoming_event( \\\n\t(handler), \\\n\t(event), \\\n\tread_monotonic_timestamp_ms(), \\\n\tcurrent_execution_context_id() \\\n)\n"

---- generic_macro_explodes_one_association_per_line stdout ----

thread 'generic_macro_explodes_one_association_per_line' (642034) panicked at tests/conformance.rs:425:5:
assertion `left == right` failed
  left: "#define type_name(x) _Generic(\n\t(x),\n\tint: \"int\",\n\tlong: \"long\",\n\tfloat: \"float\",\n\tdouble: \"double\",\n\tdefault: \"other\"\n)\n"
 right: "#define type_name(x) _Generic( \\\n\t(x), \\\n\tint: \"int\", \\\n\tlong: \"long\", \\\n\tfloat: \"float\", \\\n\tdouble: \"double\", \\\n\tdefault: \"other\" \\\n)\n"

---- statement_expression_macro_blocks_with_continuations stdout ----

thread 'statement_expression_macro_blocks_with_continuations' (642058) panicked at tests/conformance.rs:418:5:
assertion `left == right` failed
  left: "#define MAX(a, b) ({\n\ttypeof(a) _a = (a);\n\ttypeof(b) _b = (b);\n\t_a > _b ? _a : _b;\n})\n"
 right: "#define MAX(a, b) ({ \\\n\ttypeof(a) _a = (a); \\\n\ttypeof(b) _b = (b); \\\n\t_a > _b ? _a : _b; \\\n})\n"

failures:
    function_like_macro_body_opens_on_define_line
    generic_macro_explodes_one_association_per_line
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    showcase_content_is_preserved
    statement_expression_macro_blocks_with_continuations

test result: FAILED. 45 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
