*** src/reflow.rs:655:51: replace == with != in current_line_is_blank

*** mutation diff:
--- src/reflow.rs
+++ replace == with != in current_line_is_blank
@@ -647,17 +647,17 @@
     }
 }
 
 /// True when nothing but whitespace has been emitted on the current output line — so a `#` here
 /// begins a preprocessor directive.
 fn current_line_is_blank(out: &str) -> bool {
     out.rsplit('\n')
         .next()
-        .is_none_or(|line| line.chars().all(|c| c == ' ' || c == '\t'))
+        .is_none_or(|line| line.chars().all(|c| c != /* ~ changed by cargo-mutants ~ */ ' ' || c == '\t'))
 }
 
 /// Indentation, in columns, of the current output line.
 fn current_line_indent_cols(out: &str) -> usize {
     let line = out.rsplit('\n').next().unwrap_or(out);
     let mut cols = 0;
     for ch in line.chars() {
         match ch {

---- format_is_idempotent stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'format_is_idempotent' (643108) panicked at tests/properties.rs:13:1:
Test failed: assertion failed: `(left == right)` 
  left: `"''\n0_ a#aa(\n\t*&0_a&a0 *\n)\"a.0aA0 a&A&aa\n A_a0  0a&Aa0.\t_ 0.A Aa.0a0a.aA \t&_a0 0&\"\t0Aa.\".00]A0\n]A&\n"`,
 right: `"''\n0_ a#aa(*&0_a&a0 *)\"a.0aA0 a&A&aa\n A_a0  0a&Aa0.\t_ 0.A Aa.0a0a.aA \t&_a0 0&\"\t0Aa.\".00]A0\n]A&\n"` at tests/properties.rs:17.
minimal failing input: s = "''\n0_ a#aa(*&0_a&a0\t*)\"a.0aA0 a&A&aa\n A_a0  0a&Aa0.\t_ 0.A Aa.0a0a.aA \t&_a0 0&\"\t0Aa.\".00]A0\n]A&"
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    format_is_idempotent

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
