*** src/reflow.rs:65:31: replace += with -= in collapse_blank_lines

*** mutation diff:
--- src/reflow.rs
+++ replace += with -= in collapse_blank_lines
@@ -57,17 +57,17 @@
     for t in tokenize(s) {
         match t.kind {
             TokenKind::Newline => {
                 if has_content {
                     out.push_str(&line);
                     out.push('\n');
                     blank_run = 0;
                 } else {
-                    blank_run += 1;
+                    blank_run -= /* ~ changed by cargo-mutants ~ */ 1;
                     if blank_run <= 1 {
                         out.push('\n');
                     }
                 }
                 line.clear();
                 has_content = false;
             }
             TokenKind::Whitespace => line.push_str(t.text),

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (463209) panicked at src/reflow.rs:65:21:
attempt to subtract with overflow

---- exactly_one_trailing_newline stdout ----

thread 'exactly_one_trailing_newline' (463227) panicked at src/reflow.rs:65:21:
attempt to subtract with overflow

---- messy_real_world_input_is_idempotent_and_safe stdout ----

thread 'messy_real_world_input_is_idempotent_and_safe' (463243) panicked at src/reflow.rs:65:21:
attempt to subtract with overflow

failures:
    blank_line_runs_collapse_to_one_everywhere
    exactly_one_trailing_newline
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint
    idempotent_on_showcase
    messy_real_world_input_is_idempotent_and_safe
    showcase_content_is_preserved

test result: FAILED. 44 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
