*** src/reflow.rs:66:34: replace <= with > in collapse_blank_lines

*** mutation diff:
--- src/reflow.rs
+++ replace <= with > in collapse_blank_lines
@@ -58,17 +58,17 @@
         match t.kind {
             TokenKind::Newline => {
                 if has_content {
                     out.push_str(&line);
                     out.push('\n');
                     blank_run = 0;
                 } else {
                     blank_run += 1;
-                    if blank_run <= 1 {
+                    if blank_run > /* ~ changed by cargo-mutants ~ */ 1 {
                         out.push('\n');
                     }
                 }
                 line.clear();
                 has_content = false;
             }
             TokenKind::Whitespace => line.push_str(t.text),
             _ => {

---- blank_line_runs_collapse_to_one_everywhere stdout ----

thread 'blank_line_runs_collapse_to_one_everywhere' (812880) panicked at tests/conformance.rs:344:5:
assertion `left == right` failed
  left: "int a;\nint b;\nint c;\n"
 right: "int a;\nint b;\n\nint c;\n"

---- golden_is_a_fixpoint stdout ----

thread 'golden_is_a_fixpoint' (812906) panicked at tests/conformance.rs:45:5:
assertion `left == right` failed: golden must be idempotent

---- golden_acceptance_unguarded_showcase stdout ----

thread 'golden_acceptance_unguarded_showcase' (812904) panicked at tests/conformance.rs:36:5:
assertion `left == right` failed: cfmt must reproduce the golden from the guard-removed showcase

failures:
    blank_line_runs_collapse_to_one_everywhere
    golden_acceptance_unguarded_showcase
    golden_is_a_fixpoint

test result: FAILED. 50 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
