*** src/reflow.rs:88:5: replace is_type_context -> bool with false

*** mutation diff:
--- src/reflow.rs
+++ replace is_type_context -> bool with false
@@ -80,34 +80,17 @@
     out.push_str(&line);
     out
 }
 
 /// A C type keyword or qualifier — a token after which a `*` is confidently a pointer declarator,
 /// not a multiply. User typedefs (idents) are excluded, so ambiguous `a*b`/`foo*p` pass through
 /// (§2.5 pointers, §6 "prefer passthrough when ambiguous").
 fn is_type_context(text: &str) -> bool {
-    matches!(
-        text,
-        "void"
-            | "char"
-            | "short"
-            | "int"
-            | "long"
-            | "float"
-            | "double"
-            | "signed"
-            | "unsigned"
-            | "_Bool"
-            | "bool"
-            | "const"
-            | "volatile"
-            | "_Atomic"
-            | "restrict"
-    )
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// A significant token paired with the whitespace that preceded it.
 type Piece<'src> = (String, Token<'src>);
 
 fn same_line(gap: &str) -> bool {
     !gap.contains('\n')
 }

---- casts_get_a_trailing_space stdout ----

thread 'casts_get_a_trailing_space' (465195) panicked at tests/conformance.rs:261:5:
assertion `left == right` failed
  left: "x = (int)y;\n"
 right: "x = (int) y;\n"

---- pointers_are_middle_spaced_after_type_keywords stdout ----

thread 'pointers_are_middle_spaced_after_type_keywords' (465237) panicked at tests/conformance.rs:233:5:
assertion `left == right` failed
  left: "int*p;\n"
 right: "int * p;\n"

failures:
    casts_get_a_trailing_space
    pointers_are_middle_spaced_after_type_keywords

test result: FAILED. 49 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
